{"code": "15Mcob5_tyU", "title": "They figured out atoms existed thousands of years ago but we are still depressed lmao🙌 BOOK REVIEW 🙌", "url": "https://www.youtube.com/watch?v=15Mcob5_tyU", "thumbnail_url": "https://i.ytimg.com/vi/15Mcob5_tyU/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLApB6aJb9qi_6KfX86twtoiEd7g4g", "views": 2000000, "likes": 189000, "duration": 718, "embed_code": "https://www.youtube.com/embed/15Mcob5_tyU", "uploaded_date": "10 Dec 2021", "comments_count": 8011, "comments": [{"comment": "\"Actually the xyv came up with the atom before.\" \nNever said they were first, Its an example to show how they were using science as a viewpoint of their philosophy.", "commenter_channel_name": "@PewDiePie", "likes": 12000, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:37.170915", "replies_count": null, "liked_by_creator": false}, {"comment": "Show me how to be happy pls.", "commenter_channel_name": "@CinnamonToastKen", "likes": 3000, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:37.207217", "replies_count": null, "liked_by_creator": false}, {"comment": "I can’t lie these titles are just getting better and better", "commenter_channel_name": "@DrDuke", "likes": 3000, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:37.255781", "replies_count": null, "liked_by_creator": false}, {"comment": "I love these kinds of videos his “hey let’s talk about things”  stuff is great. The book reviews the ideology philosophy stuff it’s nice to have them", "commenter_channel_name": "@christianguest63", "likes": 10000, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:37.291867", "replies_count": null, "liked_by_creator": false}, {"comment": "I love this type of videos! They really help me out\n\nOct. 27 you posted a video about addiction, saying that to crave is to suffer; how you used to be addicted to whiskey, then nicotine. That really resonated with me. I threw out my vape that day. I had been smoking for a lil over a year and was looking for any excuse not to throw it out. \"All my friends do it.\"  \"It's not that bad.\" You gave me a sense of clarity with your video and inspired me to get into philosophy. You are right though, once you get rid of the source of addiction, the addiction is still there. It moved onto my phone. I've been addicted to social media and dating apps. I will delete them from my phone then in a couple days, redownload them. I don't like that pattern and I want it to stop. I deleted them again and hope to never redownload them. I think I need to be alone with my thoughts for a while. Thanks for the videos :)", "commenter_channel_name": "@zachmanhansen", "likes": 360, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:37.328287", "replies_count": null, "liked_by_creator": false}, {"comment": "I really love these videos, they're informational without being overly complicated; thanks so much :)", "commenter_channel_name": "@Ellbat", "likes": 4000, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:37.369313", "replies_count": null, "liked_by_creator": false}, {"comment": "seeing Felix talk about philosophy is actually so soothing and I feel like im genuinely learning things. Thanks Pewds (,:", "commenter_channel_name": "@CarlosG1132", "likes": 454, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:37.405624", "replies_count": null, "liked_by_creator": false}, {"comment": "I've been watching pewdiepie since 2014-2015 and I stopped for almost a year now. It felt good to be back. I just wanted to say  thank you for making my childhood awesome.", "commenter_channel_name": "@miidorii1", "likes": 79, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:37.439474", "replies_count": 0, "liked_by_creator": false}, {"comment": "I just imagine while Sive is editing this, he starts to rethink his entire existence", "commenter_channel_name": "@filipilino3424", "likes": 426, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:37.475943", "replies_count": null, "liked_by_creator": false}, {"comment": "I love when Felix gets his thoughts out about philosophy. I feel like I'm sitting in a discussion group", "commenter_channel_name": "@deletedmeep1590", "likes": 394, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:37.511410", "replies_count": null, "liked_by_creator": false}, {"comment": "Felix: there's a natural way of explaining a rainbow, it's not some Irish dude hiding treasure.\n\nJack: little did he know...", "commenter_channel_name": "@Djpupower095", "likes": 359, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:37.663539", "replies_count": null, "liked_by_creator": false}, {"comment": "This guy has truly changed my life.  He sparked my interest in self improvement, and he brought the idea of stoicism to my attention 2-3 years ago when I was 16 or 17.  I was a really feminine as a kid, didn’t like to do work, just wanted to indulge in content consumption, nicotine, weed, etc.   I hated myself.  I believed that I would never find love.   However over the past 2-3 years of working out, gaining control over my mind instead of being controlled by it, learning about and implementing stoicism, working instead of consuming content, so on and so on, I have managed to get in great shape, become a masculine young man who aspires to be a real stoic, got a gf, set a goal to become an engineer, and most importantly I have stopped obsessing over my own self hatred and began to actually like who I am.", "commenter_channel_name": "@chimpanzeeenjoyer4667", "likes": 13, "date": "1 year ago", "fetched_date": "2025-01-19 14:51:37.704869", "replies_count": null, "liked_by_creator": false}, {"comment": "I love this. I also love how Felix has become more personalized. It actually feels like he’s talking to us about something he’s interested in with a close friend. These type of topics are the ones you have with people who genuinely wanna share ideas and learn from one another. I hope he does this more often. Not just this video, but sharing his thoughts about things he’s passionate about :)", "commenter_channel_name": "@voicethrives9669", "likes": 330, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:37.740853", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewds being genuinely passionate about what he’s talking about is wholesome and we need more of it", "commenter_channel_name": "@dennysfosho", "likes": 1000, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:37.778249", "replies_count": null, "liked_by_creator": false}, {"comment": "-Félix: HAHA MEEEEMES!\n-Also Felix: so let's talk about the greeks..\n\nI just love this channel....", "commenter_channel_name": "@alejandrosegato671", "likes": 725, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:37.820284", "replies_count": null, "liked_by_creator": false}, {"comment": "Having dealt with anxiety and depression most of my life, and hearing someone talk about a different facet of it through philosophy and science is really cool. I take your shared knowledge in stride pewds. It’s awesome to have watched this channel change and grow. And these kind of videos don’t go unappreciated. That’s for sure.", "commenter_channel_name": "@justalonzo9362", "likes": 93, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:51:37.856828", "replies_count": null, "liked_by_creator": false}, {"comment": "I really appreciate Pewds making content such as this, talking about Greek Philosophy. As an instructor of philosophy to college students, many are very interested on philosophical topics, and I can recommend to them this video (in support to the literatures) for them to easily understand what is being pointed on our discussions in Greek thought.\n\nThanks Pewds. Much love and support here.", "commenter_channel_name": "@LordOblivion_", "likes": 281, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:37.891088", "replies_count": null, "liked_by_creator": false}, {"comment": "It's so odd to see Pews saying the same things we learned about in my Philosophy and Ethics class. He's really grown and I like that he is here to inspire others to grow as people.", "commenter_channel_name": "@mesp3786", "likes": 783, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:37.926726", "replies_count": null, "liked_by_creator": false}, {"comment": "God I miss these videos, thank you man!", "commenter_channel_name": "@OdinTube", "likes": 820, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:37.962192", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewds is recommending Hellenistic philosophers at the right time, especially those who were responding to the decline of the polis. Epicurus is the closest philosophy gets to self-help, and could be the exact right book for some people dealing with the heightened anxieties of the moment.\n\nIt’s encouraging that these thinkers are finding an audience through popular recommendation, even when the Stoics, Epicureans, and Academic skeptics are treated like an intellectual backwater in your average Phil dept.", "commenter_channel_name": "@stevnye45", "likes": 104, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:37.998237", "replies_count": null, "liked_by_creator": false}, {"comment": "I love it when Felix talks about stuff he's interested in or thinks is interesting, and proceeds to make videos to share with us what he thinks about them. It's always nice to hear what he has to say about stuff, especially in philosophy. Makes it really engaging, like he's just having a conversation while we're listening to him talk.", "commenter_channel_name": "@sffb8295", "likes": 282, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:38.033627", "replies_count": null, "liked_by_creator": false}, {"comment": "Can I just point out how Pewds can explain so well that he doesn't even need a script, and also Sive that is so good on catching Pewds on certain times makes them a good partners.", "commenter_channel_name": "@philgabrielmondragon9060", "likes": 361, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:38.069499", "replies_count": null, "liked_by_creator": false}, {"comment": "I'm glad that you talked about science and the idea that people are afraid of what they don't know because, as a chemist, I find myself arguing with people, especially on the interntet, because media and companies are exploiting the word \"natural\" to promote products to the point that everybody has become afraid of chemistry. Most people now think that \"chemical\" means something bad but they don't realize that everything in the universe is made of atoms and molecules and that everithing works because chemical reactions are taking place, which include \"natural\" substances.", "commenter_channel_name": "@alicepavan168", "likes": 422, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:51:38.104909", "replies_count": null, "liked_by_creator": false}, {"comment": "as a greek… i can’t express how happy it makes me watching him appreciate our history, thank you", "commenter_channel_name": "@douvaman", "likes": 15, "date": "2 years ago", "fetched_date": "2025-01-19 14:51:38.138105", "replies_count": 0, "liked_by_creator": false}, {"comment": "As a philosophy minor who studied and even practiced epicurianism for a long time, I'm so happy that Felix is bringing this philosophical view to a broad audience!", "commenter_channel_name": "@christianauditore7273", "likes": 285, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:38.174068", "replies_count": null, "liked_by_creator": false}, {"comment": "I ain't gonna lie, I'd be hella down for more philosophy videos like this in the future. This was wonderful to listen to.", "commenter_channel_name": "@inexplicablepresence8274", "likes": 184, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:38.207578", "replies_count": 0, "liked_by_creator": false}, {"comment": "Fun fact: Pewdiepie's Beard changes his personality", "commenter_channel_name": "@stickhick1668", "likes": 3000, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:38.243077", "replies_count": null, "liked_by_creator": false}, {"comment": "I actually prefer watching these vids than the usual ones. I think it's good that you're using your reach to spread some wisdom.", "commenter_channel_name": "@Kalvinism", "likes": 108, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:38.275889", "replies_count": 0, "liked_by_creator": false}, {"comment": "Love these kind of “deep talk” videos. They make me think and they’re so chill and laid back. And it’s just nice to see pewds share his insights and interests. ️", "commenter_channel_name": "@Kingbimmy", "likes": 1000, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:38.312020", "replies_count": null, "liked_by_creator": false}, {"comment": "I feel like intellectual Pewdiepie will always be unanimously loved, he’s grown throughout the years and stayed doing this kind of content every once in a while", "commenter_channel_name": "@clairev0yant", "likes": 632, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:38.347412", "replies_count": null, "liked_by_creator": false}, {"comment": "i like when he talks about things like this. it never comes off as \"i know more than you do\". It's just him speaking about his thoughts on a book, a philosophical idea. It's informative and it's something we could all relate to.", "commenter_channel_name": "@emgee222", "likes": 182, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:38.383169", "replies_count": null, "liked_by_creator": false}, {"comment": "Thanks for sharing, I love it when you do \"real talks\", essays, book reviews and stuff.\nYou were a bit all over the place so it was not as comprehensible as it usually is, but I appreciate the video and hope you keep making more like this!", "commenter_channel_name": "@bibbisbibbis", "likes": 5, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:38.415911", "replies_count": 0, "liked_by_creator": false}, {"comment": "I take philosophy classes so I know about the atomists from my class on Ancient Greek philosophy... I feel like it's worth mentioning that this was like a HUGE debate in philosophy even before Socrates showed up... A bunch of sophists (who got paid to teach philosophy rather than just spread it around as they went about their day like Socrates) debated what everything was made up of (trying to figure out what they called 'arche') and you got a wild amount of theories on this, not just atoms... Some believed everything was fire, or water, or earth, or air, or love and strife (I think some poet suggested), or number (as the Pythagoreans believed, they were followers of Pythagoras who worshipped numbers and hated the idea of irrational numbers aka numbers involving decimals... Very interesting...), or there was even Parmenides arguing that everything IS (as in he believed that everything is as it is because nothing changes and time isn't real, I'd suggest you refer to Zeno's Paradoxes to make sense of this position... The answers involve mathematics that the Greeks didn't have...) \n\nYou did have the atomists though who did suggest that everything was made up of tiny things called atoms, HOWEVER, these atomists didn't really know how it worked... They didn't understand sub-atomic particles and stuff... A big objection to them was basically \"If everything is made up of these atoms, then what exists in the space between these atoms?\" and obviously if you just answered \"More atoms\" you'd run into a infinite problem of being asked \"What exists between those atoms?\" So they really didn't have much of an idea of how atoms worked but when it comes to arche they were the closest in finding the correct answer... Still, it can also be interesting to look into Zeno's Paradoxes or also Heraclitus' perspective IMO...\n\nONE THING I WILL SAY THOUGH (haven't watched this video so maybe it'll be covered) which is even more astounding than the atomists' conclusions I think... The Greeks also had a guy who used the pyramids and the Sun to fairly accurately determine that the Earth was spherical and they even approximated its size!!! (They were slightly off, but surprisingly close)... To be able to do that without satellite technology or even the technology to travel around much of the world seems impressive to me... Also I should mention that there were TONS of suggestions for the arche and I'm likely forgetting a few I was taught about...", "commenter_channel_name": "@FaylunaRaRa", "likes": 127, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:51:38.450866", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewds is out here answering the questions we didn’t even ask yet. Respect  ", "commenter_channel_name": "_-S-H-_", "likes": 5000, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:38.485575", "replies_count": null, "liked_by_creator": false}, {"comment": "\"HEY LETS JUST TALK ABOUT STUFF I FEEL PASSIONATE ABOUT\" make this a series pewds ngl these kind of your videos r really getting me into reading amazing stuff that I previously expected to be lame/boring\n\n[Damn thanks for the likes :)]", "commenter_channel_name": "@swapnilmali4320", "likes": 531, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:51:38.520641", "replies_count": null, "liked_by_creator": false}, {"comment": "There’s something so comforting about these videos, I always come away from watching them feeling better somehow.", "commenter_channel_name": "@genaek1415", "likes": 8, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:38.553771", "replies_count": 0, "liked_by_creator": false}, {"comment": "“Death does not concern us, because as long as we exist, death is not here. And when it does come, we no longer exist.” ― Epicurus\n\nI love this quote and how this make so much sense", "commenter_channel_name": "@gazzolapw", "likes": 730, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:51:38.588859", "replies_count": null, "liked_by_creator": false}, {"comment": "This just makes pewds look so good. Some of my friends think he just makes stupid videos then BAM. He hits you with one of these that opens perspectives and gets you thinking.", "commenter_channel_name": "@%EB%B0%B0%EB%A1%9C%EB%9F%AC", "likes": 386, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:38.624121", "replies_count": null, "liked_by_creator": false}, {"comment": "It's incredible how wise he's become. I've watched him since he played amnesia. To watch his transformation in maturing and understanding life more fully has truly been a blessing. If somehow you do read this Felix, I just wanted to say I really look up to you. For how much influence you have on the world around you ,you've stayed extremely grounded. It's been a pleasure being a fan.", "commenter_channel_name": "@Battlefox64_RL", "likes": 188, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:38.659340", "replies_count": null, "liked_by_creator": false}, {"comment": "Me: a greek person currently studying Physics with philosophy at university: ur welcome Felix high fives ancestors", "commenter_channel_name": "@few_disciple", "likes": 503, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:38.694918", "replies_count": null, "liked_by_creator": false}, {"comment": "Imagine having a conversation with Felix. It seems like anyone could have a conversation with him and they’d find something interesting to talk about. Dude is a good role model just in the fact that he’s continuing to try and learn more and more. We should never settle with the knowledge we have, and instead, strive to learn something every day.", "commenter_channel_name": "@KendoExtendo11", "likes": 89, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:38.730055", "replies_count": null, "liked_by_creator": false}, {"comment": "As a person who lives with general anxiety disorder, I really appreciated the quote you shared, as I fear death every minute. It was a great reminder to actively enjoy the things I love, instead of clouding my thoughts with fear of losing. Thanks Pewds, coming in hot with peptalk today! :)", "commenter_channel_name": "@doeburgundy", "likes": 188, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:38.765736", "replies_count": null, "liked_by_creator": false}, {"comment": "“Happiness will never come to those who don’t appreciate what they already have”", "commenter_channel_name": "@mevsgems4362", "likes": 289, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:38.800478", "replies_count": null, "liked_by_creator": false}, {"comment": "Hey Felix I’m not someone to watch or read too much about philosophy, but I absolutely love these vids, past couple years been so busy/painful that I feel like I haven’t really been reflecting enough, these kinds of vids help my get there and take a real second to think I really appreciate that man.", "commenter_channel_name": "@chiptherapy2983", "likes": 5, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:38.834833", "replies_count": 0, "liked_by_creator": false}, {"comment": "Absolutely love that you're not afraid to discuss this here. People need to hear it and become inspired, it's good for the soul.", "commenter_channel_name": "@anon-qo3yg", "likes": 146, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:38.870128", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewds is answering some of the deepest questions in a fascinatingly casual way. Mad respect for that!", "commenter_channel_name": "@00kidney", "likes": 1000, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:38.905086", "replies_count": null, "liked_by_creator": false}, {"comment": "as someone who almost graduated on philosophy and whose life is deeply engage with espiritual (not religious) practices, this comes to me as \"the basics\"... but when I realize that the most popular youtuber is trying to bring a subject like this to his audience (which should be taught not as a science but as a basic human skill) ... I sincerely applaud you and thank you.", "commenter_channel_name": "@Ith.977", "likes": 48, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:38.940260", "replies_count": null, "liked_by_creator": false}, {"comment": "It’s really nice to see these type of videos from Him. Seeing people grow and mature, not to mention find deep philosophy makes me happy.\nPlus ngl the music really fits haha", "commenter_channel_name": "@jakekelly6017", "likes": 5, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:38.972727", "replies_count": 0, "liked_by_creator": false}, {"comment": "I really love how Felix has evolution through this couple of years. There is no other content creator like him in the entire internet, in terms of consciousness, community, communication, etc. Thank you so much for showing us how valuable classic philosophy is, it feels so contemporary because is truly human. Hope we can create new ways of thinking without letting our human essence behind. You just need to make the correct mental connections to really change your way of living. Read, take care and be consciously happy. ", "commenter_channel_name": "@tristanrios1605", "likes": 328, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.008163", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewdiepie has the most subscribers as an individual and is one of the most humble people on the platform. \nThis just shows how great he is", "commenter_channel_name": "@lukedecarlo4239", "likes": 116, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.043150", "replies_count": null, "liked_by_creator": false}, {"comment": "Even explaining such topics requires a lot of skills, huge respect!", "commenter_channel_name": "@ruchirjain1163", "likes": 392, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.078614", "replies_count": null, "liked_by_creator": false}, {"comment": "Damn I feel like I'm getting old, we grew up watching his gaming video's. Now we are enjoying his philosophy.", "commenter_channel_name": "@kcrijk6938", "likes": 22, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.111964", "replies_count": 0, "liked_by_creator": false}, {"comment": "the part where he talked about death made me feel a whole lot better. About a year ago I had smoked a lil too much boof & had some sort of ego death like experience and developed a newfound fear about death and aging. This was a really good video and makes me want to get the book. Thank u pewds for introducing me to something that might help me understand my fear a bit better and have it be less scary :-)", "commenter_channel_name": "@kuromiibot", "likes": 154, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.147850", "replies_count": null, "liked_by_creator": false}, {"comment": "You should do this kind of content more, honestly people would love it and these videos are much more interesting and noble than reddit and react.", "commenter_channel_name": "@pedrofranck6014", "likes": 55, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.183281", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewds really using his fame to educate is really wholesome ngl", "commenter_channel_name": "@birdpixel3406", "likes": 109, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:51:39.219239", "replies_count": null, "liked_by_creator": false}, {"comment": "If you're sad, just don't be sad.\n\ntruly lifechanging advice.", "commenter_channel_name": "@joakimwolff3626", "likes": 3, "date": "2 years ago", "fetched_date": "2025-01-19 14:51:39.252391", "replies_count": 0, "liked_by_creator": false}, {"comment": "This guy really doing a presentation for a book he read for fun much respect", "commenter_channel_name": "@breloom5814", "likes": 206, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.287971", "replies_count": null, "liked_by_creator": false}, {"comment": "I love these kinds of videos. They have the vibe of sitting down and listening to a friend ramble about something they find really interesting. Perfect after a stressful morning of exams.", "commenter_channel_name": "@melanierose5810", "likes": 54, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.322700", "replies_count": null, "liked_by_creator": false}, {"comment": "Hey pewds, long time fan here. For someone who’s struggled with depression for a while this is an interesting viewpoint on happiness :) thanks for sharing and I love ya lots!", "commenter_channel_name": "@BANDIT0_929", "likes": 160, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.357954", "replies_count": null, "liked_by_creator": false}, {"comment": "This guy always makes me want to read books because of how much he gets out of it.", "commenter_channel_name": "@Bakiyochi84420", "likes": 6, "date": "2 years ago", "fetched_date": "2025-01-19 14:51:39.391357", "replies_count": 0, "liked_by_creator": false}, {"comment": "Man I feel such bliss to be able to engage with contents like this every now and then! Thank you Pewds :)", "commenter_channel_name": "@D4rkVexus", "likes": 220, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.426542", "replies_count": null, "liked_by_creator": false}, {"comment": "These videos are actually going to save the world Felix, I know they don't get the views, but I'm so grateful you make these. People need to think about these things, and it's awesome to see you coming to and sharing these concepts with us as we come to and share them as well", "commenter_channel_name": "@robjohnsonmusicandgaming", "likes": 63, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.462087", "replies_count": null, "liked_by_creator": false}, {"comment": "I do love when Felix talks about philosophy. You can tell he's super interested in it, and it really makes for an amazing video compared to videos of Reddit or games where it's in equal parts because he wants to but also we like to see it, and the fact he can just do what he wants from time to time is a great thing.", "commenter_channel_name": "@jblen", "likes": 62, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.496155", "replies_count": null, "liked_by_creator": false}, {"comment": "as a person who has dealt with anxiety too for a long time, I thank you pewds for choosing to share that quote with us!", "commenter_channel_name": "@andradraghici4839", "likes": 5, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.529946", "replies_count": 0, "liked_by_creator": false}, {"comment": "The way pewdiepie talks about how scientific advancements cause pain and take away from our happiness in a way is extremely meta", "commenter_channel_name": "@jcgunther2092", "likes": 106, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.573358", "replies_count": null, "liked_by_creator": false}, {"comment": "Im writing a paper for college about this exact philosophy! This was really fun to listen to with having that prior knowledge. But always love these types of videos :)", "commenter_channel_name": "@sierrahtims8595", "likes": 63, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.609234", "replies_count": null, "liked_by_creator": false}, {"comment": "The sun being a ball of gas is a wonderful thing all its own. I've never understood why people lose their awe of things just because they now have some level of understanding. \nIf anything, understanding it can be even more exciting and awe inspiring. \nI mean, a ball of gas is what allows all the plants, animals, etc to exist on Earth. \n\nJust this one thing is so amazing.", "commenter_channel_name": "@firebreathingmoonbeam3961", "likes": 28, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.642458", "replies_count": 0, "liked_by_creator": false}, {"comment": "Love you Felix, been following for years and years. These videos that you genuinely want to do and talk about, are the absolute best.", "commenter_channel_name": "@J15C", "likes": 2, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.676832", "replies_count": 0, "liked_by_creator": false}, {"comment": "I’ve been struggling lately when thinking about death after not worrying about it for most of my life, this really helped quell that fear, thanks Felix.", "commenter_channel_name": "@RizoftheDead", "likes": 44, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.711611", "replies_count": null, "liked_by_creator": false}, {"comment": "I hope he realizes he is never over explaining or going on too long of a tangent, I love these videos because I love watching people talk about subjects they are passionate about, no matter the topic.", "commenter_channel_name": "@excuseme2770", "likes": 24, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.744898", "replies_count": 0, "liked_by_creator": false}, {"comment": "Deal Felix. I can assure you, that there are many fans who appreciate these kinds of videos. Something I’ve paid notice to, is that you sometimes feel insecure wether we are actual interested or not in what you are saying. Like, you kinda explain a segment really fast, maybe because you feel like we don’t care, or like it’s cheasy idk… I think, as many others, that you should just lean into your thoughts and explanations when doing these videos. Anyway, keep up the good content, much love from me️", "commenter_channel_name": "@lukasmadsen367", "likes": 122, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.780252", "replies_count": null, "liked_by_creator": false}, {"comment": "\"if you're sad, just don't be sad\" god im so glad people get this", "commenter_channel_name": "@SlayyBayy", "likes": 1, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.813363", "replies_count": 0, "liked_by_creator": false}, {"comment": "I love Felix's philosophy vids! I want more!!\n\nAlso with regards to Epicurism I think it's delusional in a sense that it implies we have greater control over our happiness and makes an unrealistic ideal seem attainable. Life is about balance, and we can't control our emotions and not even our cognition the majority of the time. For example, considering PTSD causes involuntary reexperiencing symptoms such as flashbacks, nightmares, etc. Which result in physical pain, adrenaline rush and so on, it is clearly unrealistic to say we can just logically think our way out of fears of uncertainties/difficulties in the future. They are reinforced by past experiences, for some to the point of being disabling.\n\nA better approach would be to unpick and disprove fears individually based on the context in which they appear and why.\n\nAlso think its quite presumptuous to assume that we cease to exist when we die. The body doesn't cease to exist, it changes form, we don't know for sure what happens to the mind as its intangible. Nothing starts and stops it simply changes form, so why would the mind be any different. And also these days we also know that a bunch of hormones are released which seem to cause painlessness, these are better ways to address fear of death. \n\nBut that fear will always be there because we live in uncertainty of what happens, there's evidence but its not deemed universally significant because its subjective. Hence we have a number of religions that have different ideas about the afterlife, its aim is to ease that fear of uncertainty. However when it comes to the concept of heaven, hell and purgatory it reintroduces fear of death in another way.", "commenter_channel_name": "@n0thersist3r", "likes": 56, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:51:39.848848", "replies_count": null, "liked_by_creator": false}, {"comment": "I really feel like this video came about at a fairly crucial time in my life where I actually have been asking myself these very questions and kind of at a loss for how to improve my situation meaningfully, as I'm not religious and didn't follow thru with university. Growing to become a better version of myself has been slow going and painful, especially when caring for another along the way, but somehow, after years of being a fan, you still manage to make subtle impacts upon my life that help push me to do better for myself with your own drive and motivation. Thanks Pewds <3 (400,000 Gang)", "commenter_channel_name": "@Terrorclaw626", "likes": 47, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.883821", "replies_count": null, "liked_by_creator": false}, {"comment": "Sive deserves to get a raise after editing everything in this vid", "commenter_channel_name": "@kiko6969", "likes": 35, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.917992", "replies_count": 0, "liked_by_creator": false}, {"comment": "You sent this out at a perfect time for me. My friend group has last multiple family members suddenly this past week on top of\nOther stress. I’ve learned a lot from this video and I’m sending it to them to hopefully help with healing and understanding. Thank you.", "commenter_channel_name": "@savannahmonroe934", "likes": 2, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:39.951529", "replies_count": 0, "liked_by_creator": false}, {"comment": "Pleasure from sex is intense and fleeting. The more you do it the more it becomes mundane until people do it just to be doing it and not for the purpose of pleasure. Everything in moderation including moderation.", "commenter_channel_name": "@NostalgiaMan", "likes": 260, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:51:39.987043", "replies_count": null, "liked_by_creator": false}, {"comment": "It’s so awesome that you’re talking about philosophy to such a large audience. Mostly younger people, too, the group that really needs it right now.", "commenter_channel_name": "@kurt8263", "likes": 65, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:40.021560", "replies_count": null, "liked_by_creator": false}, {"comment": "I'm glad that I had Felix in my teenage years since 2012-2021 (I'm 19 rn). Watching his contents and growing up with the Feliz and the channel made me realized how much I have grown throughout the years. Having Felix as a role model really is a bless.", "commenter_channel_name": "@minuano2ndtrueancestor865", "likes": 9, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:40.059325", "replies_count": 0, "liked_by_creator": false}, {"comment": "sowcraytays the stoic... inspiring my dude", "commenter_channel_name": "@JohnnyGault", "likes": 2, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:40.092867", "replies_count": 0, "liked_by_creator": false}, {"comment": "How to be happy: dont base it on other people's happiness", "commenter_channel_name": "@unmeaninglessly143", "likes": 43, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:40.128602", "replies_count": null, "liked_by_creator": false}, {"comment": "It feels a lot like harm reduction at a base level. Going into experiences with all the knowledge you need. You’ve got risks, rewards, and mitigation. Thanks for talking with us Pewds.", "commenter_channel_name": "@rebekahchampion5760", "likes": 119, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:40.163903", "replies_count": null, "liked_by_creator": false}, {"comment": "I'm a Greek guy learning about my philosophy from a Swedish guy, so wholesome ️", "commenter_channel_name": "@BrognorLightbringer", "likes": 36, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:40.203685", "replies_count": null, "liked_by_creator": false}, {"comment": "I love when we start off philosophy topics with “the Greeks. Dopest people that ever lived”.", "commenter_channel_name": "@cerenitislays", "likes": 2, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:40.237140", "replies_count": 0, "liked_by_creator": false}, {"comment": "\"If you're sad just ne happy\" actually and literally made me stop being sad. Everyone should do it.", "commenter_channel_name": "@altaccount648", "likes": 17, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:40.270497", "replies_count": 0, "liked_by_creator": false}, {"comment": "Hey Felix, I studied Epicurean theories a lot when I was in university. One possible avenue to explore further is by reading The Picture of Dorian Grey by Oscar Wilde, and Marius the Epicurean by Walter Pater. They both tackle Epicureanism in different ways and I find them both to contain lessons that I live my life by.", "commenter_channel_name": "@sakroxsankt", "likes": 34, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:40.306851", "replies_count": null, "liked_by_creator": false}, {"comment": "As an Italian boy who studied philosophy for 3 years in high school and is currently attending a philosophy faculty at university, I am very proud of these videos (on the contrary to the pizza video that almost killed me).\n If the Epicurean doctrine seemed interesting to you, I recommend reading Lucretius's De Rerum Natura because Epicurus is highly praised there.", "commenter_channel_name": "@PaoloGuagnoni", "likes": 64, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:40.339683", "replies_count": 0, "liked_by_creator": false}, {"comment": "\"Life is long enough if you live it well\" Thats one hits", "commenter_channel_name": "@Brovioli", "likes": 1, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:40.373914", "replies_count": 0, "liked_by_creator": false}, {"comment": "Pewds: “take it with a grain of salt”\nThe comment section: indeed they did not take it with a grain of salt", "commenter_channel_name": "@Sunken_ocean", "likes": 63, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:40.408742", "replies_count": null, "liked_by_creator": false}, {"comment": "As someone with an MA in philosophy, with special interest in eudaimonic ethics, these videos warm my heart.", "commenter_channel_name": "@incollectio", "likes": 31, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:40.444221", "replies_count": null, "liked_by_creator": false}, {"comment": "\"Ancient greeks - the dopest people ever lived\" I can already see that line in history books.\n(also pewds looks like a fucking model wth)", "commenter_channel_name": "@LighthouseSun", "likes": 166, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:51:40.479540", "replies_count": null, "liked_by_creator": false}, {"comment": "I absolutely love these type of videos from pewds. It’s not that I don’t enjoy his other content but these videos are so interesting to me.", "commenter_channel_name": "@eggbert1166", "likes": 1, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:40.513136", "replies_count": 0, "liked_by_creator": false}, {"comment": "Ive watched pewds for years and i love how he evolved its like im growing up with him and sharing new interest if by any chance your reading this, thank you", "commenter_channel_name": "@hahasonie", "likes": 43, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:40.547756", "replies_count": null, "liked_by_creator": false}, {"comment": "This was so insightful,  definitely gonna order the book soon. Everyone has their own healing journey and these kinds of videos help ", "commenter_channel_name": "@emberstaranimation", "likes": 118, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:40.583032", "replies_count": null, "liked_by_creator": false}, {"comment": "0:40 Felix: \"Bro, if you're sad, don't be sad.\"\n\nDepression rate drops to 0%!", "commenter_channel_name": "@fireallegiant1631", "likes": 82, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:40.618338", "replies_count": null, "liked_by_creator": false}, {"comment": "Wow, I just decided to check what Felix was up to, and saw this video. And honestly, I'm not surprised, but I am happy for him. He truly seems to have found the roots of the problems that he had/has, and he's actively trying to solve them, while also taking others with him on the journey. \n\nI remember watching his handfarting video a few years ago, and I could escape in that video for a bit, just light hearted humor. Now he puts out this content, and I love it, and it gives me the same feeling as back then. Even though he might have had some drawbacks, I still respect Felix. For what he did, and for what he is doing now. I hope he continues this book series.", "commenter_channel_name": "@timbroski4487", "likes": 3, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:40.651478", "replies_count": 0, "liked_by_creator": false}, {"comment": "\"Art of Happiness\" isn't that bad of a title. Greeks used \"art\" extensively. An \"art\" for them is like a method, it's a \"how-to\" for everything. In that context, both terms are pretty similar, since you're not investigating happiness, you're just trying to achieve it. By the way, it's very good that you're spreading the message of the great greeks. God bless.", "commenter_channel_name": "@capitantilapia", "likes": 38, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:40.759914", "replies_count": 0, "liked_by_creator": false}, {"comment": "Fun fact :Maharshi Kanada of India discovered the Atom and molecule ( Anu and Parmanu )2500 years before daltons discovery", "commenter_channel_name": "@saarang4895", "likes": 7, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:51:40.792067", "replies_count": 0, "liked_by_creator": false}, {"comment": "I’ve been getting more and more into philosophy especially stoicism…it’s kept me busy and has made me a happier person…I’ve even started reading discourses and selected writing of Epictetus after I watched your video on it…please keep doing these videos…you influence people for the better pewds <3", "commenter_channel_name": "@Leightonm07", "likes": 19, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:40.825832", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewds, It's great to see you diving into philosophy. My studies led me through philosophy and love to see you engage the topics and philosophers. Philosophy is best learned through conversations, hope you have many of them. Refine your positions, understand others and keep growing!", "commenter_channel_name": "@pt78rch3", "likes": 6, "date": "3 years ago", "fetched_date": "2025-01-19 14:51:40.860564", "replies_count": null, "liked_by_creator": false}], "related": []}