{"code": "73XDeGdl94w", "title": "My Workout (10% Muscle increase)", "url": "https://www.youtube.com/watch?v=73XDeGdl94w", "thumbnail_url": "https://i.ytimg.com/vi/73XDeGdl94w/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLBCQks5RLrF953AP74rXxT0YJfEpg", "views": 4000000, "likes": 241000, "duration": 1257, "embed_code": "https://www.youtube.com/embed/73XDeGdl94w", "uploaded_date": "19 Mar 2022", "comments_count": 10046, "comments": [{"comment": "It's super refreshing to see PewDiePie talk about fitness with such passion. One video like this will changes more lives than 100 meme videos", "commenter_channel_name": "@BenEcho", "likes": 8000, "date": "2 years ago", "fetched_date": "2025-01-19 14:33:59.529811", "replies_count": null, "liked_by_creator": true}, {"comment": "I love hearing people talk about their workouts that aren't absolutely massive pro bodybuilders, so much more interesting and relatable", "commenter_channel_name": "@Patterrz", "likes": 23000, "date": "2 years ago", "fetched_date": "2025-01-19 14:33:59.566892", "replies_count": null, "liked_by_creator": false}, {"comment": "This is so much more important that he realises. This will inspire so many “gamer” types who think the gym is not for the them. Working out is absolutely for EVERYONE.", "commenter_channel_name": "@tomchurchill6958", "likes": 3000, "date": "2 years ago", "fetched_date": "2025-01-19 14:33:59.601372", "replies_count": null, "liked_by_creator": false}, {"comment": "It turns out, that chart you drew is actually a fairly accurate representation to a real graph that professionals use to understand how performance fluctuates. As sad and hopeless as this sounds, you will have more \"bad days\" in the gym than \"good days\". However as you slowly build up your peak performance, you will also increase you \"baseline\" fitness. So while you can max out your dumbbell set now, you will eventually get to a point where you can start your work out at that weight. Keep grinding KING!", "commenter_channel_name": "@cliftoncraddock", "likes": 2000, "date": "2 years ago", "fetched_date": "2025-01-19 14:33:59.634338", "replies_count": null, "liked_by_creator": true}, {"comment": "It really feels like pewds is progressively improving every part of his life, according to very high standards he holds for himself. That’s so admirable and respectable bc he’s said he lives comfortably and a lot of people (including myself) would use that as an excuse to become complacent, like he mentioned at the end of the vid. Mans is working out, cutting bad habits, reading and meditating, eating well AND being content with his life. Absolutely excellent, thank you for what you do Pewds!!", "commenter_channel_name": "@hxnbe", "likes": 5000, "date": "2 years ago", "fetched_date": "2025-01-19 14:33:59.668004", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewd's workout summary:\nMonday:\nDumbbell bench (doesn't mention rep scheme)\nIncline Dumbbell bench (doesn't mention rep scheme)\nLess Incline Dumbbell bench (doesn't mention rep scheme)\nShoulder press (doesn't mention rep scheme)\nSuperset: Triceps Kickbacks, Lateral raises x2\n8 min abs\n\nTuesday:\nDumbbell squat x4\nDumbbell deadlift x4\nDumbbell lunges x3\nDumbbell calf raises (doesn't mention rep scheme)\n\nThursday:\nDumbbell row single arm (doesn't mention rep scheme)\nDumbbell two arm rows (doesn't mention rep scheme)\nDumbbell overhead triceps extension (doesn't mention rep scheme)\nDumbbell two arm reverse-grip rows (doesn't mention rep scheme)\nDumbbell biceps curls (doesn't mention rep scheme)\nDumbbell hammer curls (doesn't mention rep scheme)\n\nFriday: \nKendo/Jump rope \nwhatever pewdswants\n\nSaturday:\nChest\nShoulder \nBiceps\n\nIf you have no equipment here are some bodyweight exercises:\n\nChest/triceps: Push ups, Dips\nUpper back: Chin/pull ups, inverted rows, lalanne pushups (really hard)\nBiceps: Chin/pull ups, inverted rows,\nAbs:  Planks, side plank, ab wheel, lalanne plank (really hard), crunches, sit ups, leg raises \nLower back: Deadlift, single leg deadlift, glute bridge, single leg glute bridge\nHamstrings: Nordic curl, deadlift, single leg deadlift,\nQuads: Squats, Lunges, Bulgarian Split squats, reverse nordic curls\nCalves: Calf raises\n\nRep schemes:\nFor big muscles (chest, glutes, quads) I'm a big fan of UFpwrLifter's rep scheme, which is the the following 10 sets with weight % of 1 rep maximum weight:\n33% x 10 (warm up)\n56% x 10 (warm up)\n79% x 5\n86% x 3\n91% x 1\n96% x 1\n91% x 1\n91% x 1\n86% x 3\n79% x 5\n\n if I don't have the equipment to do the above rep scheme, I just round the weight down and increase the reps. For other muscles I just do 3 sets of 10 reps. \n\nFor any routine I'd recommend a minimum of one exercise per main muscle group, but one exercise can hit more than one. For example, push ups, chin ups, deadlift, ab wheel, squats, and calf raises, is hitting pretty much every muscle.", "commenter_channel_name": "@ihave3heads", "likes": 1000, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:33:59.700919", "replies_count": null, "liked_by_creator": false}, {"comment": "\"Never discourage anyone who is making progress, no matter how slow\" \n- Plato", "commenter_channel_name": "@writingweasel6518", "likes": 2000, "date": "2 years ago", "fetched_date": "2025-01-19 14:33:59.734336", "replies_count": null, "liked_by_creator": false}, {"comment": "Hey brother, I know you may never read this but seeing you, someone that I watched as a kid, doing this really really hit me different. I’ve been insecure about being skinny since I’ve been alive. Just to see you lift gave me a big inspiration out of nowhere. I’ve been going to the gym a lot about 2 months now and it’s been great. Now that I know you too share this insecurity in a way I just wanna thank you so much. Much love Felix", "commenter_channel_name": "@ezrasalazar6995", "likes": 178, "date": "2 years ago", "fetched_date": "2025-01-19 14:33:59.767099", "replies_count": null, "liked_by_creator": false}, {"comment": "\"Adjustable dumbbells are all you really need for a cost-efficient, well-rounded workout.\"\n- Plato", "commenter_channel_name": "@jmedlin81", "likes": 5000, "date": "2 years ago", "fetched_date": "2025-01-19 14:33:59.802583", "replies_count": null, "liked_by_creator": true}, {"comment": "Seriously look up to how humble and honest you are, Felix. You’ve made amazing progress and we’re all so proud of you for overcoming your addictions. Happy to see you’ve found a healthy outlet for your stress, you’re doing great <3 We really look up to you, man.", "commenter_channel_name": "@vermouth6823", "likes": 2000, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:33:59.837918", "replies_count": null, "liked_by_creator": false}, {"comment": "Looking way more muscular man. Keep it going. Awesome progress.", "commenter_channel_name": "@StarWarsTheory", "likes": 4000, "date": "2 years ago", "fetched_date": "2025-01-19 14:33:59.872936", "replies_count": null, "liked_by_creator": false}, {"comment": "This is probably the 3rd or 4th time I've come back to this video now. I come back every once in a while when I begin to lose motivation not just with working out but life in general. I think he puts it in one of the best ways possible for anyone to understand regardless of what you're doing in life \"It's always better doing something then nothing.\"", "commenter_channel_name": "@poji4015", "likes": 62, "date": "2 years ago", "fetched_date": "2025-01-19 14:33:59.905192", "replies_count": 0, "liked_by_creator": false}, {"comment": "I have been working for 5 years now and honestly after covid happens I haven't been really pushing myself. I still do my workout consistently 3 to 4 times a week but it is really for the sake of it. Half ass work out shit. I don't watch training video anymore coz I just lost the motivation to push myself to my goal. Pewds you probably won't see this but you have really motivated me back to push myself once again. Hopefully I can do that!", "commenter_channel_name": "@lester_seow", "likes": 2000, "date": "2 years ago", "fetched_date": "2025-01-19 14:33:59.940845", "replies_count": null, "liked_by_creator": true}, {"comment": "you’re a great role model nowadays man i really mean that. watching you grow up has been one of the few joys of my life, you’ve had most of your coming of age anime arcs and doing that on a stage can’t be easy. im glad you picked yang(white one) and not yin  for how you reacted to negativity and struggle. between the philosophy, fitness, and book review videos, i believe you’re definitely making a difference in the youths sense of wisdom. it helps people get into healthy habits instead of toxic ones. people who don’t have a good role model like myself can stumble upon one of your deeper videos in our sub box and make a step in the right direction the next day from the inspiration. you’ve come a long way, thanks for spreading the wisdom some people wouldn’t have gotten otherwise. we go through hardships to help other people not make the same mistakes we have made, and you’re helping people by the millions. good shit", "commenter_channel_name": "@McCartneyLS", "likes": 440, "date": "2 years ago", "fetched_date": "2025-01-19 14:33:59.976099", "replies_count": null, "liked_by_creator": false}, {"comment": "I’m so happy that someone as influential as Felix is sober, and open about his sobriety.", "commenter_channel_name": "@elisa.alexander", "likes": 389, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:00.011098", "replies_count": null, "liked_by_creator": false}, {"comment": "I wish you could do one of these every 3 months or 6 months it'd be really awesome to keep hearing your thoughts they're always deeper and helps us connect with exercising much better than other usual bodybuilders", "commenter_channel_name": "@user-cz9tw1fh5x", "likes": 72, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:34:00.050383", "replies_count": 0, "liked_by_creator": false}, {"comment": "Love how Pewd's is encouraging weight lifting, nutrition, physical and mental health on his platform. Very inspiring, motivating!", "commenter_channel_name": "@EricDemamp", "likes": 368, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:00.084002", "replies_count": null, "liked_by_creator": false}, {"comment": "Amazing transformation! Curious if you also use body weight exercises like pull ups & push ups?", "commenter_channel_name": "@CHRISHERIA", "likes": 4000, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:00.117718", "replies_count": null, "liked_by_creator": true}, {"comment": "Dont ever feel cringe for showing us this Pewds! Nerds like us need to be reminded of this! I went and worked out after seeing it. My goal is Pewdi-bod.", "commenter_channel_name": "@JackSather", "likes": 2000, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:00.148916", "replies_count": null, "liked_by_creator": false}, {"comment": "Came back to watch this video after I started consistently working out and I must say I can understand what Felix is saying so much better! Although I agree that consistency is super important, I think what motivates me is improvement", "commenter_channel_name": "@fnk234", "likes": 290, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:34:00.180385", "replies_count": 0, "liked_by_creator": false}, {"comment": "I fell off with my gym stuff at the start of the year so gonna use this as some motivation to get back into it", "commenter_channel_name": "@ChippyGaming", "likes": 915, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:00.213291", "replies_count": null, "liked_by_creator": false}, {"comment": "Your arms are going too much to the side on the chest and shoulder presses, this may lead to shoulder impingement later.\nYou need to keep your elbows closer to your torso (around 45 degrees) to be safer and have a more stable strength output.\nHope this helps.", "commenter_channel_name": "@jaafaralawieh", "likes": 248, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:00.246385", "replies_count": null, "liked_by_creator": true}, {"comment": "growing up with felix i see him as a big brother and i look up to him. in these types of vids he’s so genuine and inspiring. he really does express his passion about healthier living. i also appreciate how he’s transparent and talks to us like individuals - like we’re sitting together and having a conversation together. it’s a weird but wonderful feeling", "commenter_channel_name": "@lanawinters1964", "likes": 266, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:00.279490", "replies_count": null, "liked_by_creator": false}, {"comment": "It’s funny that Pewds has the money and influence to make a legit at home state of the art gym, but chooses to stick to the simple bench and adjustable dumbbell", "commenter_channel_name": "@samsungsmiley1", "likes": 465, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:00.312171", "replies_count": null, "liked_by_creator": false}, {"comment": "Man this video is great... Celebrities can feel a little out of reach at times, but this video shows we're all the same deep down. Love you Felix!!", "commenter_channel_name": "@peppyhydra4544", "likes": 722, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:34:00.345618", "replies_count": null, "liked_by_creator": false}, {"comment": "You know, I like Felix… He doesn’t flaunt money he doesn’t spend it on dumb things and act like he’s better than everyone. He’s a genuine guy and deserves everything he’s gotten.", "commenter_channel_name": "@ImGirlyDemon", "likes": 1000, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:00.378381", "replies_count": null, "liked_by_creator": false}, {"comment": "What really inspires me is that even though he is \"rich\" he's being so noble. And even going to a welder to fix his equipment. Thanks for being the person you are", "commenter_channel_name": "@gamenmettallys", "likes": 651, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:00.411509", "replies_count": null, "liked_by_creator": false}, {"comment": "These are honestly some of my favorite vids from the channel, do a fitness update soon!", "commenter_channel_name": "@Gringoviej0", "likes": 59, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:00.442572", "replies_count": 0, "liked_by_creator": false}, {"comment": "\"The point is that you're doing it, not that you haven't reached your goal yet\" Thanks pewds, this is going in my journal and I'm off to the gym now. :)", "commenter_channel_name": "@erin2150", "likes": 301, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:00.476085", "replies_count": null, "liked_by_creator": false}, {"comment": "I've been training for 11 years now and I'm now turning 30 this year. My tip for beginners will always be consistency. This applies to everything in life I guess.", "commenter_channel_name": "@jamespasco132", "likes": 545, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:00.508906", "replies_count": null, "liked_by_creator": false}, {"comment": "been working out consistently for a month now. i watch this vid prolly 3 times a week for inspiration. thank ya pewds.", "commenter_channel_name": "@kowalski3389", "likes": 75, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:00.542615", "replies_count": null, "liked_by_creator": false}, {"comment": "Progressive Overload, Pewds! Your workout routine looks great, I'd encourage to focus on form over weight. As well as bringing your arms down to a 45 angle instead of 90 when doing bench/shoulder press, this will reduce stress on your shoulder joint and will protect you in the long run when you continue to add weight. Really loving the content!", "commenter_channel_name": "@rockyrodriguez2068", "likes": 636, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:00.575456", "replies_count": null, "liked_by_creator": true}, {"comment": "I feel so dumb because I obviously don't know this man personally and will never meet him, but seeing his progress genuinely makes me excited for him in the same way I felt excited for my friends who made great progress with their workouts. Good job Pewds, super happy for you, looking great!", "commenter_channel_name": "@ursaursae9848", "likes": 486, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:00.608665", "replies_count": null, "liked_by_creator": false}, {"comment": "Here are my 2 cents on exercising - \"Something is better than nothing\". Meaning, sometimes we get so tied up in choosing a right gym, a right partner, a right trainer, right clothes, right diet, right music, right equipment, right time, that we don't do anything. My advice would be to just start with anything which is better than your current state. Meaning if you are on bed or chair all day, start by walking in your house in breaks. Walk for 10 mins in your lawn or just do 5 pushups; do anything. The point that is if you do this, eventually, may be in a few weeks or few months you will get into a full routine workout. But that idea should not stop you from doing something over nothing, NOW!", "commenter_channel_name": "@sunilbisht", "likes": 807, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:34:00.641520", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewdiepies first video is what got me into working out a year and a half ago and now I’m the best I’ve ever been, benching 225 for reps and squatting 315", "commenter_channel_name": "@overcookedmac7887", "likes": 9, "date": "1 year ago", "fetched_date": "2025-01-19 14:34:00.674054", "replies_count": null, "liked_by_creator": false}, {"comment": "I love that someone as prosperous as pewds doesn’t flex a $150k personal gym with full dumbbells squat tracks machines trainers etc, man keeps it simple and is way below his ego. Respect ", "commenter_channel_name": "@jacksondunphey2620", "likes": 1000, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:00.707574", "replies_count": null, "liked_by_creator": false}, {"comment": "I appreciate how he says things he struggles with such as, wasting time, spending too long on the phone, not wanting to do a workout, and how its ok to change your schedule \nas many times as you need to. Really cool.", "commenter_channel_name": "@jmoney1356", "likes": 310, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:00.738592", "replies_count": 0, "liked_by_creator": false}, {"comment": "The “leg thing” is something to focus on. It’ll make the setup for your dumbbell presses much easier and safer", "commenter_channel_name": "@dont5405", "likes": 168, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:00.839205", "replies_count": null, "liked_by_creator": false}, {"comment": "Knowing that he works out just to be feel good and improve himself overall is so nice to hear. I have specific powerlifting and bodybuilding goals in mind when I work out, but even if you don't have a specific purpose for working out, it's a great thing to get into. You're doing something good for your body, and you should feel good that you're accomplishing something.", "commenter_channel_name": "@juliansedor7101", "likes": 9, "date": "1 year ago", "fetched_date": "2025-01-19 14:34:00.870575", "replies_count": 0, "liked_by_creator": false}, {"comment": "I'm impressed how Pewds motivates you so much in such a philosophical way like he does at the end. Other YouTubers scream stuff like \"for the gains, for the looks\" at you but Pewds knows how to thoroughly change one's whole mindset so that you actually want to work out and not just work out because you're told to", "commenter_channel_name": "@paulg5507", "likes": 108, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:00.901803", "replies_count": 0, "liked_by_creator": false}, {"comment": "Definitely know what you mean regarding  self pity, when you aren't feeling like working out. To not want to push yourself when motivation is lacking. Those days are the hardest to keep going. \n\nBut pushing yourself on those days is what makes the whole journey feel so special and worth it for physical and personal growth.", "commenter_channel_name": "@cartertaylor2297", "likes": 533, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:00.934744", "replies_count": null, "liked_by_creator": true}, {"comment": "As someone recovering from an eating disorder and toxic workout habits, this is honestly really inspiring to hear. I don’t really workout anymore because for a long time I wasn’t doing it for the right reasons and caused me to actually be more unhealthy than healthy, but I have considered getting back into since I am in a different mindset now than I was when I was sick. This video really helped validate my new mindset and helped me know this is the right way to do it. So thanks Felix ", "commenter_channel_name": "@nicolebray6110", "likes": 616, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:00.967885", "replies_count": null, "liked_by_creator": false}, {"comment": "Zyzz is proud! Honestly, Pewdiepie is doing a splendid job using his platform to spread positivity. I am riding the wave and I hope many follow as well. We are all gonna make it brahs!", "commenter_channel_name": "@mesmory", "likes": 998, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:34:01.001461", "replies_count": null, "liked_by_creator": false}, {"comment": "this is so impressive. feel lucky to have watched this dude mature and grow in every way possible over the years.", "commenter_channel_name": "@annabelle1108", "likes": 82, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.033426", "replies_count": 0, "liked_by_creator": false}, {"comment": "0:47 I always knew Edgar was a gym bro.", "commenter_channel_name": "@OmniPieTV", "likes": 259, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.068968", "replies_count": null, "liked_by_creator": false}, {"comment": "Started watching you in 2011, stopped like 3 years ago and just came to see what you’ve been up to. Really good video, happy to see you take on this road to self improvement!", "commenter_channel_name": "@ezioauditore7789", "likes": 261, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.101823", "replies_count": null, "liked_by_creator": false}, {"comment": "I’ve finally started to achieve consistency and it’s not with weight training or cardio but yoga! My body goals are about strength and flexibility and improved mobility and that’s actually helped me maintain a fun and fulfilling consistent workout without it being just focused on my looks, and that took me a while to achieve that mindset, esp as a woman with the toxic beauty trends and ideals put on us. Thanks pews for your update, it continues to motivate me to push myself", "commenter_channel_name": "@tdog3753", "likes": 8, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.133606", "replies_count": 0, "liked_by_creator": false}, {"comment": "As someone who lifts everyday, i can tell you that personally im of the group that  says \"i want more, i want to be bigger\" every single day. But im totally capable of being satisfied after almost every workout, and im truly proud every time i look in the mirror. I guess what you can take from that is basically, strive to be better everyday, yet learn to enjoy every achievement and the process of it.", "commenter_channel_name": "@gromswowguide7927", "likes": 426, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.166606", "replies_count": null, "liked_by_creator": false}, {"comment": "Was literally going to start seriously working out and being consistent with it tomorrow (fooled around with it before today but want to take it more seriously from now on) and I was already excited before watching this video but this changed my mindset on a lot of things and made me even more excited. I remember watching the first video and starting and quitting because I didn't see results but now I realize that shouldn't matter. Consistency and pushing yourself mentally and physically is what really matters. Also love the philosophy talk, that's another thing I've been reading up on too and really like. Especially The Socrates quote and the \"you'll never regret working out but you will regret skipping it\" quote I saw a bit ago that you kinda reiterated with different words here. (This is basically a note for me to look back on one day when I rewatch this video which will definitely happen I can tell)", "commenter_channel_name": "@xeonbladev18", "likes": 360, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.199788", "replies_count": null, "liked_by_creator": false}, {"comment": "I really liked the video!\nBut I was always thinking how uncomfortable those weights look. I know the individuals take more space, but would probably be easier for you to grip and help with the good posture.", "commenter_channel_name": "@new3sc", "likes": 636, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.232626", "replies_count": null, "liked_by_creator": false}, {"comment": "I'm starting to get into self-improvement, working out and taking care of my overall wellbeing. Was looking for this video that you published specifically, really wanted to get into the right workout mindset and thought that yours was what I wanted to emulate at most. Thanks pewds", "commenter_channel_name": "@snormax5795", "likes": 13, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.265892", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewdiepies way to express his thoughts and how open minded he is is actually the reason why i like him so much", "commenter_channel_name": "@dankful8699", "likes": 292, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.298865", "replies_count": null, "liked_by_creator": false}, {"comment": "It's so nice to hear that pewds has replaced drinking and nicotine with something that still feels good but is also good for him. Like, I don't know him personally, but it actually makes me emotional to know that he's got something he enjoys that much with out that something being detrimental.", "commenter_channel_name": "@Ssaphine", "likes": 391, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.331741", "replies_count": null, "liked_by_creator": false}, {"comment": "Idk why I love this so much, I've also always been a skinny guy and have been working out and trying to bulk up for the past year. Love hearing Felix talk about his experience and knowing that a lot of us are in this together, I hope he knows how appreciative we are. Keep pushing yourselves! The hardest part is getting started", "commenter_channel_name": "@SuperFlyBallerz", "likes": 69, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.365094", "replies_count": null, "liked_by_creator": false}, {"comment": "I feel like Pewdiepie has been someone that his viewers and fans have grown with, as well as himself. Going from fun scary games he's playing in the earlier days to slowly growing and changing, like many of us who started watching when we were teens or preteens and I think that it is a great feeling and example that a youtuber, is showing us healthy habits and world viewpoints for us to look up to. I am glad that he continues to have a positive influence to millions and millions of his fans that have been growing with him.", "commenter_channel_name": "@wesleymyers4160", "likes": 12, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.396172", "replies_count": 0, "liked_by_creator": false}, {"comment": "Gotta say, I freaking loved hearing you talk about all of this and what you’re passionate about. I can honestly say that I’ve seen a real growth in you Felix, you should be very proud. Thank you for all you do.", "commenter_channel_name": "@paradx215", "likes": 67, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.427722", "replies_count": 0, "liked_by_creator": false}, {"comment": "i've been using your playlists a lot lately and tbf they're great for workouts", "commenter_channel_name": "@odenjoclo", "likes": 122, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.460563", "replies_count": null, "liked_by_creator": true}, {"comment": "I feel like I know what you mean about trying to avoid excuses. I heard about the ' something is better than nothing '  approach, and that's been very helpful to me personally. To work out or stretch for even just 5 minutes is better than nothing, and it feels great to build confidence in your ability to remain consistent by doing even just a tiny bit whenever you can fit it in your day. And when the depression kicks in really hard, I resort to telling myself that I deserve the outcome I want, and doing even one minute of whatever it is that my body is screaming that I can't do is the very self care that I need to achieve it. Something, anything, even just rolling over until I fall out of bed. I just need to keep moving and at least make a physical attempt to try. I haven't missed a day of yoga in almost a year, and these simple little things are why. I wanted less joint pain, and it's amazing to feel my efforts paying off. Thanks for posting this, and I hope these tips can help someone else as much as they've helped me", "commenter_channel_name": "@catwesk", "likes": 55, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.493823", "replies_count": null, "liked_by_creator": false}, {"comment": "The fact that pewds works out with a walmart bench and a couple powerblocks is the most endearing thing I have ever seen. It is also the first time in my life I have ever felt wealthy, knowing I have a better home gym than a multi-millionaire. Also, shockingly good advice all-around. He seems to have learned a lot of lessons that take most people, myself included, many years to learn. Like the importance of a healthy mindset and focusing on consistency/enjoyment rather than results.", "commenter_channel_name": "@nerdstrangler4804", "likes": 7, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.524879", "replies_count": 0, "liked_by_creator": false}, {"comment": "As a gym rat and someone super into fitness, I just wanna say thank you so much for showing people they can do it at home. Anyone can start! Thank you for inspiring", "commenter_channel_name": "@Heyyylovlies", "likes": 41, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.556276", "replies_count": 0, "liked_by_creator": false}, {"comment": "this got emotional for me. Ive always had issues with my body (like a lot of people) and it's always hard getting started and my biggest struggle is consistency. And after years of starting and starting and not really being consistent, I've learned its easier to be kinder to yourself rather than punishing yourself for \"failing\" (big surprise huh). And this vid and what felix said,,,, well it just feels hella nice to hear what he said. The effort is the endgoal , bros.", "commenter_channel_name": "@mibs_doll8188", "likes": 233, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.589280", "replies_count": null, "liked_by_creator": false}, {"comment": "Day 1 \nBench press\nIncline bench press\nShoulder press \nSuperset - Tricep kickbacks \nLateral raises \n\nDay 2 \nLegs \nSquat \nDeadlift \nLunges \nCalf raises \n\nDay 3\nRest \n\nDay 4\nPulls \nSingle arm rows \nDouble arm rows \nOverhead extension \nDouble arm rows with reverse grips \nBicep curls \nHammer curls\n\nDay 5\nCardio \nKendo / jump rope \nWhat ever the heck you want for 40 minutes\n\nDay 6\nFull body \nAll the upper body exercises", "commenter_channel_name": "@ShadoWolf43", "likes": 2000, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.622533", "replies_count": null, "liked_by_creator": false}, {"comment": "The graph you made with the intensity of your work outs really made me feel a lot better. I feel like I’m following that same loop and have started taking my work outs more seriously. I’ve been beating myself up about not really having made any progress the last several months but this has really inspired me to just get to work", "commenter_channel_name": "@rosie20098", "likes": 19, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.653743", "replies_count": 0, "liked_by_creator": false}, {"comment": "You are inspirational Felix, thank you for making stuff like this part of your content, you are a great example for the youth(im not a boomer, we are almost the same age, I'm 33). Anyways..im a morbidly obese person, ive been going to the gym last couple months, gave up soda and trying to eat better/less, with having insulin resistance, its hard(sugar addiction is real, its a legit addiction and just as hard to  moderate sweets/carbs and/or saying no) but its getting easier every week, this has been a good week...the first month of giving up soda, without really trying to eat better i lost 14 pounds..adding working out and eating better, so far loss 16 pounds in 2 months...as someone with PCOS with insulin resistance, 16 pounds in 2 months is ALOT! So Im very proud of that and with even more changes I'll lose more easier and quicker. Anyways..seeing people I enjoy watching/listening to talking about their changes and giving pep talks and being real, makes me more motivated, thanks for being real!", "commenter_channel_name": "@totesmegoatscrystal9688", "likes": 133, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:34:01.687970", "replies_count": null, "liked_by_creator": false}, {"comment": "This was honestly more motivating than any workout video I've ever seen. They're always like \"you just need to get into it and do this this and this every single day\" but I think something i personally struggle with is starting and staying consistent. And maybe ill do it one day, but the next day ill be too discouraged to do that same level of workout so I don't do it at all. But I think if I started viewing it as  do something, even the minimum, rather than the end goal and achieving the most, then I will be more encouraged to do more. And over time I can build up the motivation and resolve to challenge myself and do more as well. Consistency is key, no matter how small it is. And I think thats the most important thing to keep in mind", "commenter_channel_name": "@iamakumquat", "likes": 93, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.721397", "replies_count": null, "liked_by_creator": false}, {"comment": "Hi Pewds, this video is genuinely one of the best videos I've seen on youtube. You don't talk about just another workout routine but your mindset and goals, the type of ambition one should have to live their life. Seeing this video has really motivated me I relate to so many things you've said about risks and breaking through your current limit. Many people work hard to reach the end goal and just stagnate. I thought I was going in the same direction, but now I realize I like the consistency and feel after I learn something or workout. I realized that I am the type of person to continuously keep giving myself challenges and seek discomfort. \n\nKeep putting out content Felix - It's amazing to see your journey, your thoughts, and your jokes :)", "commenter_channel_name": "@harshitpandey638", "likes": 147, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.754549", "replies_count": null, "liked_by_creator": false}, {"comment": "His hate for leg day is so relatable", "commenter_channel_name": "@AyushPant", "likes": 35, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.786459", "replies_count": 0, "liked_by_creator": false}, {"comment": "This is actually very helpful for the younger generations who are having a really hard time finding the right moment to see a change in terms of physicality and mentality... It is good sometimes to hear something coming from those who have just started or have been doing some of the things lately, because it keeps everything grounded which shows the reality and the expected outcomes that most people could and would probably get if proper mindset is arranged.", "commenter_channel_name": "@Fr0stizee", "likes": 91, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.819762", "replies_count": null, "liked_by_creator": false}, {"comment": "I aspire to be like pewds. My guy works out, reads books, meditates, plays video games, philosophizes, improves himself constantly, and overall lives a completely balanced life with loving friends and family. Pewds is literally living a complete life.", "commenter_channel_name": "@yungje0n", "likes": 130, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.853803", "replies_count": null, "liked_by_creator": false}, {"comment": "He's right about the music, Madonna pulls me through at the end of my workouts haha", "commenter_channel_name": "@MrJagsterS", "likes": 569, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.887199", "replies_count": null, "liked_by_creator": false}, {"comment": "It's so admirable that you promote healthy lifestyle with your huge audience, so many people look up to you (including myself). Thank you Pewds, really.\nAlso, the part about working out alone at home and kinda dragging the moment when you start is so true", "commenter_channel_name": "@kennylux", "likes": 13, "date": "1 year ago", "fetched_date": "2025-01-19 14:34:01.919270", "replies_count": 0, "liked_by_creator": false}, {"comment": "You know it’s really refreshing to hear such a healthy take on why consistent exercise is good for you, the challenge aspect of it is far more important than the end physical results. I think it’s easy to fall into a really negative mindset about working out where you feel bad about yourself, but this kind of thinking is really positive and sustainable. I feel like I learned something ", "commenter_channel_name": "@ashleighpoe7744", "likes": 95, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.952616", "replies_count": null, "liked_by_creator": false}, {"comment": "Watching this video is really encouraging. I just started going to the gym again. I’ve been consistent for about to weeks still trying to find out how long to workout and workouts to add. I usually shoot for 3 days a week and 1 hour heavy workouts. Push, Pull, and Leg days. Anytime I workout I feel at ease and focused. I’m also looking to change up my diet. Enjoyed this vid, Pewds!", "commenter_channel_name": "@sacredviper3556", "likes": 122, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:01.986282", "replies_count": null, "liked_by_creator": false}, {"comment": "I like how unglamorous this is, real progress is just straight up a struggle and will be the whole way there", "commenter_channel_name": "@IndieFic", "likes": 44, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:02.017798", "replies_count": 0, "liked_by_creator": false}, {"comment": "I'm proud to see that you're staying consistent with your workouts and making progress. Keep it up king.", "commenter_channel_name": "@gigachad6022", "likes": 34, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:02.049839", "replies_count": 0, "liked_by_creator": false}, {"comment": "It just feels great to see someone who is outside of the fitness industry and still does most things right. Specially lifting the weights using legs is actually how it should be done. Just don't drop them like that because there is a higher chance of injury in that way. Just do the leg thing in reverse order to get the weights down safely and to save yourself from injury. Overall,  it's just great to see someone being consistent with his workout. Keep it up. :D", "commenter_channel_name": "@strangekey9121", "likes": 122, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:02.082964", "replies_count": null, "liked_by_creator": false}, {"comment": "9:48 BFG Division is mandatory on every workout playlist", "commenter_channel_name": "@mel-ju7kp", "likes": 37, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:02.116106", "replies_count": null, "liked_by_creator": true}, {"comment": "Honestly, IMO one of the best things ever, and most certainly the best part of a workout is just... dropping. I used to have separate day for every areas of my body, but I stopped doing that after a while and just did mixed training every day. Its amazing. The feeling when I'm done with my workout and just drop on my mat and can't do anything anything anymore to the point of struggling to get up for a good 10 minutes. This hits especially hard after showering and just falling to bed. Never have I ever been more relaxed.", "commenter_channel_name": "@TheJanstyler", "likes": 8, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:02.148407", "replies_count": 0, "liked_by_creator": false}, {"comment": "This is very inspirational, especially to someone like me who has been having a hard time getting back into consistent workouts. Thank you for sharing your experience and giving advice to others.", "commenter_channel_name": "@maxchocolate6688", "likes": 81, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:02.181601", "replies_count": null, "liked_by_creator": false}, {"comment": "I’ve been exercising consistently for almost 100 days and I’ve been really hard on myself because I keep comparing myself to other but I really needed to hear this! Thank you Felix!", "commenter_channel_name": "@unknownanimonsta2699", "likes": 116, "date": "2 years ago", "fetched_date": "2025-01-19 14:34:02.215422", "replies_count": null, "liked_by_creator": false}], "related": []}