{"code": "aIqAHYuFdSw", "title": "Why am I still here.. (Japan Update)", "url": "https://www.youtube.com/watch?v=aIqAHYuFdSw", "thumbnail_url": "https://i.ytimg.com/vi/aIqAHYuFdSw/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLC5Mxx3-zqwMsZCq0iZgQwMwLnO0w", "views": 4000000, "likes": 339000, "duration": 403, "embed_code": "https://www.youtube.com/embed/aIqAHYuFdSw", "uploaded_date": "29 Dec 2021", "comments_count": 13184, "comments": [{"comment": "The whole situation seems super frustrating, I really hope things start changing soon", "commenter_channel_name": "@ChippyGaming", "likes": 27000, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:44.783133", "replies_count": null, "liked_by_creator": true}, {"comment": "I am in precisely the same situation as you, and it is extremely frustrating. Was meant to have moved two years ago, right around the start of the pandemic. Really hope it opens back up soon…", "commenter_channel_name": "@MerryweatherMedia", "likes": 2000, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:44.819802", "replies_count": null, "liked_by_creator": false}, {"comment": "It’s nice to finally here someone talk about it that understands the feelings. I’ve been trying to move there for more than a year as a student and have already paid my tuition and taken 4hr long intensive classes everyday after working full time to learn the language before I go. I’ve had to give up a really good job, sell my car, and a multitude of people asking “I thought you were moving to Japan?” And scariest part is giving up on Japan after all of this and then have it open up after I give up, the constant juggle of decisions in this limbo is beyond stressful", "commenter_channel_name": "@Thefenceloverandgroper", "likes": 2000, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:44.860357", "replies_count": null, "liked_by_creator": false}, {"comment": "I feel your pain Felix, I was going to move there in 2011... Fukushima happened... I was going to try in again in 2020.... Covid happened... it is almost like a sick game the universe plays.", "commenter_channel_name": "@Reformatt", "likes": 4000, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:44.896322", "replies_count": null, "liked_by_creator": false}, {"comment": "I'm so proud that he never stopped being humble. Seriously.", "commenter_channel_name": "@ssychostella", "likes": 4000, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:44.932309", "replies_count": null, "liked_by_creator": false}, {"comment": "Mate I can't begin to imagine how frustrating this must have been. \nBeing in Japan has always felt like being in a bubble, but never more so than the last two years. The sad truth is because the foreign population makes up just 2% of the population, the ruthless border controls don't really impact the vast majority of people living here and so the government is able to make decisions and not really factor the foreign population into it (like when they banned even foreign residents of Japan from being able to travel here in 2020). I'm often asked for predictions on when it'll re-open to folks with visas such as yourself, but unfortunately I suspect the new variant has really pushed it down the road by another 3 - 5 months at this point.", "commenter_channel_name": "@AbroadinJapan", "likes": 7000, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:44.967721", "replies_count": null, "liked_by_creator": true}, {"comment": "Japan has to be one of the hardest countries to move to, nevermind in the middle of a pandemic. It must be insanely stressful, hopefully things clear up soon", "commenter_channel_name": "@Patterrz", "likes": 10000, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:45.003559", "replies_count": null, "liked_by_creator": false}, {"comment": "I love how self aware he is, I dont like using the word humble because it just sounds cringe but felix has not let fame and money cloud his personality and ethics. The fact that he even feels guilty about explaining his home situation shows how socially conscious he is despite his success.", "commenter_channel_name": "@evantr0o658", "likes": 2000, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:44:45.038488", "replies_count": null, "liked_by_creator": false}, {"comment": "Balancing “giving up” and “keep on going” is so difficult, you’re not alone there", "commenter_channel_name": "@thehoopala", "likes": 507, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:45.073731", "replies_count": null, "liked_by_creator": false}, {"comment": "Regardless of the situation,  we are all still very proud of you and love you, Felix. Although it may seem like a tough time, especially now, we have no doubt you'll get through this and finally move to Japan. In the meantime, continue to live your life to the fullest and make every moment a memorable one. This goes to all of you reading this as well. Stay safe everyone. And we're always with you, Pewd's <3", "commenter_channel_name": "@UnrealEntGaming", "likes": 14000, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:45.109221", "replies_count": null, "liked_by_creator": false}, {"comment": "One of the students who can't enter here. Saved up for 4 years to study in japan and since I already paid tuition I now get to study online in Japan from outside of Japan. Makes me feel like I've said no to so many great opportunities for the last 4 years for absolutely nothing. I just hope they will soon let the students enter again because studying with such a time difference is pretty rough on the mind. Hope you can enter soon too felix!", "commenter_channel_name": "@simi8658", "likes": 5000, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:45.145499", "replies_count": null, "liked_by_creator": true}, {"comment": "The fact that you're so self aware is what makes you different from other \"well off\" people complaining about covid", "commenter_channel_name": "@samwisely842", "likes": 467, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:45.180634", "replies_count": 0, "liked_by_creator": false}, {"comment": "Felix just because you are “well off” doesn’t mean you can’t talk about something affecting you. You are human and your message is super relatable and may make them feel better", "commenter_channel_name": "@Flyers20forlife", "likes": 5000, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:45.217216", "replies_count": null, "liked_by_creator": false}, {"comment": "I was studying in Japan when the pandemic broke out. I was visiting home because a family member had passed away when they closed the borders and all flights got cancelled. After a 3 month strict lockdown the restrictions to enter Japan had toughened and I couldn't fly back. All of my stuff was left in the literal other side of the world and I could not even get back in the country to pick them up, and that also meant I still had to pay rent because my things were still in the apartment. After a couple of months a friend managed to send me most of my things, but there's still money for a whole semester on my japanese bank account I can't access from overseas and my residence card is now expired so I can't get in under the exceptions. It's not just that the borders have been closed for so long, it also feels like they've been trying to make things as difficult as possible. \n\nI of course had to cancel the second part of the exchange and missed a semester. This forced me to take an extra year to finish my degree. I can understand your frustration because I remember being so excited to know you were moving to Tokyo when I was there too, and I thought I was so lucky because of that. Here we are now two years later :-) I really hope this gets sorted soon, even though it doesn't look too good. Sending you the best ", "commenter_channel_name": "@claradefelipe", "likes": 1000, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:44:45.254132", "replies_count": null, "liked_by_creator": false}, {"comment": "You're not being entitled at all, it's totally okay to talk about what you've been through. It sounds really frustrating especially it's been two years and in the middle of a pandemic. We're rooting for you Pewds! Hoping your situation improves in no time!", "commenter_channel_name": "@ritsune1369", "likes": 1000, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:45.290156", "replies_count": null, "liked_by_creator": false}, {"comment": "I’m a Japanese living in Tokyo. According to a statement from the Japanese prime minister, the government is now considering easing the tight entry restrictions for new foreign arrivals. I’m so sorry for the struggles that you’ve been through about this. I sincerely hope that you and your family can safely move to Japan soon!! I can’t wait to see your videos filmed in Japan!", "commenter_channel_name": "@real6231", "likes": 60, "date": "2 years ago", "fetched_date": "2025-01-19 14:44:45.323704", "replies_count": 0, "liked_by_creator": false}, {"comment": "THANK YOU, FELIX! I'm a university student still stuck outside of Japan, it's nice to know you're talking about the issue. My classes are from 7 pm to around 5 am some days and it's incredibly frustrating.", "commenter_channel_name": "@Luca-ur9uh", "likes": 373, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:44:45.360189", "replies_count": null, "liked_by_creator": false}, {"comment": "No don't feel entitled. One thing we love as subscribers is being able to see where your walks in life are (If you allow them) and we really appreciate being part of that long frustrating journey with you. We hope for the best!", "commenter_channel_name": "@lumi_night", "likes": 513, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:45.402289", "replies_count": null, "liked_by_creator": false}, {"comment": "I'm one of those students who has been unable to get into Japan for almost two years. My exchange programme is due in March and I honestly don't know if I can enter Japan for at least a couple of weeks after two years of online classes. Many of us have had to get up at 2-3am just to listen to zoom lectures, and for those who are self-funded (not educational grants) this is a huge loss. Thank you very much for covering this topic. People who wrote to you didn't expect the Japanese government to suddenly change its bizarre decisions, but to see the support from major youtuber is great. Really moved to tears that finally we have been heard outside our bubble and more people will known about this mess", "commenter_channel_name": "@jjlower7350", "likes": 750, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:45.437818", "replies_count": null, "liked_by_creator": true}, {"comment": "I grew up in Japan my whole life, until I was 18. It is incredibly difficult to get into Japan, my family are Permanent residents (Special Status) and its super difficult for even me to get back home to my parents and older sister who are still there. I hope to see you back in Japan bro. Subscriber since like 2011 or earlier even. One love", "commenter_channel_name": "@f1r3hydr4nt", "likes": 71, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:45.471603", "replies_count": 0, "liked_by_creator": false}, {"comment": "As someone who’s been in Japan for the entirety of the lockdown this is all so valid. It’s very frustrating to constantly hope to go home and travel and constantly waiting while cases go down and back up again. To be clear, I’m here for my job and I love it here very much. But sometimes I miss home. I haven’t seen my family for the holidays in two years.", "commenter_channel_name": "@Lee-hl2ol", "likes": 500, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:45.506866", "replies_count": null, "liked_by_creator": false}, {"comment": "This is why felix is still here after all these years. Money hasn't changed him a bit and he is so humble. Massive respect ", "commenter_channel_name": "@kallmepapi8141", "likes": 1000, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:44:45.543460", "replies_count": null, "liked_by_creator": false}, {"comment": "Your problems are still problems no matter how well off you are. I love hearing your life updates. Thank you!", "commenter_channel_name": "@cassieondra", "likes": 17000, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:45.579235", "replies_count": null, "liked_by_creator": false}, {"comment": "Coming back here, after you've successfully moved to Japan. Congrats Felix!!!", "commenter_channel_name": "@ghettoinhinyero3237", "likes": 61, "date": "2 years ago", "fetched_date": "2025-01-19 14:44:45.613137", "replies_count": 0, "liked_by_creator": false}, {"comment": "Totally justified in venting a little bit! It's refreshing to actually hear that we're all sorta frustrated with the situation to varying levels.\nMaybe it won't help the main situation but it's nice to sorta be in it together, trying to travel aborad and what not.\n\nHang in there man! Trying to stay optimistic for 2022 for things to turn around!", "commenter_channel_name": "@rintaichou", "likes": 1000, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:45.649716", "replies_count": null, "liked_by_creator": false}, {"comment": "Felix, you're allowed to vent. Everyone, no matter how well off they are, has feelings and frustrations, and it's all valid. Vent away, friend. We gotchu.", "commenter_channel_name": "@ivymarie346", "likes": 1000, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:45.685458", "replies_count": null, "liked_by_creator": false}, {"comment": "you are not alone on this! it’s not lame talking about this on YT, i’m relieved i’m not alone either. just last night i was researching when Japan would open its borders… and i do this weekly. my fiancé is Japanese and lives in Japan and we have been patiently waiting almost 2 years now for the borders to open so i can go to him. our relationship is at a point where we need that for us to grow and decide if i will move there myself. long distance is okay, but not forever. we’re both eager and the anticipation is overflowing. i am hoping and praying they open at least around summertime since sakura season is too optimistic… but i hope soon… many of us have halted our plans, some more serious than others since yours revolves around moving there, which is HUGE and you’ve waited TOO long! i understand the frustration! i’m praying for the best and hoping for it to open in the first half of 2022. best of luck Pewds <3", "commenter_channel_name": "@srslychristy", "likes": 668, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:44:45.721723", "replies_count": null, "liked_by_creator": false}, {"comment": "This video is much appreciated Felix, as I am in the same situation. Going to work in Japan has been a dream of mine for a long time, and after my MA in Japanese studies I finally found a job as an English teacher, almost two years ago now. I was approved when the pandemic just started. I was 27, now I'm 29, waiting for news but constantly frustrated because of no updates at all. When there is even a small chance Japan would reopen, they announce that they're closing again. I'm getting older and I feel like my life has been on hold for two years now because I planned on going to Japan for a few years (my visa would be 3 years, extendable) and then coming back home to settle in with my boyfriend. Everyone keeps asking me: \"so when are you going to Japan\" and at that point all I can say is: \"I wish I knew\". At this point it's ridiculous because I've waited that long that it would be bad to give up, but at the same time I can wait much longer as my life needs to go on. Hopefully we'll get an update soon and we'll be able to enter Japan by half 2022, although at this point my hopes are very low.  I don't know if Japan is taking the right approach to this situation, but I'm sure there are other ways to deal with that, like allowing students and workers in, for a change.", "commenter_channel_name": "@anamariamariut3815", "likes": 12, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:45.755639", "replies_count": 0, "liked_by_creator": false}, {"comment": "It's like moving files to another folder but the loading bar gets stuck on 99% for 3 years but you can't bring yourself to cancel it just in case it completes any second", "commenter_channel_name": "@OfficialTCK", "likes": 221, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:45.791812", "replies_count": null, "liked_by_creator": false}, {"comment": "This is why I love pewdiepie, hes very aware of himself, and how he influences a lot of people, but he stays humble, there are a lot of youtubers these days who for me personally, just don't have that same understanding, and thats why pewds is the best youtuber", "commenter_channel_name": "@diaanlouw5039", "likes": 1000, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:44:45.893737", "replies_count": null, "liked_by_creator": false}, {"comment": "Whether you're rich or poor, you're still human and allowed to talk about the things that are upsetting you. I really hope you guys get to move soon!", "commenter_channel_name": "@xRandomSarahx", "likes": 1000, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:45.928731", "replies_count": null, "liked_by_creator": false}, {"comment": "Japan just opened its borders for business and student visa owners. Go for it Felix.", "commenter_channel_name": "@Hamza-qu3yp", "likes": 339, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:44:45.965115", "replies_count": null, "liked_by_creator": false}, {"comment": "I'm one of over 10,000 students whose visas are being processed and suspended due to Covid. Just like you, I've had an apartment set up, I've played the guessing game, I've paid my tuition, and my education has been on hold for almost 2 years because of this. Thank you for making this video. I haven't given up quite yet, I know you or I can't do much about this, but I encourage you to have hope too. It's going to be okay. It has to be. All of us have given up too much for it all to be for nothing.", "commenter_channel_name": "@thedigiseviper1330", "likes": 412, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:44:46.000695", "replies_count": null, "liked_by_creator": false}, {"comment": "this situation must be incredibly frustrating, hope you and marzia are able to make the move or at least have some answers soon. sending love you guys' way", "commenter_channel_name": "@sugarpack", "likes": 777, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:46.036585", "replies_count": null, "liked_by_creator": false}, {"comment": "Just because you're privileged doesn't mean your issues are invalid. People love to play the underprivileged card to make others feel bad. It's a nasty way to let out their frustration and I understand but to make a comparison, your broken arm still deserves to be treated even if your friend has lost a leg.", "commenter_channel_name": "@mlem1042", "likes": 123, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:46.070371", "replies_count": 0, "liked_by_creator": false}, {"comment": "I feel ur struggle bro, I'm a japanese living outside japan, and we were planning to get back to Japan but my mom needs to like apply a new visa idk but since I'm a japanese citizen well I can go back there but currently we're just like at ur same situation now, stay strong ", "commenter_channel_name": "@unknownpalooza8475", "likes": 46, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:46.104377", "replies_count": 0, "liked_by_creator": false}, {"comment": "When Felix talks about serious stuff, he’s always so inspiring. I like it when he talks  slowly and what comes to his mind at the moment.", "commenter_channel_name": "@SoniasWay", "likes": 486, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:46.140001", "replies_count": null, "liked_by_creator": false}, {"comment": "Yo Felix I'm so happy you shared your side of the story about this issue. It was my dream to study abroad in Japan since I was 13 and now that I'm in Uni and worked my ass off for it I had finally had the approval to go and like you said paid my tuition and everything but then Covid happened. Obviously the program got canceled that semester and Japan was closed, but since I was a junior if I still wanted to go on my trip I needed to take time off from school because I technically was required to go on the exchange before I was a senior. So I kept postponing and postponing until 2 years went by and I just had to give up, because I couldn't postpone my graduation anymore. I was so so bummed out because I was so close to living the dream, I really understand you and Marzia's frustration with the whole closed borders situation and Japan hardly ever giving any news updates on it. Everything is just left up to speculation and we of course know that thats not reliable enough information to make such a big decision; I also really held out hoping things would change for the olympics. You guys aren't alone in the struggle. And seriously thank you for sharing your story! Will be keeping you guys in my prayers as well and hope you're able to get to your new home soon!!! ", "commenter_channel_name": "@erianavelez2424", "likes": 317, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:46.175519", "replies_count": null, "liked_by_creator": false}, {"comment": "It’s messed up that you can’t even express being bummed or frustrated without the clickbait media turning it into a headline…", "commenter_channel_name": "@RobertoBlake", "likes": 1000, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:46.211793", "replies_count": null, "liked_by_creator": false}, {"comment": "HE MOVED TO JAPAN AT LAST!!! ", "commenter_channel_name": "@uglyfuzozzi4353", "likes": 16, "date": "2 years ago", "fetched_date": "2025-01-19 14:44:46.245609", "replies_count": 0, "liked_by_creator": false}, {"comment": "Don’t feel entitled because no matter how wealthy or famous someone is they’re still a person. Don’t give up. You and Marzia will get to Japan in due time and will enjoy the next chapter in y’all’s life when it comes", "commenter_channel_name": "@scottmartin4516", "likes": 318, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:46.282210", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewds you're human you have all the right to complain about something that's important to you. You may not change the goberments mind but at least you're representing a lot of people in your situation who maybe needed some confort and validation. I wish you and Marzia the best and I hope things change soon!", "commenter_channel_name": "@OokamiTsu", "likes": 470, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:44:46.315525", "replies_count": 0, "liked_by_creator": false}, {"comment": "Felix when he has something serious on his mind is so inspiring. He talks very slowly and logically. I respect ya man \n\n\nBrofist ", "commenter_channel_name": "@BlocksoBlock", "likes": 302, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:46.351480", "replies_count": null, "liked_by_creator": false}, {"comment": "And now you’re there! Congrats Felix!!!", "commenter_channel_name": "@jaredhoskins9630", "likes": 11, "date": "2 years ago", "fetched_date": "2025-01-19 14:44:46.384432", "replies_count": 0, "liked_by_creator": false}, {"comment": "As someone who was supposed to go study in Japan, this situation has been life altering in the most depressing way, I've had to make hard decisions in order to gratuate and I had to give up on my dream to go to Japan. Students can't wait forever, and as you mention, Japanese students are allowed to complete their semester abroad and it just breaks my heart. Thank you for this video, I think that I needed to hear that I'm not alone in this situation.", "commenter_channel_name": "@thomaslieben7138", "likes": 198, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:46.420200", "replies_count": null, "liked_by_creator": false}, {"comment": "\"I don't think the world needs someone who is, you know, well off, complaining how COVID is affecting them.\"\n\nIt's stuff like this that makes me respect Felix a lot.", "commenter_channel_name": "@novolenio6396", "likes": 234, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:46.455702", "replies_count": null, "liked_by_creator": false}, {"comment": "You don’t have to be sorry for just sharing a problem you’re facing, it’ does sound frustrating tbh we really hope you can get through this and be able to move there <3", "commenter_channel_name": "@Thatsspingu", "likes": 257, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:46.491774", "replies_count": null, "liked_by_creator": false}, {"comment": "I'm SO, SO happy that you were able to move to Japan!!!", "commenter_channel_name": "@IKEMENOsakaman", "likes": 15, "date": "2 years ago", "fetched_date": "2025-01-19 14:44:46.524931", "replies_count": 0, "liked_by_creator": false}, {"comment": "THANK YOU FELIX! I actually am living in Japan but because of your reasons mentioned, I couldn’t see my girlfriend for over two years, couldn’t see my family on Christmas and none of my friends could visit, which makes Tokyo, a place that can be lonely at best times, even worse. It’s been hard and the most frustrating part is how the Japanese population doesn’t even notice and doesn’t care, same as the government. I can’t even imagine all the students stuck in limbo still waiting, for over 2 years now. It’s an insane situation that needs to be shed light on, so thank you for exposing some of the ridiculousness we all have to go through and endure. You are not alone. Thank you!", "commenter_channel_name": "@smaxfpv1337", "likes": 534, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:46.560328", "replies_count": null, "liked_by_creator": false}, {"comment": "Can’t wait for Felix to have the “pewds in Japan” series where he meets up with Chris from abroad in Japan lol. That would be the dream collab of all time.", "commenter_channel_name": "@rolan9955", "likes": 1000, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:44:46.596518", "replies_count": null, "liked_by_creator": false}, {"comment": "I'm one of the students in the waiting limbo, I'm so happy that you spoke up it made me feel seen and heard. The uncertainty is one thing, but the online classes from 3AM had proven to be the shittiest thing ever. I was sick 5 times in the past 3 months, and i used to be quite genki. Not seeing the sun for a few months can do all sorts of stuff to your mind and body. Anyways, I'm still pondering giving up, but i already sacrificed so much i know i will regret it whatever i do. I honestly hope that you will manage to move, I'm excited for the pewdiepie jvlog era. ", "commenter_channel_name": "@oOomusicformeoOo", "likes": 108, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:46.632560", "replies_count": null, "liked_by_creator": false}, {"comment": "I'm waiting for an update, i heard that Japan finally opened up their borders, go for it before something happen again!! this makes me wanna missed those japan vlogs!", "commenter_channel_name": "@mariestark2481", "likes": 16, "date": "2 years ago", "fetched_date": "2025-01-19 14:44:46.666926", "replies_count": 0, "liked_by_creator": false}, {"comment": "Thank you for sharing this, good luck with all of that !\nLove you Pewds", "commenter_channel_name": "@overspes", "likes": 2000, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:46.700983", "replies_count": null, "liked_by_creator": false}, {"comment": "Hearing Felix talking about this difficult situation helps me a lot in mine : as a french student who was about to go to China for student exchange, the whole mess we're all in is currently pushing me to give up in all the dreams I have for my life. I've already made my parents spend a lot of money for my studies, and give up rn seems like a beetrail to my point of view. But the uncertainty of border's reopening keeps the feeling to doing somthing wrong to grow up and up, to a point of you just want to give up on every options you have. I stopped hopping that everything will end quickly, I'm just hopping right now that we might see the end of this, and this hope is already starting to burning down. The best we can do is protect ourself and eachother, and enjoy the things that make us still smile, but I'm starting to realize that a lot of people don't want to do the first, and others can't do the second.", "commenter_channel_name": "@Wendyghost", "likes": 149, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:46.737113", "replies_count": null, "liked_by_creator": false}, {"comment": "It's so relieving hearing Pewds talk about this tbh. I've been trying to move back to Denmark for the last 2 years and I swear it's the most frustrating, most difficult waiting game. As Pewds said, there's literally 0 certainty, and you never know whether you're getting closer to succeeding or you're just as stuck as ever. But hearing that so many people are going through the same situation is definitely making me feel a little less lonely ", "commenter_channel_name": "@pisika4pisoi", "likes": 331, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:46.773074", "replies_count": null, "liked_by_creator": false}, {"comment": "I love the videos where Felix speaks his mind, he conveys his feeling very well, and somehow makes me feel like I've know him from my neighborhood", "commenter_channel_name": "@thelitupglassesman4798", "likes": 7, "date": "2 years ago", "fetched_date": "2025-01-19 14:44:46.807378", "replies_count": 0, "liked_by_creator": false}, {"comment": "It doesn’t feel like you’re being entitled coming from you. It’s about the way we know how you are as a person all together! You’re great!", "commenter_channel_name": "@Ax3lll-n3t", "likes": 380, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:46.842932", "replies_count": null, "liked_by_creator": false}, {"comment": "Rationalizing that your status, income, or influence, lessen your consternation on the subject will not cause your feelings to go away. There is absolutely nothing wrong with you voicing your concerns and I'm pretty sure everyone here appreciates any candid conversation you give us. Japan is a dream of yours, don't give up on it.", "commenter_channel_name": "@millermcgraw1", "likes": 587, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:46.877089", "replies_count": 0, "liked_by_creator": false}, {"comment": "Ahhh, I'm stuck in a similar situation, and it is frustrating! I applied to school in Japan, paid all the fees, got my COE, was ready to go... then boom, they just slammed the door shut right in our faces, even as international students. I can't think of another country that just doesn't seem to care, not even allowing low-risk people who hold long term visas. it's been 2 years of my life and thousands of dollars wasted stuck in this limbo, it feels awful.", "commenter_channel_name": "@Grubbypirate", "likes": 316, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:46.911874", "replies_count": null, "liked_by_creator": true}, {"comment": "My work friend is going through this as well, he has had an employer in Japan and hes been trying to go for 2 years now but after this last border closure in December the employer gave up on him so now he doesnt know what to do with his life as hes been holding on to this hope of going back to Japan :( its so sad", "commenter_channel_name": "@Ninisw33t", "likes": 17, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:46.945484", "replies_count": 0, "liked_by_creator": false}, {"comment": "You're still a human being no matter how much money you have. Don't feel that you are entitled just because you are talking about what's going on in your life. Sometimes, people just need to talk or to have someone listen. We support you.", "commenter_channel_name": "@amethyst53", "likes": 180, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:46.980900", "replies_count": null, "liked_by_creator": false}, {"comment": "Thank you for speaking about this. I am a international student in limbo attending my classes online at late hours of the night. Not being able to experience studying abroad is sad and frustrating, but knowing that I am not alone in my struggles brings me comfort. I really hope we can both be in Japan soon Pewds.", "commenter_channel_name": "@willowpeterson9905", "likes": 37, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:47.014911", "replies_count": 0, "liked_by_creator": false}, {"comment": "I’m glad you talked about this because I’ve been curious how this process has been. You speak with such a well rounded and respectful mindset. I think it’s important for kids to see people like you process this way, it’s such good character", "commenter_channel_name": "@kameko.studio", "likes": 74, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:47.050907", "replies_count": null, "liked_by_creator": false}, {"comment": "even as an online persona that everyone knows i see that you’re actually pretty self aware and super thoughtful about possibility A and B in given situations. i feel like there’s so much to this video! it’s just a lot of things but it’s cool i get to know your thoughts. feel like so many people judge an online persona and just poke around without actually trying to make anything better, it’s all just people self absorbed in their shit and thinking wrong about people most of the time. hope you and the rest of the people in the similar situation get to see japan. this covid shit sucks to the core and it’s just so unfortunate these generations have to live it unless we learn something better from it. i hope you and the rest of the people get to see japan soon!! btw pewds if any book i recommend it’d be The Subtle Art of not Giving a Fuck, helped me realize so much about myself and the world", "commenter_channel_name": "@i.m.4438", "likes": 3, "date": "2 years ago", "fetched_date": "2025-01-19 14:44:47.084730", "replies_count": 0, "liked_by_creator": false}, {"comment": "The way you go back and forth between completely giving up and going full tilt is very much how I see my own career as a creator.", "commenter_channel_name": "@Goat-on-a-Stick", "likes": 797, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:47.120857", "replies_count": null, "liked_by_creator": false}, {"comment": "To be honest I didn’t get a single moment where I felt like “wow he shouldn’t be complaining”.. you’re a human. You’re allowed to vent and update us on what’s going on. I’ve been curious to know what has been going on.\n\nDon’t beat yourself up for sharing, I don’t think any of us are thinking poorly of you for making this. Not in the slightest.", "commenter_channel_name": "@glitter2431", "likes": 553, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:47.156482", "replies_count": null, "liked_by_creator": false}, {"comment": "I know that feel... I was supposed to have a wedding with my Japanese fiancee in her hometown in June of 2020. Had a bunch of my friends and family planning to fly over there, then watched them all back out one by one until we had to make the decision to call it off. She made it to my home country (Canada) thankfully and we got married on paper, however she hasn't been able to go back to see her family in almost 2 years now. It's stressful not knowing how to plan for the future when governments are opening and closing their borders faster than a revolving door.", "commenter_channel_name": "@DBT57", "likes": 388, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:47.192585", "replies_count": null, "liked_by_creator": false}, {"comment": "いつか日本にぜひ", "commenter_channel_name": "@%E3%82%82%E3%82%82%E3%81%A1-d6f", "likes": 2, "date": "2 years ago", "fetched_date": "2025-01-19 14:44:47.226712", "replies_count": 0, "liked_by_creator": false}, {"comment": "Thanks for sharing this.", "commenter_channel_name": "@Memology101", "likes": 68, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:44:47.262575", "replies_count": null, "liked_by_creator": false}, {"comment": "being well off doesn't invalidate people's struggles or frustrations , just because someone has money doesn't mean they can't go through rough time . hope they open their borders soon", "commenter_channel_name": "@talkswithyb", "likes": 181, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:47.298227", "replies_count": null, "liked_by_creator": false}, {"comment": "A lot of people share your frustrations Pewds, I'm sure it's comforting to hear you talk about it and share this", "commenter_channel_name": "@Belle-zq3xc", "likes": 115, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:47.335922", "replies_count": null, "liked_by_creator": false}, {"comment": "Well, Pewds...different point of view. Moved to Japan two years ago before they closed the borders. It's been a crazy up and down over here as well...and the thought of not seeing your family in person for two years, because you exactly know, when you leave the country, you're not allowed to enter Japan again...except you are Japanese (even not being vaccinated), is deeply depressing.\nAs long as you are a foreigner, you are on the wrong side. :'D\nA friend of mine is married to a Japanese woman, they have kids together, live in Europe...he got the shot, she didn't. Guess who was allowed to go to Japan for the summer holidays?\nShe, and their kids. He wasn't. That's the way it is. And that's the way how Japan survived hundreds of years ago. The longer I stay here, the more I truly understand the way of thinking, which is really interesting.\n\nWith that said, you and Marzia will  move to Japan eventually, it is just not the right time yet. Also, sure, it's nice to be here, but when there are restrictions everywhere, and you're just ending up going to work, buying groceries, always wearing a mask, and staying at home, because of all that...that's not the life you dreamed off, while being here. :*\n\nAnd I don't think you're complaining at all, you're just pointing out problems of being a foreigner, trying to live in Japan. :)\n\nStop saying sorry, you are just hooman. ;)", "commenter_channel_name": "@SinaSofie", "likes": 41, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:44:47.371904", "replies_count": 0, "liked_by_creator": false}, {"comment": "My sister is in the same boat! She’s a student that was supposed to go on an international internship and become a foreign exchange student for a semester. And one of the main issues with it is indeed in fact the lack of information. She can’t rly plan around that. She could’ve gone to another country or done something else in general if she knew. And she’s worked really hard for this and seeing it just not work out for something that is out of her control like this rly sucks. Thanks for the vid Felix! Im totally showin my sis this video.", "commenter_channel_name": "@troyboi7662", "likes": 211, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:47.406040", "replies_count": 0, "liked_by_creator": false}, {"comment": "I've also been waiting since March 2020 to start my job over there. The govt keeps saying \"for the time being\" but that really plays with your head after a while. It's also frustrating neither any media or governments seem remotely bothered by the fact Japanese people can go travelling and studying abroad and get on with their lives but people with spouses, jobs and paid exchange programmes in Japan are still ignored and treated the same as tourists. It has had a big emotional impact on my life.", "commenter_channel_name": "@Hayato2829", "likes": 86, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:44:47.441038", "replies_count": null, "liked_by_creator": false}, {"comment": "ive never felt like pewds has sounded entitled about anything. he is very conscientious about how he talks about his situation and how it affects others. its honestly refreshing to hear a big youtuber with this much sense.", "commenter_channel_name": "@zumi3051", "likes": 47, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:47.475317", "replies_count": 0, "liked_by_creator": false}, {"comment": "Don’t give up. Living in Japan has been my dream my whole life. Sadly it will likely never happen due to health issues. Keep going. When you get there it will be the most amazing feeling. I went through the same thing while buying a house and almost gave up. I’m so glad I didn’t.", "commenter_channel_name": "@quendelf", "likes": 8, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:44:47.509316", "replies_count": 0, "liked_by_creator": false}, {"comment": "Just read the title and wow. I realized how loyal Felix has been to YouTube and his fans....can we just protect him at all costs. Thanku", "commenter_channel_name": "@sss_697", "likes": 144, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:47.543127", "replies_count": 0, "liked_by_creator": false}, {"comment": "Your situation and feelings are valid. Your allowed to express your frustration without feeling guilty about it. Especially when this is a problem that many people are struggling with. I’m sure they’ll find solace knowing that they aren’t alone. Thanks for the update pewds, I hope it all works out for you and others experiencing something similar :)", "commenter_channel_name": "@Alyssa-jl2yf", "likes": 672, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:47.579279", "replies_count": null, "liked_by_creator": false}, {"comment": "I feel for you Felix.\n\nMy brother lives in Japan, and I still haven't been able to visit him in over 2 years or even get to know my newborn nephew. The pandemic is going to last for a while still and it's best to approach circumstances with that in mind (also, Japan being Japan about the pandemic). Still, it's clear that it has been your dream to live in Japan, so don't give up even if it's going to take some time.\n\nMuch love.", "commenter_channel_name": "@nuku9neko", "likes": 107, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:44:47.615299", "replies_count": null, "liked_by_creator": false}, {"comment": "Come to Japan. Don't give up! I've lived here 7 years and I never want to leave.", "commenter_channel_name": "@AxeManJapan", "likes": 16, "date": "3 years ago", "fetched_date": "2025-01-19 14:44:47.649513", "replies_count": 0, "liked_by_creator": false}], "related": []}