{"code": "BQ35bZAPUnk", "title": "Why I didnt quit", "url": "https://www.youtube.com/watch?v=BQ35bZAPUnk", "thumbnail_url": "https://i.ytimg.com/vi/BQ35bZAPUnk/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLCoxcI1Bn1w7tG--rVoi2V-Z83Fig", "views": 4000000, "likes": 438000, "duration": "", "embed_code": "https://www.youtube.com/embed/BQ35bZAPUnk", "uploaded_date": "14 Sept 2022", "comments_count": 20338, "comments": [{"comment": "Making videos about whatever you want at your own pace makes Youtube much more fun rather than feeling pressured to upload at a specific schedule. Keep doing you!", "commenter_channel_name": "@grandayy", "likes": 15000, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:10:28.458583", "replies_count": null, "liked_by_creator": false}, {"comment": "Honestly I've been really enjoying the \"Felix enjoying his life and doing whatever the fuck he wants because he doesn't worry about content anymore\" arc, so please, keep doing whatever you want to do, me and many others would still be here for that.", "commenter_channel_name": "@THExRISER", "likes": 4000, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:10:28.502936", "replies_count": null, "liked_by_creator": false}, {"comment": "I've been absolutely loving the new Japan chapter! It feels so relaxing, especially after the wild 2020-2021 we all had", "commenter_channel_name": "@ChippyGaming", "likes": 8000, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:28.539235", "replies_count": null, "liked_by_creator": true}, {"comment": "Been with Felix since Friday with Pewdiepie I remember as a kid refreshing YouTube everyday and waiting for his videos. My childhood wasn’t the best, was severely bullied in school, but his video I can honestly say saved me from the dark thoughts.  I’m so happy he has found his way back and is grounded. You deserve it after 12 years. I’m 23 have my own place and I’m truly happy I’m still here to see this.", "commenter_channel_name": "@Animedude201", "likes": 802, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:10:28.577267", "replies_count": null, "liked_by_creator": false}, {"comment": "I’m so glad Felix didn’t quit, considering how most of the original YouTubers have quit. It’s inspiring to see him still doing good and reinventing his content", "commenter_channel_name": "@SoniasWay", "likes": 1000, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:28.615774", "replies_count": null, "liked_by_creator": false}, {"comment": "Having Pewds still around is a bless, let's be real", "commenter_channel_name": "@Luigikid", "likes": 1000, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:28.653382", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewds, I think as you simultaneously inspire many others to begin YouTube (hello!), you're also consistently inspiring yourself to try new content over the years. Sounds to me like you love to share your experiences with the world and a lot of people appreciate that.. it's easy to get caught up in the numbers but so many of us enjoy you simply and unapologetically being yourself. Glad you're still here, keep going!", "commenter_channel_name": "@CoffeehouseCrime", "likes": 14000, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:28.691370", "replies_count": null, "liked_by_creator": true}, {"comment": "I've been watching since I was 12. I'm 23 now. It's a bizarre thing, practically watching someone grow up and change as a person. Happy for you and all that you've achieved. Keep living life.", "commenter_channel_name": "@wingeroni135", "likes": 248, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:28.726406", "replies_count": 0, "liked_by_creator": false}, {"comment": "These comments got me like thank you guys", "commenter_channel_name": "@PewDiePie", "likes": 870, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:28.765728", "replies_count": null, "liked_by_creator": false}, {"comment": "I’ve watched this guy since I was 12, and I am now 22. Don’t watch him frequently anymore, but wow how time goes by.", "commenter_channel_name": "@Borgia5119", "likes": 4000, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:28.803886", "replies_count": null, "liked_by_creator": false}, {"comment": "I used to think that I missed the “old pewdiepie” but I realized what I actually missed was the genuine happiness he had or came across as having back in the day. I really enjoy the Japan vlogs because you always seem so happy in them and it really makes my preteen (when I first started watching 9 years ago) self happy again.", "commenter_channel_name": "@kelseystyles6277", "likes": 927, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:28.843502", "replies_count": null, "liked_by_creator": false}, {"comment": "You were such a major part of my childhood growing up, and even tho I don't watch you nearly as much as I used to anymore, u will 100% always be such a great influence", "commenter_channel_name": "@ninjanemesis852", "likes": 244, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:28.886838", "replies_count": null, "liked_by_creator": false}, {"comment": "You are the reason I got into this, I wish you the best ️", "commenter_channel_name": "@Mullyy", "likes": 2000, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:28.931091", "replies_count": null, "liked_by_creator": true}, {"comment": "it’s actually refreshing to see YouTubers I grew up watching becoming more mature themselves and talking about these kinds of things. I am almost 30 and it makes me feel better knowing YouTubers are growing and changing too!", "commenter_channel_name": "@elmobabe979", "likes": 547, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:28.970281", "replies_count": null, "liked_by_creator": false}, {"comment": "I honestly feel like Pewds has already retired and he's just hanging out with us. I'm glad he's out of the drama and hope that he does whatever is the best for his mental and physical health. If he keeps posting I'll keep watching, but if he decides is time to leave, I'll miss him, but I'll understand", "commenter_channel_name": "@berryman5145", "likes": 1000, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.009896", "replies_count": null, "liked_by_creator": false}, {"comment": "Tbh pewds was the era of youtube i loved, once he stopped uploading ive taken a step back i come here once and a while to see what hes doing, but now i just follow him and marzia on insta and its so cute seeing what they do in their daily life its nice to see them just relax for once and be hppy️", "commenter_channel_name": "@meganbumstead418", "likes": 614, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.055698", "replies_count": null, "liked_by_creator": false}, {"comment": "Glad you didn't quit, and it's great you found a way to still make videos while also enjoying life. Stay happy Felix, and thanks for all fhe memories", "commenter_channel_name": "@fallowsx2", "likes": 1000, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.092634", "replies_count": null, "liked_by_creator": false}, {"comment": "I haven't actually watched this channel in years, but it's somehow comforting to know that it's still hanging around. One of the veterans so far ahead in the eternal race that he can just sit in the stands and watch, not running the horse dry like some other big names, it's good to know he's still around.", "commenter_channel_name": "@PokecrafterChampion", "likes": 361, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.131976", "replies_count": null, "liked_by_creator": false}, {"comment": "That brofist will forever be apart of so many people’s lives. Just a personal touch of the channel over the years", "commenter_channel_name": "@avriladam0404", "likes": 792, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.176871", "replies_count": null, "liked_by_creator": false}, {"comment": "Loved the brofist gave me chills haha I'm just happy I can tune in every now and then see what's going on it's like visiting an old friend, I'm glad for you pewds and love that you upload as long as you do", "commenter_channel_name": "@Dennizjoon", "likes": 164, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.213053", "replies_count": 0, "liked_by_creator": false}, {"comment": "Man, I know that brofist was just a “why not” moment, but after all that Felix has been through and reflecting on what he’s done and where he’s at now - it really felt special somehow, almost cathartic. It really nailed in how much he has grown as an individual, I’m really proud of current Felix and supportive over this mental clarity. I aspire to reach this level of content one day.", "commenter_channel_name": "@TheWanderer_1", "likes": 1000, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.251654", "replies_count": null, "liked_by_creator": false}, {"comment": "Youtube is like an addiction to most content creators, very hard to quit and most come back. Glad you're enjoying Japan and the vlogs so much! much feel like the most satisfying breath of fresh air ever taken", "commenter_channel_name": "@Patterrz", "likes": 651, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.289114", "replies_count": null, "liked_by_creator": false}, {"comment": "Every now and then, I get jealous of the times I was watching your Amnesia playthrough videos with my buddies. A bunch of 12-year-olds, falling on our asses laughing. Magical. That was over 10 years ago. I don't even know those buddies anymore, we haven't talked in years.\n\nIt's something different when you see your childhood idol grow up with you, getting caught up in life and it's ups and downs...\n\nTime really flies by. Being here now, as an adult, in my own apartment, in my own life, with my own thoughts and worries, in this moment, I want to thank you. Thank you for being a part of some of the dearest memories I have from my childhood, throughout the times of growing up.\n\nI have never met you, but look at us, look at you right now, look at where we have arrived. Almost brings a tear to my eye. Yet, most of life is still ahead...\n\nWhether you see this or not, I wish you luck on your journey in life, Felix. I can almost swear, sometimes, I still feel a little bit of that childhood magic, and I hope you do too. That spark is all that matters, it's called love for life.\n\nIt's easy to forget what truly matters when you have so many sources of stress and worry, unlike when you were still a kid, your biggest worries being homework or not being allowed to play video games past ten.\n\nNever lose that spark, Felix.\n\nHave a good one, bud. Brofist.\n\nPs. Please do an Amnesia custom story playthrough for Halloween 2022. Hehe", "commenter_channel_name": "@j_lemy", "likes": 543, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.326805", "replies_count": null, "liked_by_creator": false}, {"comment": "I’ve been here since the amnesia days.  I loved your content then and I love your content now. Keep doing things your way at your own pace. Seeing you and Marzia so happy in Japan makes me happy as well. You’re an inspiration and we’re grateful for everything!", "commenter_channel_name": "@Nicole-qo9zr", "likes": 193, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.362314", "replies_count": 0, "liked_by_creator": false}, {"comment": "How many times do we need to remind this man that we SIMPLY JUST WANT TO SEE HIM HAPPY.", "commenter_channel_name": "@LEEZAlol", "likes": 722, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.400573", "replies_count": null, "liked_by_creator": false}, {"comment": "We love you Pewds, we'll support you no matter what you decide to do!!", "commenter_channel_name": "@LowKeyDead.", "likes": 12000, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.442098", "replies_count": null, "liked_by_creator": false}, {"comment": "I was loving the japan vlogs. One of the most recent ones that I saw legit brought me to tears. It was so nice to see you two so happy and it really gave me hope that one day I can go and at least visit japan with someone I care about. The fireworks where amazing. Brofist!", "commenter_channel_name": "@Taltonis", "likes": 114, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.477343", "replies_count": 0, "liked_by_creator": false}, {"comment": "Totally makes sense, you're finally at the point you can enjoy YouTube at a slower pace, something a lot of us are striving. Enjoy the fruits of your labor man, you deserve it", "commenter_channel_name": "@HofTheStage", "likes": 856, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.515259", "replies_count": null, "liked_by_creator": false}, {"comment": "Without you, Outerminds wouldn't be what it is today. You were there for us from the start and without this entire journey of yours, none of this would have been possible. Thank you so much for giving us an amazing opportunity to work with you on amazing games. We are extremely thankful and hope you enjoy Japan fully, and make videos on subjects you love at your own pace. You deserve it.", "commenter_channel_name": "@Outerminds", "likes": 843, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.554213", "replies_count": null, "liked_by_creator": false}, {"comment": "That brofist hit me right in the heart. Whatever you’re doing pewds, we’re here to watch. Seeing you happy and fulfilled is inspiring af and I appreciate the hell out of you for sharing.", "commenter_channel_name": "@veganmama6750", "likes": 269, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.591259", "replies_count": null, "liked_by_creator": false}, {"comment": "I usually don't read a lot of comments, but damn i had no idea people ASKED you to stop making videos?! I just want to say that i'm super happy that you're still here and doing your thing, even if it can take a lot out of you to \"make others happy\" sometimes. I've followed you since you've started (now 23years old) and as weird as it would feel not having you here, like you say, you can't always please everyone, it's impossible. \n\nPeople can be so judgy and grumpy and i support you for doing what feels best for you, but i'm happy you're staying!", "commenter_channel_name": "@k.w3st", "likes": 152, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.626702", "replies_count": 0, "liked_by_creator": false}, {"comment": "been here since 5th grade, now i'm about to be a freshman in college in less than two weeks... :) thank you for making my childhood and teenage years more bearable, fun and colourful, pewds. let's see where life will take us from now on. i love you so much, always.", "commenter_channel_name": "@inthe_smeraldogarden", "likes": 1000, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.667703", "replies_count": null, "liked_by_creator": false}, {"comment": "It's always been so refreshing to watch someone who is grounded and positive and real, and I have so much respect for the fact that you're just, a good influence.  You deserve time off when you need it, we'll always be here.", "commenter_channel_name": "@RachelHardy", "likes": 877, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.705874", "replies_count": null, "liked_by_creator": false}, {"comment": "The best part about “making it” is that you can do whatever you want so don’t feel pressured to make anything. We’ll support you no matter what.", "commenter_channel_name": "@n8man", "likes": 502, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.742313", "replies_count": null, "liked_by_creator": false}, {"comment": "I relate to this video on some many extremely deep levels. It’s like seeing my inner thoughts externalized, almost exactly like how I imagine myself one day talking in the video.", "commenter_channel_name": "@HawksNestYT", "likes": 10, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.782077", "replies_count": null, "liked_by_creator": false}, {"comment": "You're like a friend I never got to meet, who started at the bottom and eventually reaching goals and dreams. Makes me genuinely happy to see you where you are right now. Stay wholesome, Pewds.", "commenter_channel_name": "@Ikkysan1", "likes": 200, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.818904", "replies_count": null, "liked_by_creator": false}, {"comment": "I've actually felt that the content has generally been better since he seems to be enjoying creating it as much as we enjoy watching it", "commenter_channel_name": "@chanupajayasinghe", "likes": 628, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.857235", "replies_count": null, "liked_by_creator": false}, {"comment": "The brofist got me. I started watching you when I was a teenager. I’m grown with a family now and still watch. Love ya pewds! Stay happy man!", "commenter_channel_name": "@AlexNoles703", "likes": 196, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.898858", "replies_count": null, "liked_by_creator": false}, {"comment": "The brofist at the end was very nostalgic and heart warming in a way. I love to see how much pewds has progressed in his life and im glad to have been apart of it. been here since amnesia :) love you pewds", "commenter_channel_name": "@firef3981", "likes": 21, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:29.934507", "replies_count": 0, "liked_by_creator": false}, {"comment": "Yesterday, I had a nice discussion with my partner; we were talking about our favorite YouTube content. While she defended the pure entrainment purpose of the platform, I stated that the most enjoyable thing is to watch someone who feels genuine - back in the day, there was no money to be earned from YouTube, and what I got used to was a bunch of nerds filled with passion. \nFelix, you are a perfect example of someone truly down to earth, just attempting to share some everyday joy with his viewers. That is why you always were and will be the king of YouTube, the true expression of its soul and starting engine.", "commenter_channel_name": "@bestAllex", "likes": 352, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:10:29.972516", "replies_count": null, "liked_by_creator": false}, {"comment": "Take the path that makes you happiest, Felix. You've done so much as an influencer and your life with Marzia is ultimately most important. ️", "commenter_channel_name": "@KyleAllenMusic", "likes": 583, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:30.008938", "replies_count": 0, "liked_by_creator": false}, {"comment": "The character developement of pewdiepie throughout the years has been insane", "commenter_channel_name": "@Batman.97", "likes": 678, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:30.047485", "replies_count": null, "liked_by_creator": false}, {"comment": "My god I remember watching pewds for 4 years straight and now I just searched for pewds because I saw me beast passed you on the sub count, but the point is I came back here after a year, and i feel like crying, it brings back so many memories, this channel feels like home, pewds feels like home. Thank you for everything felix, you literally deserve everything!!", "commenter_channel_name": "@vikramakahunter", "likes": 9, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:30.084330", "replies_count": 0, "liked_by_creator": false}, {"comment": "The brofist at the end got me. Honestly I've grown up with you Pewds. Watching you navigate life has helped me through mine and turned me on to new topics and ideas I've never thought about before. It really is like growing up with a friend.  Never stop being you. Same goes to sweet Marzia!", "commenter_channel_name": "@ktpink4243", "likes": 796, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:10:30.124391", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewds maturing over the years is very inspiring and he's also a super entertaining individual. Glad to see him happy and living the dream. I don't want him &o quit he's still young and I'm sure he can provide us with some more amazing memories.", "commenter_channel_name": "@nathanreyc", "likes": 297, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:30.162231", "replies_count": null, "liked_by_creator": false}, {"comment": "I feel like youtubers are like musicians. You don’t retire, you just do it whenever you want.", "commenter_channel_name": "@TheZombieRebel", "likes": 213, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:30.203048", "replies_count": null, "liked_by_creator": false}, {"comment": "Despite almost quitting, im thankful Pewds just stuck around as \"retiring.\" He's now at a point where he can post whatever he enjoys & get Gute support from most of The Bros. A rare but incredible position to be in. I've been Enjoying the vlogs & vids posted with Ken etc.... Danke for your Hardwork , Hope you continue to do well & Stay Awesome Bro   ", "commenter_channel_name": "@SkyKin", "likes": 747, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:30.241063", "replies_count": null, "liked_by_creator": false}, {"comment": "This feels like a very relaxed chapter for the channel and I'm all for it", "commenter_channel_name": "@jodewitt", "likes": 144, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:30.278002", "replies_count": 0, "liked_by_creator": false}, {"comment": "I think this new Japan chapter really is a chance for Felix to reinvent himself as a YouTuber. He has already to an extent, with the chill new vibe of these ‘discovering Japan Vlogs‘ (loving Marzia’s editing style!). But since he’s already made it, and has nothing to prove, he can just do whatever he feels and maybe even experiment a bit. The time I’ve spent in Japan has made me a completely different person, and also totally shifted my perspective as an artist and content creator. I wouldn’t expect anything less from PewDiePie. Keep exploring, bro!", "commenter_channel_name": "@Jordan-inJapan", "likes": 601, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:30.319869", "replies_count": null, "liked_by_creator": false}, {"comment": "I've been watching Felix ever since I can remember myself watching Youtube, basically in Primary School and now I'm a University student. It feels like he's a friend that has always been there to make me laugh and lift up my spirits. I am very grateful that you've stayed for so long and it feels so good to say I still love your content even though it's changed. Haven't we all changed during this time span though? Of course we have. And this journey is so wholesome and nice. It's so refereshing to see him happier, successful, and always down to earth, which is something that has stayed the same. Love you Felix, I'm very happy you've managed to make your life one you enjoy <3", "commenter_channel_name": "@irenepst", "likes": 16, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:10:30.356369", "replies_count": 0, "liked_by_creator": false}, {"comment": "It's crazy to think that alot of us have grown up with you. Experienced life with you being apart of it. Interacted with you in a way that wasn't possible in any other time in history. You bro fisting the screen connected with millions, me being one of them. Thank you bro. I hope you and Marzia really do have a happily ever after", "commenter_channel_name": "@MrmorpheuZ", "likes": 363, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:30.393643", "replies_count": null, "liked_by_creator": false}, {"comment": "As someone who has been watching felix for many years and seeing him and his channel go through so many different stages I'm just glad that he's happy", "commenter_channel_name": "@ThunderSpecial", "likes": 231, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:10:30.432758", "replies_count": null, "liked_by_creator": false}, {"comment": "Soooo many years has passed and he still doesn't get it that we watch these videos for HIM, not for memes, games or whatever.. He could upload Reading food packages ingriedients and I would still watch them!", "commenter_channel_name": "@Tomasz987987", "likes": 209, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:30.468874", "replies_count": null, "liked_by_creator": false}, {"comment": "I’ve always found comfort in his videos. I remember watching when he first started the Minecraft videos and actually falling asleep to them. Now, I was a little piece of peace. It’s really wholesome and comforting. :)", "commenter_channel_name": "@kimce48", "likes": 6, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:30.506129", "replies_count": 0, "liked_by_creator": false}, {"comment": "Love this mindset, people for the most part, or at least the ones that stick around watch the channel for you, not necessarily the content your uploading but you yourself. So seeing you do whatever you find fun at the time and seeing you genuinely happy is what the core fan base actually want!", "commenter_channel_name": "@MajyeMoreno", "likes": 244, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:30.546743", "replies_count": null, "liked_by_creator": false}, {"comment": "You've been a huge part of my childhood, used to make me laugh everytime. I will always support you no matter what\nWe Love You Pewds", "commenter_channel_name": "@RegzFC", "likes": 334, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:10:30.584965", "replies_count": null, "liked_by_creator": false}, {"comment": "You have brought me wonderful memories and wonderful times. I’ve been watching you throughout high school all the way up to the age of 26. I’m having a child. It’s a boy I would like to have him watch some of your videos when he gets older and then maybe he can subscribe and watch you make videos all the time don’t ever quit you have made me happy with your channel and you brought so much joy in my life and my life is falling apart in high school you were my reward videos when I would do well in college and my relaxation videos after games, I love you so much!!!", "commenter_channel_name": "@CountryCurly", "likes": 44, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:30.621706", "replies_count": 0, "liked_by_creator": false}, {"comment": "As you grow older so do your interest, you do you brother!  You've been a huge inspiration!", "commenter_channel_name": "@Mista_Cassla", "likes": 157, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:30.659271", "replies_count": null, "liked_by_creator": false}, {"comment": "I’ve been here since Amnesia and have grown along the way, too! Different relationships, jobs, locations, etc. And you’ve been with me the whole time. Your channel was the one thing that kept me together during dark times and I just wanted to say that I appreciate you!! Thanks Felix!! \nAlso: BARRELS!!!!", "commenter_channel_name": "@meen0ru", "likes": 674, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:10:30.696292", "replies_count": null, "liked_by_creator": false}, {"comment": "I remember a Video where He almost started crying saying how everything is too much for him and I was Like \"Bro, this is not healthy, you need to quit\" \nI'm so releaved seeing him this calm and in Peace now. \nYou can't make everyone Happy, Pewds, but you have to make yourself Happy so do what you Want. The Real ones will support you no matter what.", "commenter_channel_name": "@SilleBaam", "likes": 115, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:30.737680", "replies_count": null, "liked_by_creator": false}, {"comment": "When I started watching Pewdiepie back then I was still around 9 to 10 years old. Back then, life felt like the best moments of my life because of the small number of problems I had compared to now, and also had a few school friends that also watched pewds, and they were the ones who become my best friend during most of my school life, time sure flies.\n\nWell now I'm 19 years old, I don't watch Pewdiepie as often as I did back then but he is still one of my inspirations and still my all-time favorite YouTuber. I'm glad my older brother discovered pewdiepie back when he was still a \"little\" youtube channel, but that has brought me many connections and bonds towards somebody that I never knew I could had these past 10 years. And for that, thanks a lot Pewds.\n\nBROFIST", "commenter_channel_name": "@seacecd8666", "likes": 7, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:10:30.775695", "replies_count": 0, "liked_by_creator": false}, {"comment": "Just as you have grown and matured, so has your audience — mostly right alongside you. As we settle into our adulthood/families/etc., it’s really nice to watch you do the same. There will always be people who rant about “missing the old pewdiepie”, but I think I can speak for the majority of your fans when I say that we enjoyed your content then, and we enjoy this content now.", "commenter_channel_name": "@RubyEsq", "likes": 306, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:10:30.812473", "replies_count": null, "liked_by_creator": false}, {"comment": "This reminded me of his Draw My Life. \"Felix\" means happiness, I recall he just wanted to play video games and record videos because it made him happy. And I'm glad that's still the trajectory after all these years, for Felix to have fun and be happy. \n\nWe're happy for you, Pewds. From Bros to 9 yr olds to floor gang, tambourine gang... We grew along with you throughout the years and all the phases and changes in you as a person amd the channel. Thank you, Felix, for bringing happiness.", "commenter_channel_name": "@chippyonline001", "likes": 126, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:30.852289", "replies_count": null, "liked_by_creator": false}, {"comment": "Seeing your journey emotionally has really been a crazy experience and now seeing that you're in a happier place really is just awesome. You've inspired a generation! And thank you for that!", "commenter_channel_name": "@GOTGames", "likes": 264, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:30.893569", "replies_count": null, "liked_by_creator": false}, {"comment": "Although I cant follow to the many videos anymore (adulthood is crap) im super happy to come back here from time to time and see how much you changed, evoluted and all the bros are here doing the same thing for you. You´ve built an amazing channel and community, we could never be happy to see you leave. Even though you are kinda retired, its so good to see you come back for us too. By the way, we all came here for the fun, right? Thanks for everything, Pewds !", "commenter_channel_name": "@daniellevieira8159", "likes": 69, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:10:30.930423", "replies_count": 0, "liked_by_creator": false}, {"comment": "it's so crazy to me that i literally grew up with him. i started watching pewds when i was 15. i'm now 25. i'm just honestly really proud and happy for him and what he achieved. he really did all that and he deserves the peace in his life. i'm glad he has a more healthy view now on youtube and mostly can enjoy it. felix if you read this... i thank you from the bottom of my heart for all your hard work. your videos helped me through the toughest years of my life and i'm so grateful, but now... relax and do all the things you never had the time for while doing youtube. i appreciate you so much and i believe everyone is happy to see you every now and then instead of never hearing from you. so take your time now! it's okay. :)", "commenter_channel_name": "@erieeebelle", "likes": 717, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:30.967720", "replies_count": null, "liked_by_creator": false}, {"comment": "Watching Felix through the years it made me realise how confidence grows with time. He’s an inspiration for a lot of people. From being an idiot online to reacting to stupid videos online", "commenter_channel_name": "@nokriscrimson", "likes": 255, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.005041", "replies_count": null, "liked_by_creator": false}, {"comment": "I started watching Felix in middle school, I'm in my 5th year of college now and I still love seeing his notifications. Felix, it's definitely weird to feel proud of someone I do not know, but you've grown so much and you serve as a wonderful inspiration to strive for personal growth. Happy to see that you're happy man ", "commenter_channel_name": "@kattamos6696", "likes": 232, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.043282", "replies_count": null, "liked_by_creator": false}, {"comment": "6:18 nah keep sounding preachy, you’re preaching straight facts my dude", "commenter_channel_name": "@krystallelopez4535", "likes": 2, "date": "1 year ago", "fetched_date": "2025-01-19 14:10:31.079412", "replies_count": 0, "liked_by_creator": false}, {"comment": "I’m not crying, you are. Everyone matures and everyone grows, It’s a part of the journey and as a long time watcher and supporter do what makes you smile. The support from people who genuinely want you to be happy is real and even if it means less videos or you stop posting all together just know the time we had was a good ride.", "commenter_channel_name": "@rigogonzalez3815", "likes": 245, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:10:31.118132", "replies_count": null, "liked_by_creator": false}, {"comment": "We never know what's around the corner.   I'm an old grandma who enjoys you- and I have NEVER played a video game in my life.   It's very clear to me that you are a pure love person. \nI very much enjoy all the views of Japan because I will never get there - a wonderful glimpse into a unique and beautiful culture.  I also enjoy your book videos.   Love from USA.", "commenter_channel_name": "@kathybost1879", "likes": 170, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.156791", "replies_count": null, "liked_by_creator": false}, {"comment": "I think I speak on behalf of everyone: We don't stay here for the content, we stay for Pewds. Regardless of what content you make, it's nice to have a friendly familiar face to share a laugh with - whether you're reacting, vlogging, playing Minecraft or Horror games :)", "commenter_channel_name": "@ohnePixelVids", "likes": 1000, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:10:31.194326", "replies_count": null, "liked_by_creator": false}, {"comment": "Man I really just open YouTube to check on this channel every once in a while. I don't have the same kind of time I had when I was a kid to keep up with every video, but I have so much respect for the past. The Brofist was refreshing.", "commenter_channel_name": "@mostafaezzddine3619", "likes": 7, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.230399", "replies_count": 0, "liked_by_creator": false}, {"comment": "Felix's humbleness with his huge platform is part of the reason I love him so much", "commenter_channel_name": "@puggumpus", "likes": 135, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.268582", "replies_count": null, "liked_by_creator": false}, {"comment": "Felix being himself and just mostly uploading vlogs of his trips in Japan are so entertaining too, glad to see him being himself", "commenter_channel_name": "@benji_h3734", "likes": 192, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.307122", "replies_count": null, "liked_by_creator": false}, {"comment": "\"but the awkward part is.. I'm still here\"\n\nyes everyone thought he was going to quit but he's still here and really, That makes me happy!", "commenter_channel_name": "@MissesWitch", "likes": 135, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.344513", "replies_count": null, "liked_by_creator": false}, {"comment": "I feel like this is a fitting end sorta. I’ve been watching you since the Happy Wheels day’s and even though I haven’t been fully caught up because of high school and everything, but now as a 20 year old adult high school graduate, I can say I’m happy for growing with you and was happy and down with any direction of content you take and sharing all the fun and happy moments even to this day. When the time you retire actually comes, I will never forget you, Felix ", "commenter_channel_name": "@joadarium9605", "likes": 21, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.380995", "replies_count": 0, "liked_by_creator": false}, {"comment": "I've actually enjoyed your content more recently than your older stuff. It seems more genuine these days.  I dig your choice to just do it in the way that you'll enjoy it rather than trying to chase after a bigger sub count or others' idea of what success means.  Very IKIGAI!", "commenter_channel_name": "@TrentKaniuga", "likes": 223, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.418228", "replies_count": null, "liked_by_creator": false}, {"comment": "The \"I'm gonna make the content that I want for fun and enjoy my life\" Pewds is honestly a vibe. It's refreshing to watch and honestly, I find it really inspiring. I feel like many parts of life now is about upholding all these superficial goals or images to kind of keep face with everyone's expectations. But watching you go \"I'm just going to enjoy things at my pace now\" I think is really empowering and a message I resonate with. Thank you Pewds, keep doing what you're doing!", "commenter_channel_name": "@ChrisplussTina96", "likes": 179, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.456545", "replies_count": null, "liked_by_creator": false}, {"comment": "You inspired the development of many gaming channels and peoples lives, I think as every channel grows on from the very beginning we encapsulate those who watch us and put pressure on ourselves to over accomplish what we believe is the way our channels should be and not what we were. Thank you Pewds", "commenter_channel_name": "@OblivionYouTube", "likes": 573, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.499326", "replies_count": null, "liked_by_creator": false}, {"comment": "I watch you because I enjoy your commentary on video games. You're so creative and you tell stories while immersing yourself in the current game your playing. No other youtuber does it the way you do. You've been such a huge part of a lot of peoples lives. Now my 6 year old son is watching your Minecraft series and LOVES it. You make some people feel like they have a best friend they've never met. I wish you nothing but happiness because you've given all of us so much. Thank you for everything.", "commenter_channel_name": "@roxieavalonart", "likes": 30, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.536915", "replies_count": 0, "liked_by_creator": false}, {"comment": "It makes me happy to see you happy", "commenter_channel_name": "@GFuelEnergy", "likes": 83, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.578274", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewds dropping a video is like a very good old friend calling after a long time. It doesn't matter what he wants to talk about, I am just happy to hear from him. Whatever is the topic, it just feels the same as hanging out with an old friend I was missing", "commenter_channel_name": "@GiGi4EvErpw4", "likes": 76, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.614425", "replies_count": 0, "liked_by_creator": false}, {"comment": "I think it's safe to say that all of us are beyond grateful for you. For years we've watched your channel grow and it's been such an incredible experience", "commenter_channel_name": "@sorrowandblasphemy2526", "likes": 133, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.652648", "replies_count": null, "liked_by_creator": false}, {"comment": "Time flies. I started watching your Amnesia and penumbra gameplay videos in 2012, when i was 8 years old. 10 years have gone and i've gottan a job, and have just bought an apartment that i will move into in a year or so. \nYour channel has been an essential part of the youtube experience for me, like so many others and i am very certain that everyone can agree on that you've earned it and deserve to do this for fun, enjoy japan and your family life and your new chapter in Japan. Thank you Felix for the years!", "commenter_channel_name": "@nordmannenfrank6066", "likes": 5, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.689821", "replies_count": 0, "liked_by_creator": false}, {"comment": "I love that Felix uploads his \"retirement\" life, I love watching these videos coming home from work, I hope him and Marzia live a long and fulfilled life with each other <3", "commenter_channel_name": "@staticsoul69", "likes": 156, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.727631", "replies_count": null, "liked_by_creator": false}, {"comment": "been a long time!! I still remember watching your stuff on my lunch breaks at work!! Thanks for the great content over all these years Felix,  enjoyed listening to the reflection on everything! Stay Happy!!", "commenter_channel_name": "@TheSLAPTrain1", "likes": 565, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.765619", "replies_count": null, "liked_by_creator": false}, {"comment": "This made me tear up. We're all here for you, Felix. And we're happy for you.", "commenter_channel_name": "@-ver6459", "likes": 199, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.802855", "replies_count": null, "liked_by_creator": false}, {"comment": "I've never really watched pewds that much, but I've always respected his drive. I think it's fine that you're retired, now what you're really doing is just posting because you want to post. It's like getting up and being like \"Damn... I really want to do this\", so you end up putting a bit more effort into it and take your time with it because you don't have that usual pressure of it because it's your job. \n\nJust do you man, post whenever you want and enjoy the life you've worked so hard to build ", "commenter_channel_name": "@zolazar6928", "likes": 16, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.839619", "replies_count": 0, "liked_by_creator": false}, {"comment": "You've earned enjoying life, family, and the country you decided and fought so hard to move to. We love you Felix.", "commenter_channel_name": "@Alan-jv5fq", "likes": 180, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.876790", "replies_count": null, "liked_by_creator": false}, {"comment": "Without you, YouTube would be extremely empty. You’re of of the og’s who’s stayed consistent and has continued to teach others and help them grow as you go through your own life changing experiences. To not keep up with you guys and know what’s going on would just feel wrong to me. I’ve grown up with you and Marzia and you’ve given me a lot of memories. Thanks for everything you do Felix ️", "commenter_channel_name": "@katlyndobransky2419", "likes": 345, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.919439", "replies_count": null, "liked_by_creator": false}, {"comment": "The channels aged like fine wine, glad to have been here for the journey, throughout all the changes it’s been a pleasure. Even though I don’t watch you much anymore I always check back in", "commenter_channel_name": "@tomllewellyn7557", "likes": 277, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.956967", "replies_count": null, "liked_by_creator": false}, {"comment": "Is it okay if I say I feel thankful to Pewds for still being on Youtube? Cause that's how I feel. I love his new, chill content, I love how he feels comfortable enough to share his life with us through vlogs and how he doesn't have to stress over deadlines or fixed series. I just enjoy seeing him doing what he loves. This is all that matters and this is all that have always mattered to me. I have nothing but pure love and respect for this man and his family", "commenter_channel_name": "@vixxedcoffee3260", "likes": 15, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:31.992756", "replies_count": 0, "liked_by_creator": false}, {"comment": "I remember being a kid and having to do a class speech in school and I did it on you that was in 2013, I'm a grown man now and still enjoy whatever content you make cause I grew up watching it, you helped make many people the person they are today and no matter what we all support your decisions", "commenter_channel_name": "@ajbonkerz763", "likes": 143, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:32.032907", "replies_count": null, "liked_by_creator": false}, {"comment": "This man really raised a generation, truly the greatest of all time.", "commenter_channel_name": "@dice9111", "likes": 72, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:32.067286", "replies_count": 0, "liked_by_creator": false}, {"comment": "After so many years, I still brofist the screen...  As someone metioned, watching your videos is just like hanging out with a friend, it will always be great to have you here.", "commenter_channel_name": "@Mari-nn4ru", "likes": 541, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:32.104919", "replies_count": null, "liked_by_creator": false}, {"comment": "Man it's like for the past decade we have been growing together, going through each stage at the same time. That's why I've been enjoying your chanel throughout the years!", "commenter_channel_name": "@serginonchalant", "likes": 207, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:32.139606", "replies_count": 0, "liked_by_creator": false}, {"comment": "Felix went from goofy kid to mature and wholesome man and I absolutely love and support it.", "commenter_channel_name": "@jakefinnegan1932", "likes": 441, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:32.204144", "replies_count": null, "liked_by_creator": false}, {"comment": "i love u pewd", "commenter_channel_name": "@KellyWakasa", "likes": 323, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:32.243752", "replies_count": null, "liked_by_creator": false}, {"comment": "That is exactly what I like about this channel, the content continuously changes together with Felix’ life. That is also the reason why in the past 10 years I de-subscribed and resubscribed multiple times.", "commenter_channel_name": "@carlyn3766", "likes": 1, "date": "2 years ago", "fetched_date": "2025-01-19 14:10:32.281378", "replies_count": 0, "liked_by_creator": false}], "related": []}