{"code": "D0-IrQY4ix8", "title": "Why Japan?", "url": "https://www.youtube.com/watch?v=D0-IrQY4ix8", "thumbnail_url": "https://i.ytimg.com/vi/D0-IrQY4ix8/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLD_ekcyuWxmRx11i2PN9_5VCx-0Bg", "views": 5000000, "likes": 319000, "duration": "", "embed_code": "https://www.youtube.com/embed/D0-IrQY4ix8", "uploaded_date": "6 Jun 2022", "comments_count": 11016, "comments": [{"comment": "My Japanese teacher did warn us that when Japanese people say the know “a bit” of (Spanish or English etc) they usually mean good enough to hold a social conversation. So you shouldn’t say you know “a bit” unless you can hold a somewhat coherent conversation because you’ll be expected to understand more than you think.", "commenter_channel_name": "@Jetiix", "likes": 20000, "date": "2 years ago", "fetched_date": "2025-01-19 14:23:58.536948", "replies_count": null, "liked_by_creator": false}, {"comment": "Unironically, one of the best sponsors I've watched. Using a mincraft build to sponsor your product and Felix reviewing it is pretty neat.", "commenter_channel_name": "@shooshiwhooshi8736", "likes": 2000, "date": "2 years ago", "fetched_date": "2025-01-19 14:23:58.595297", "replies_count": null, "liked_by_creator": false}, {"comment": "Congrats on the move to Japan! My wife and I hopefully will be able to follow in the same footsteps and make the same switch from UK -> Japan one day ", "commenter_channel_name": "@AsianGuyStream", "likes": 14000, "date": "2 years ago", "fetched_date": "2025-01-19 14:23:58.652524", "replies_count": null, "liked_by_creator": false}, {"comment": "世界一のYouTuberが日本を好んで移住とか正直、嬉しすぎる。災害なども頻繁に起きるから気をつけて頑張ってください！", "commenter_channel_name": "@alaindelon2099", "likes": 587, "date": "2 years ago", "fetched_date": "2025-01-19 14:23:58.725476", "replies_count": null, "liked_by_creator": false}, {"comment": "14:36 sooo cute the way he said that brought tears to my eyes lol", "commenter_channel_name": "@DonVFilmoraTutorials", "likes": 1000, "date": "2 years ago", "fetched_date": "2025-01-19 14:23:58.786630", "replies_count": null, "liked_by_creator": false}, {"comment": "Welcome to Japan.\nI hope Japan is treating you good.  Japanese economy hasn't been very good for the past 10 years and you moving to Japan is actually a very positive thing for us. We really appreciate you. Thank you very much.", "commenter_channel_name": "@mayojapan", "likes": 4000, "date": "2 years ago", "fetched_date": "2025-01-19 14:23:58.849104", "replies_count": null, "liked_by_creator": false}, {"comment": "Not having strangers talk to you seems like a vibe", "commenter_channel_name": "@GFuelEnergy", "likes": 4000, "date": "2 years ago", "fetched_date": "2025-01-19 14:23:58.919028", "replies_count": null, "liked_by_creator": false}, {"comment": "I think the child's first language question is nice. When they're younger, it's easier to learn and memorize all the languages as long as you keep talking to them in those languages. My parents are Japanese, but I was born in the US so I would speak in English outside, and at home it would be Japanese. Just make sure to also teach them how to read and write because I can't read and write Kanji that much. I really like Japan, I'm happy to see you're having fun there!", "commenter_channel_name": "@kurumibabe", "likes": 648, "date": "2 years ago", "fetched_date": "2025-01-19 14:23:58.982033", "replies_count": null, "liked_by_creator": false}, {"comment": "i love to see how much felix's character and mindset has evolved over the years this type of self growth is what makes him great", "commenter_channel_name": "@4ngeLeyes2", "likes": 533, "date": "2 years ago", "fetched_date": "2025-01-19 14:23:59.044029", "replies_count": null, "liked_by_creator": false}, {"comment": "Man I could listen to hours of this. Everything's so insightful. Makes me miss Japan more. \nLooking forward to that Camping trip if ever you vlog it. ", "commenter_channel_name": "@GLOCOgaming", "likes": 2000, "date": "2 years ago", "fetched_date": "2025-01-19 14:23:59.137035", "replies_count": null, "liked_by_creator": false}, {"comment": "14:38 Actually the sweetest thing, my heart melted. \nSo proud and happy for you two! <3", "commenter_channel_name": "@FairyOnAcids", "likes": 610, "date": "2 years ago", "fetched_date": "2025-01-19 14:23:59.204838", "replies_count": null, "liked_by_creator": false}, {"comment": "As a Half Swedish & Japanese guy I can confirm that there's a lot of similarity between the two countries. If you like camping I've found this super beautiful Bamboo forest camping spot really close to Tokyo! You should definitely check that out! (Also go to the West Tokyo doggo temple)", "commenter_channel_name": "@Dannyboi91", "likes": 1000, "date": "2 years ago", "fetched_date": "2025-01-19 14:23:59.267806", "replies_count": null, "liked_by_creator": false}, {"comment": "Congrats dude. Been a fan for a long time and its good to see you are living your best life!", "commenter_channel_name": "@BijuuMike", "likes": 1000, "date": "2 years ago", "fetched_date": "2025-01-19 14:23:59.333200", "replies_count": null, "liked_by_creator": false}, {"comment": "Talking about the similarities between Scandinavian and Japanese interior design: there's a style called \"Japandi\" and it's literally a mix between Scandinavian and Japanese elements and aesthetics. It includes a lot of wood for a peaceful and minimalistic atmosphere", "commenter_channel_name": "@JadeMercury", "likes": 677, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:23:59.377821", "replies_count": null, "liked_by_creator": false}, {"comment": "\"Everything Is Amazing, I love it\"\nAs a Japanese who grew up in Japan, there are no such happy words!", "commenter_channel_name": "@degidoga", "likes": 2000, "date": "2 years ago", "fetched_date": "2025-01-19 14:23:59.422229", "replies_count": null, "liked_by_creator": false}, {"comment": "Very happy to see that you and your wife made the choice to come live out here! Being a fellow YouTuber and resident of Japan...(26 years now...Geeze time flies by fast!) I see the passion you have for this culture that I myself had at the beginning and it brings back many fond memories. Now that my children are just about grown up (Son is in Tokyo as a University student and Daughter is in High School) I have more time to pursue my content creation goals (Gaming News Podcast, ect.) Anyway hope you and your wife continue to enjoy living out here! \nBest Regards, Expat", "commenter_channel_name": "@TheArenaProductions", "likes": 50, "date": "2 years ago", "fetched_date": "2025-01-19 14:23:59.462880", "replies_count": 0, "liked_by_creator": false}, {"comment": "I’m Japanese person and I feel so happy that you like Natures and Spiritual side of Japan!\nI hope I can see you somewhere in Japan and  talk with you someday", "commenter_channel_name": "@hirobaby3900", "likes": 131, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:23:59.500458", "replies_count": 0, "liked_by_creator": false}, {"comment": "When pewds said that he would live the rest of his life with marzia it made my heart skip a beat. That was so wholesome.", "commenter_channel_name": "@jovinacastillondimacale4835", "likes": 2000, "date": "2 years ago", "fetched_date": "2025-01-19 14:23:59.550161", "replies_count": null, "liked_by_creator": false}, {"comment": "Been watching you since I was 9 years old and I’m now 19. It’s been a great 10 years man and I’m so happy to see how far you’ve come.", "commenter_channel_name": "@Oppozision", "likes": 422, "date": "2 years ago", "fetched_date": "2025-01-19 14:23:59.722302", "replies_count": null, "liked_by_creator": false}, {"comment": "I’ve been waiting since 2020 to move to Japan too and I finally made it here at the end of March! So good to finally be here! Glad you guys finally made it too. Good luck with your new lives in Japan!", "commenter_channel_name": "@saneill17", "likes": 92, "date": "2 years ago", "fetched_date": "2025-01-19 14:23:59.951215", "replies_count": 0, "liked_by_creator": false}, {"comment": "PewDiePieさん I’m really glad you stay in japan 🇯🇵ありがとう！", "commenter_channel_name": "@mogufood", "likes": 741, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:24:00.112283", "replies_count": null, "liked_by_creator": false}, {"comment": "I love how transparent and honest Felix is. We all know living as a successful YouTuber in Japan would be different than a normal foreigner working there. No need to sugarcoat the experience and create realistic expectations.\nI’m not from Japan but I visited Okinawa once and would love to visit more cities in mainland Japan or other islands!", "commenter_channel_name": "@ratrobber15", "likes": 741, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:00.186682", "replies_count": null, "liked_by_creator": false}, {"comment": "I hope your stay in Japan continues to stay amazing! I've been living in Tokyo for the past 5 years and have never had any bad experiences but I know some of my friends complain about Japan because of its reserved, conserved and traditional way of doing things. So, as long as you can find the fun parts and understand the differences of the culture/people, it's very enjoyable!", "commenter_channel_name": "@nnoahg9645", "likes": 151, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:00.252760", "replies_count": 0, "liked_by_creator": false}, {"comment": "As someone who dreams of even just visiting japan I love the vlogging content. It's nice to see other foreigners opinions on the country as a resident itself. \nAlso as someone who has followed and watched you since the Amnesia days it honestly makes me so happy to see that you're happy and how far you've come while doing the things that you want. This is what I aspire to in my own life.", "commenter_channel_name": "@xsonya1498", "likes": 231, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:00.367105", "replies_count": null, "liked_by_creator": false}, {"comment": "Concerning your children's language learning, I was in a similar situation, with  a French mother and English father but living in Portugal. \nThe way they handled it for us was:\n - we would speak with our parents in their respective language (French/English)\n - we would speak with each other (siblings) in whatever the main language of the school we were going to was\n - we would learn Portuguese at school and use it when talking to native Portuguese friends\n - (our dad also made us write short fantasy stories in English to train the language when it wasn't yet being taught at a decent level in school, and as a reward for doing it we'd be allowed to play on the PS2)", "commenter_channel_name": "@daedrakyne8881", "likes": 455, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:00.431875", "replies_count": null, "liked_by_creator": false}, {"comment": "I'm glad the team finished the build before I got hacked Glad you enjoyed it pewds, really made my day ", "commenter_channel_name": "@Jeracraft", "likes": 3000, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:00.505538", "replies_count": null, "liked_by_creator": false}, {"comment": "Hi I'm Japanese living in the UK currently. Me and my husband have decided to move to Japan, my hometown Osaka in a few years after the house contract finishes here. I am so happy that you are in there, also my husband is a big fan of you. Hope you are enjoying :)", "commenter_channel_name": "@shoamichan2669", "likes": 8, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:00.570530", "replies_count": 0, "liked_by_creator": false}, {"comment": "Those Vlogs you uploaded over the past few weeks really make me wanna go to Japan even more! Those are perfect for filling the gap while waiting to finally get there. \nKeep it up pewds!", "commenter_channel_name": "@Luigikid", "likes": 453, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:00.628887", "replies_count": null, "liked_by_creator": false}, {"comment": "pewdiepie may or may not of used his channel analytics before moving to Japan lmao\n\n\n\n\n\nI like waffles.", "commenter_channel_name": "@Foodies", "likes": 4000, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:24:00.686094", "replies_count": null, "liked_by_creator": false}, {"comment": "Best case scenario for their Child / Children would be to talk Italian when they’re alone with Marzia, Swedish when alone with Felix and English when talking to both of them. Japanese then could be easily learned due to them using it in school I guess", "commenter_channel_name": "@CoraLuna", "likes": 214, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:00.744115", "replies_count": null, "liked_by_creator": false}, {"comment": "As someone who lives in Asia, speaking English to a foreigner is actually not racist, it’s quite the opposite. We are trying to be accommodating since most foreigners we encounter just don’t speak our first language. We go the extra mile to learn and speak English  just to interact with the other party and make them feel comfortable. It’s quite a cultural shock how foreigners would think that’s offensive", "commenter_channel_name": "@browsing3123", "likes": 79, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:24:00.804029", "replies_count": null, "liked_by_creator": false}, {"comment": "One of the things I like about Japan was their aesthetic in the cities. The cities themselves are kept quite clean and they always find ways to add nature to their cities. Small detailed gardens, rocky walls, trees, small shrines, etc. Hard to explain but it's feels like a lot of compact detail while being natural and minimalistic. It's quite nice.", "commenter_channel_name": "@Nil-js4bf", "likes": 174, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:24:00.863313", "replies_count": null, "liked_by_creator": false}, {"comment": "I really love felix's constant smiling. I'm so happy for him that they got to japan. Ever since he arrived, he always gives off so much positive energy.", "commenter_channel_name": "@mizukii0781", "likes": 129, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:00.927883", "replies_count": 0, "liked_by_creator": false}, {"comment": "We love the vlogs Felix! Looking forward to more!", "commenter_channel_name": "@hecker69", "likes": 1000, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:00.993558", "replies_count": null, "liked_by_creator": false}, {"comment": "Thank you for doing vlogs in Japan. It was in my plans to be living in Japan starting last year, but I've been bedbound for three years now, permanently disabled. My health should improve, but I don't know if I'll ever get to live on my own, finish my Japanese degree, or go to the country. It's so nice to see you enjoy it!! It's a bit scary to think my dreams might have to change or how difficult and long the process might be, but for the first time in three years, I'm not avoiding images or videos of Japan. I'm starting to smile about it again, and I hope it can turn into extra motivation to get back my life I lost. I don't know if I can thank you for all that lol, but thank you for giving me these videos. <3", "commenter_channel_name": "@dorkasaurus.gretch", "likes": 66, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:01.052302", "replies_count": null, "liked_by_creator": false}, {"comment": "Japan is a dream for so many of us. Hard work pays off. Congrats!", "commenter_channel_name": "@Stealth", "likes": 865, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:01.119127", "replies_count": null, "liked_by_creator": false}, {"comment": "I didnt realize you were full blown moving to Japan. Absolutely amazing choice and opportunity. Congrats!!!", "commenter_channel_name": "@DOITWITHDAN", "likes": 2000, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:01.175865", "replies_count": null, "liked_by_creator": false}, {"comment": "My son and I are currently learning Japanese. It’s been hard. What we’ve been doing is learning phrases that we normally say to each other and just slowly expanding from there. And it is a very fast spoken language.", "commenter_channel_name": "@MetaSiren", "likes": 166, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:01.219422", "replies_count": null, "liked_by_creator": false}, {"comment": "ありがとうThank you！", "commenter_channel_name": "@%E3%83%87%E3%82%B9%E3%82%BF%E3%83%BC-e1p", "likes": 6, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:01.263085", "replies_count": 0, "liked_by_creator": false}, {"comment": "Watching since the begin and i can say the vlogs from japan is the greatest ever, if you and marzia dont mind about it, please continue sharing your perspective there and how it's to live in what it seems to be the greatest country ever! One day i will move to there too, Hugs from portugal!!", "commenter_channel_name": "@ruiguia", "likes": 267, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:01.317323", "replies_count": null, "liked_by_creator": false}, {"comment": "so crazy coming back to the channel every once in a while to see how much you guys have grown - feels like having a catch-up call with an old friend when watching these vlogs. no shade toward brighton but as someone who used to live in japan this must've been a big step up, especially because like you said, you get recognised less in a non-english speaking country. it's amazing seeing you enjoy your life so much, i do remember certain times where it was clear that depression was hitting you hard and things were frustrating you. you look so happy here :) enjoy your new life in japan, you deserve it felix <3", "commenter_channel_name": "@Epicwolf-ew7ig", "likes": 499, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:01.361445", "replies_count": null, "liked_by_creator": false}, {"comment": "If you like learning about the history of Japan I would really recommend 'The Autobiography of Yukichi Fukuzawa'. It's really exciting/intense and you get to really understand how Japan became modernized after the feudal period.", "commenter_channel_name": "@JM-tp3ov", "likes": 370, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:01.402860", "replies_count": null, "liked_by_creator": false}, {"comment": "The thing that makes me the happiest when watching your recent videos, and particularly your vlogs and the ones where you talk about your new life there, is how happy you seem. As a long-time subscriber, I've been watching you since I can remember myself watching Youtube, so I've seen you go through various life stages, but this time you really seem to be glowing. Wish both you and Marzia the best <3", "commenter_channel_name": "@irenepst", "likes": 106, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:01.445801", "replies_count": null, "liked_by_creator": false}, {"comment": "\"you think it's your own choice but in reality you make it for someone else\" - That's really deep Felix.\n\nTwo things happened to me: My mom really want me to become an architect and I become one. The second one is my friends getting married after graduation and I want to get married too in fear of missing out. Although I have changed my mindset on marriage because my spouse and my son really brings me happiness, but being an architect always bring me into depression and sleepless nights. The pay is decent and helps me to pay my bill but I'm not happy working as an architect. I'm in my early 30's now and I'm planning to find jobs or careers that I'm happy of. I've always wanted to be a public speaker or involve in performance on stage because I feel I can be myself on stage despite I have fear of speaking in front of public. Wish I can make this a reality one day, and hope you have a great time in Japan.", "commenter_channel_name": "@gigibiru913", "likes": 84, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:01.486863", "replies_count": null, "liked_by_creator": false}, {"comment": "As a fellow Swede who has lived in Japan as well I want to add my two cents on two topics.\n\n1. Eating at a friends house: \nAs Felix said, it is weird to me as well that the person didn’t even get asked. From my own experience and my friends experience we always got asked if we were going to eat at our friends place and if it was panned beforehand it was a given that we would eat there. \n\n2. Learning Japanese: \nI learned to speak quite good Japanese in about a year. I could have conversations and even do more administrative stuff all in Japanese. \n\nIf the goal is speaking Japanese the best tip I would give is to just force yourself to speak Japanese and to not care if your sentence is right or wrong. More often than not they will understand and you’re also, in my experience, usually close to, if not, correct in your sentence as well. This will also help you remember and learn how to use the words you’ve studied or heard.", "commenter_channel_name": "@tigerchuu2148", "likes": 51, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:24:01.533838", "replies_count": 0, "liked_by_creator": false}, {"comment": "Years of watching him, supporting the most amazing people is such a satisfying thing to see is how they accomplished their goal🫶", "commenter_channel_name": "@bellast5161", "likes": 739, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:01.580056", "replies_count": null, "liked_by_creator": false}, {"comment": "Japan has been an amazing experience thus fare. We know you will have many amazing experiences. Get out and explore. We look forward to seeing what you do.", "commenter_channel_name": "@KawaiiArcadeMasters", "likes": 1000, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:01.621045", "replies_count": null, "liked_by_creator": false}, {"comment": "My aunt is from Japan and her and I get along really well. I love her different outlook on things. It’s extremely interesting to hear her talk about the way she was raised and the overall culture compared to life here in America.", "commenter_channel_name": "@staciemae", "likes": 20, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:24:01.678457", "replies_count": null, "liked_by_creator": false}, {"comment": "Great Q&A! I learned so much about why you like Japan! Yes I think many people want to know the one reason why you like it, but you usually like somewhere for many reasons, not just one! ", "commenter_channel_name": "@MrsEats", "likes": 795, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:01.724645", "replies_count": null, "liked_by_creator": false}, {"comment": "A method of learning Japanese you could try (assuming you haven't) is watching livestreams since you said that you were surprised at how fast Japanese people speak in Japan. I've found it a lot easier to recognize words and phrases how they naturally are said from opposed to watching anime where it is a lot slower and more exaggerated. I've found myself passively translating what they say during live streams in my mind even if I'm watching it in the background.", "commenter_channel_name": "@grandpa-30", "likes": 406, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:01.766975", "replies_count": null, "liked_by_creator": false}, {"comment": "14:32 I expected him to say \"Staying alive\" but him saying \"Staying with marzia\" came out of nowhere my heart can't", "commenter_channel_name": "@nat2057", "likes": 52, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:01.808598", "replies_count": 0, "liked_by_creator": false}, {"comment": "Congratz, y'all!  I'm loving the Japan 2022 vlog series so far. The music in itself is awesome. \nSide note, I saw another YouTuber (iirc, it was Martina \"KingKogi\") mention this in one of their more recent videos. Not to scare you, but don't forgot to earthquake proof your shelves when possible! I think it's like simple bars (protection bar holds) that you place between the ceiling and the shelf to keep it from toppling over.", "commenter_channel_name": "@rotenhoko", "likes": 44, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:01.849860", "replies_count": 0, "liked_by_creator": false}, {"comment": "Whatever progress you made in learning japanese is amazing. I've been studying it for 6 years as my major, and still struggle with it. Nothing to be bashed for besauce it's a difficult language to tackle for us westerners.. Once you get involved into everyday life in Japan you will start picking up japanese more easily for sure :)", "commenter_channel_name": "@ARMY_ksoo", "likes": 133, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:01.889206", "replies_count": null, "liked_by_creator": false}, {"comment": "As you said, Japan and Scandinavian share similar mind and aesthetics. Nature love based lifestyle, simplistic, quiet and peace. There is even a word \"Japandi\" that means Japan x Scandinavian in interior field.", "commenter_channel_name": "@HM-kc4ky", "likes": 271, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:01.931813", "replies_count": null, "liked_by_creator": false}, {"comment": "For me, the funniest part about Japan (at least, Tokyo), was how much sticklers they are for the rules, but at the same time, they can be pretty pedantic about it when needed.  When a friend of mine was renewing his visa, there was some sort of issue that required him staying at the gov bldg for the entire day while the staff tried to figure out a solution.  Finally, at the end of the day, a member of the staff approached him with a judge by his side and two sets of paper in his hands and carefully stated \"Your visa has been rejected.\"\nMy friend was both surprised and worried about what was about to happen, but he could tell something was up.  The Japanese staff member repeated \"Your visa has been rejected.  Would you like to appeal?\"  The last part said with a miniscule lilt in his voice and a very tiny tilt of his head toward the judge.  My friend, utterly bemused, nodded.  The judge spoke a single word \"Approved\" and left.  The staff member withdrew the rejected visa and handed my friend the other set of papers, including his newly approved visa, smiled politely, and left as well.", "commenter_channel_name": "@aquatus1", "likes": 336, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:01.980629", "replies_count": null, "liked_by_creator": false}, {"comment": "日本に来てくれて、ありがとういろいろ大変な手続きとか多いけど、楽しんで下さい️", "commenter_channel_name": "@%E3%82%88%E3%81%AD%E3%82%86%E3%83%BC-w5m", "likes": 92, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:02.023175", "replies_count": 0, "liked_by_creator": false}, {"comment": "It feels nice watching you since like 2013 and seeing you grow as a person. Thinking of myself sitting down and watching a pewdiepie skate 3 funtage or something feels so weird, because I've grown so much aswell. You've been an inspiration and you continue to be one to me.", "commenter_channel_name": "@BUHL3RR", "likes": 46, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:02.065523", "replies_count": 0, "liked_by_creator": false}, {"comment": "That’s awesome!!! Glad to hear about a spiritual side of Japanese culture from you. I hope you two enjoy living in Japan.  Watching your vlogs make me wanna go back to Japan ", "commenter_channel_name": "@HarukiAnoku", "likes": 1000, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:24:02.107632", "replies_count": null, "liked_by_creator": false}, {"comment": "My favourite part about Japan when I went was being out in the forests and temples. It is extremely peaceful and calm feeling, I understand why Felix would move there just for that", "commenter_channel_name": "@Mythikal13", "likes": 127, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:02.151058", "replies_count": null, "liked_by_creator": false}, {"comment": "日本に来てくれてありがとう日本での生活楽しんでください！応援しています！", "commenter_channel_name": "@KT-mf8gr", "likes": 35, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:02.191444", "replies_count": 0, "liked_by_creator": false}, {"comment": "Felix, I remember watching your videos when i was young,  i was immature, loud and obnoxious, just as you were in your younger days. I am now more mature and have grown as a person just as you have. It makes me really happy watching your Japan videos and seeing how much you’ve grown as a person. I have always wanted to live in Japan, but i was nervous that i wouldn’t fit in because of how i present myself and my behavior. But i believe in myself seeing how formal you’ve become and how happy you seem. Thank you for inspiring me.", "commenter_channel_name": "@the_amazin_asian2324", "likes": 102, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:02.233296", "replies_count": 0, "liked_by_creator": false}, {"comment": "I can tell he actually likes opera and uses it which is why he was happy to do the sponsor. I’ll definitely give it a try I was a google guy my whole life but since they sold out they lost my respect and I did use opera in the past and I liked it", "commenter_channel_name": "@DirtCobaine", "likes": 263, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:02.275094", "replies_count": null, "liked_by_creator": false}, {"comment": "The ending of this resonates well. Congratulations to you and Marzia on your move to Japan. I hope you two enjoy your stay there and get to relax a little. I can't understand what it's like to be famous, but I imagine that it's therapeutic that you can, finally, relax and go outside of your home on a stroll and not worry about being bombarded by fans.", "commenter_channel_name": "@zvjezdanveselinovic5765", "likes": 90, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:02.321006", "replies_count": null, "liked_by_creator": false}, {"comment": "A very heartwarming and encouraging journey. Loads of unknowns awaiting, together with frequent anxiety and frustration, yet you just go for it step by step. That really soothes everything. It reminds me of how I can go on with my life. Especially viewing the changes you've made all these years. A real companion.", "commenter_channel_name": "@JennyYi29", "likes": 17, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:02.375788", "replies_count": 0, "liked_by_creator": false}, {"comment": "so happy for pewds, he helped me get through tough times.\nseeing him happy makes me happy", "commenter_channel_name": "@ebi3954", "likes": 122, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:02.433070", "replies_count": null, "liked_by_creator": false}, {"comment": "Thank you so much for acknowledging that your experience of living in Japan is not representative of what everyday life would like for most immigrants. I absolutely love your vlogs and they make life there look so exciting, so this reality check is helpful to not get overly enthusiastic and make a move that I could very easily regret. Not everyone can just buy a house, buy a car and spend the majority of time wherever and with whomever they want to. Most of us would probably be stuck in some sort of office from morning to evening and would struggle to have a pet etc. Thank you for keeping a clear head and not losing touch with reality!", "commenter_channel_name": "@annawagner7774", "likes": 667, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:02.480994", "replies_count": null, "liked_by_creator": false}, {"comment": "For real, the Japan vlogs have been so relaxing and enjoyable and well edited. It’s so great to see you thriving!!!", "commenter_channel_name": "@Indianadixon", "likes": 65, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:02.521608", "replies_count": 0, "liked_by_creator": false}, {"comment": "You look happier.  Enjoy Japan e saluta Marzia! I follow you since you weren’t yet the biggest youtuber and it’s nice to see you’re doing well.", "commenter_channel_name": "@Rikachan92", "likes": 8, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:02.562532", "replies_count": 0, "liked_by_creator": false}, {"comment": "Living the dream bro! I'll be on my way to Japan as well soon enough ", "commenter_channel_name": "@RadicalLiving", "likes": 277, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:02.612360", "replies_count": null, "liked_by_creator": false}, {"comment": "These vlogs are so laid-back! It gives a really nice feel to them, and this content-style fits you really well. Also, to people who keep saying \"Why Japan,\" why wouldn't you move to Japan? Japan is like a dream come true, at least for me.", "commenter_channel_name": "@menher%C3%A6-chan", "likes": 67, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:02.677485", "replies_count": 0, "liked_by_creator": false}, {"comment": "As a Japanese viewer it really does make me happy to hear that he enjoys our country. Its got its flaws for sure and Im sure he knows but much love Felix thanks for showing us some love.", "commenter_channel_name": "@williamtaylor5109", "likes": 149, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:02.950862", "replies_count": null, "liked_by_creator": false}, {"comment": "first time here.  PewDiePie makes even commercials interesting.  New subscriber.  Love that you love Japan.", "commenter_channel_name": "@idee7896", "likes": 4, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:03.102063", "replies_count": 0, "liked_by_creator": false}, {"comment": "\"..You think it's your own, choice but in reality you made it for someone else and that's how you end up living your life without even realizing it.\"\n\nThat was damn relatable. \n\nAnyway, everytime you say you're glad to finally be in Japan, I can't help but be happy for you as well. \n\nWish you and Marzia all the best! We're really happy for you! ️", "commenter_channel_name": "@danielcheese__", "likes": 164, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:24:03.152959", "replies_count": 0, "liked_by_creator": false}, {"comment": "I almost cried when pewds answered the last question, I hope I can live my life the way I want it to.", "commenter_channel_name": "@zyra7275", "likes": 58, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:03.199883", "replies_count": 0, "liked_by_creator": false}, {"comment": "Haha, I 100% agree with the language part; I've been learning Korean and I can confirm that it is NOTHING like learning another European language. There are no similarities, not grammaticaly or vocabulary wise, so you literally start from zero which is learning the alphabet and it's a slow, uphill struggle after that but like you said: it is fun! Keep going and good luck!", "commenter_channel_name": "@DorieBee-BARElynecessary", "likes": 506, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:24:03.258247", "replies_count": null, "liked_by_creator": false}, {"comment": "Both my parents are from different countries so I grew up learning both of them, add two more languages in school plus another one of pure interest and you got a kid who speaks a lot of languages! It’s not as hard as you think and if you’re a child you pick up languages like it’s the easiest thing in the world", "commenter_channel_name": "@meepmeep1498", "likes": 23, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:03.306077", "replies_count": null, "liked_by_creator": false}, {"comment": "It's so interesting to listen to people talk about them being 18 as if it was aaages ago, and here I am, listening to them as a 18 year old, and it really gives me hope that I'm not that old yet and have so much time to improve, grow and start new things & live my life without a hurry. Really settles me to a much more comfortable mindset, cuz I'm constantly worried and anxious about time flying by too quick. Watching people like Felix, Mrbeast and other good creators helps me to distract myself from bad thoughts and motivates me to just keep going and also having fun along the way :))\n\nedit: thank you guys so much for all the sweet words in the replies, I'm reading it all and lowkey getting emotional, since I didn't expect to get this much support today. I was having a rough time but yall cheered me up so much, so thank you a lot!!", "commenter_channel_name": "@MelanieMN", "likes": 277, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:24:03.355792", "replies_count": null, "liked_by_creator": false}, {"comment": "I'm really enjoying your Japan videos. Maybe this can help you with \"multi-language child\" question, but my son was raised speaking 4 languages, so it's fine if your kids are going to be raised speaking, Japanese, Swedish, Italian and English, it all works out in the end.", "commenter_channel_name": "@alexstrolls801", "likes": 105, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:03.398056", "replies_count": null, "liked_by_creator": false}, {"comment": "It is sad that us in the UK, an Island nation, are good at once singular fish dish", "commenter_channel_name": "@Patterrz", "likes": 364, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:03.439907", "replies_count": null, "liked_by_creator": false}, {"comment": "So lucky wish I can move to Japan too 🥹 looking forward to more Japan vids!!", "commenter_channel_name": "@VannieEats", "likes": 33, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:03.478475", "replies_count": 0, "liked_by_creator": false}, {"comment": "I lived in Japan for 3 years, and I can confirm that EVERYONE is just super nice. Even if they don't like you or mean it, almost every single interaction you have with someone is nice and pleasant. Also, Japanese people WILL try to speak to you in English because many of them have spent years in school trying to learn English. So when they see a foreigner, they will often try to spark up a conversation to practice their skills. In their language schools, they are actually encouraged to do this. They 100% mean well and are not trying to be rude.\n\nAlso as a white person in Japan, I noticed immediately that I was getting a bunch of stares. In Japan, most people like to stick to their own bubbles. So if you are on a train or public area, most Japanese people just want to be left alone and stay in their own corner. So if you are someone that is shy, or like your privacy, Japan is the perfect place to live. Despite that, I had so many experiences of Japanese people being super excited to talk to me because I was white. My wife who has blond hair and blue eyes also got similar treatment. \n\nIt's hard to explain, but they almost treat you like a doll. Like OMG, its that person from HOLLYWOOD movies and WESTERN CULTURE. Unlike many Western nations, Japan is 99% homogenous. I'm not lying when I say, I went a week sometimes not seeing another white person in certain areas of Tokyo. So if you are white, you stick out like a sore thumb, especially on public trains. So expect to get stares, even if you arent famous.", "commenter_channel_name": "@mewgiah8057", "likes": 81, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:24:03.519465", "replies_count": null, "liked_by_creator": false}, {"comment": "I just moved to japan with my wife to be closer to her family, but there is definitely more than one thing to love about this country. Felix inspired me to make more content about my life here and I am about to post one about the ugly box cars haha", "commenter_channel_name": "@jamesricks", "likes": 79, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:03.567115", "replies_count": null, "liked_by_creator": false}, {"comment": "the most fun to watch videos are always the ones that you had the most fun making. happy for you guys and glad you're enjoying everything!", "commenter_channel_name": "@rossmbrock", "likes": 21, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:03.702720", "replies_count": 0, "liked_by_creator": false}, {"comment": "I feel the same way about people asking if you're fluent when you're learning a language. I study Japanese and Spanish and I get asked that all the time by friends, and I never really know how to answer. No matter how much you study, it's hard to be quite fluent until you're in an environment where you're surrounded by that language all the time. With that said, you should catch on to the Japanese very quickly now! :) がんばってください！", "commenter_channel_name": "@SurlyGirl12", "likes": 9, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:03.817379", "replies_count": 0, "liked_by_creator": false}, {"comment": "It's legitimately sweet how much you're willing to say about Marzia. It might be a stretch to put things out there since we barely know the both of you, but seeing you grow while she's stuck with you throughout, perhaps even mellowing you down at times, it's very sweet. Hope you live the rest of your life with Marzia :')", "commenter_channel_name": "@%D0%9F%D0%B8%D0%BD%D0%B0%D0%B3%D0%BE%D0%B4", "likes": 251, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:24:03.883223", "replies_count": null, "liked_by_creator": false}, {"comment": "I will never get tired of watching felix and his journey into the future, this japan move is a new beginning for all of us :)", "commenter_channel_name": "@Egirl_Slayer", "likes": 372, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:03.944366", "replies_count": null, "liked_by_creator": false}, {"comment": "Lifting, reading and loving Marzia. All good ways to spend a lifetime.", "commenter_channel_name": "@KateAtNight", "likes": 458, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:04.003136", "replies_count": null, "liked_by_creator": false}, {"comment": "I live in Japan too, is a lovely place, hope you enjoy every part of it", "commenter_channel_name": "@navarro8842", "likes": 4, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:04.063303", "replies_count": 0, "liked_by_creator": false}, {"comment": "I lived in Japan for 4 years and absolutely loved it. I hope to live there again for another 3-4 years before retirement at which point I'll settle back down in the U.S.\n\nI know you'll probably never see my message, but I would highly recommend visiting Okinawa. Very nice, slow paced, southern island. It was explained to me as Japan's Hawaii.", "commenter_channel_name": "@joshuaparrish1505", "likes": 55, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:24:04.130142", "replies_count": null, "liked_by_creator": false}, {"comment": "I am still pondering the fact that such happiness can be achieved by watching someone else achieve what they have been trying for so long.", "commenter_channel_name": "@TheLordXanax", "likes": 112, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:04.186761", "replies_count": null, "liked_by_creator": false}, {"comment": "14:31 Daaamn Pewds... what a gigachad answer!", "commenter_channel_name": "@daviddamasceno6063", "likes": 20, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:04.247977", "replies_count": 0, "liked_by_creator": false}, {"comment": "Love all the Japan content! It's so fun to see all your little adventures!", "commenter_channel_name": "@saranoel5692", "likes": 6, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:04.306937", "replies_count": 0, "liked_by_creator": false}, {"comment": "Pewから、日本愛を感じました♪　嬉しいです、日本のすばらしさを発信してくれるの楽しみにしてます。", "commenter_channel_name": "@risa474", "likes": 8, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:04.373456", "replies_count": 0, "liked_by_creator": false}, {"comment": "Multi lingual kids are interesting. My cousin's pretty much quit speaking Japanese when they went to school in the US. But they still understand their mom perfectly when she speaks Japanese. Idk what would happen if you throw more languages into the mix. I have heard of kids mixing languages before they get old enough and realize there are separate languages. Which is cute.", "commenter_channel_name": "@Animefreak-rb3vy", "likes": 183, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:04.418437", "replies_count": null, "liked_by_creator": false}, {"comment": "24:11 \nit's absolutely great if you will speak japanese, english, swedish, and italian with your kids in the future. there is no need to worry for them bcs kids learn faster than adults, as we adults are using our left brain which is an analytical and logical when learning new things or language, but kids use the right and left part of their brain which makes it easier for them to adapt anything quickly.", "commenter_channel_name": "@xeeeun5794", "likes": 18, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:04.467111", "replies_count": 0, "liked_by_creator": false}, {"comment": "Please do an UPDATE QnA! i would love to hear great questions and answers after living in japan for over a month or two!", "commenter_channel_name": "@kjashdjas", "likes": 2, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:04.508672", "replies_count": 0, "liked_by_creator": false}, {"comment": "I still can't believe you are living in Japan! It's exciting just to think that there is a possibility that I could meet pewdiepie somewhere, but that time will probably never come (except for events, etc)", "commenter_channel_name": "@anmananmananman", "likes": 14, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:04.549212", "replies_count": 0, "liked_by_creator": false}, {"comment": "You inspire all of us pewds!", "commenter_channel_name": "@GameEvolutions", "likes": 224, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:04.590036", "replies_count": 0, "liked_by_creator": false}, {"comment": "PewDiePie！！！\"Enjoy your stay in Japan!\"\n日本に来てくれてありがとう🇯🇵", "commenter_channel_name": "@Ryota_0629", "likes": 11, "date": "2 years ago", "fetched_date": "2025-01-19 14:24:04.630803", "replies_count": 0, "liked_by_creator": false}, {"comment": "日本に来てくれて、日本を楽しんでくれて、日本人として嬉しいです🫶", "commenter_channel_name": "@a623", "likes": 5, "date": "1 year ago", "fetched_date": "2025-01-19 14:24:04.785924", "replies_count": 0, "liked_by_creator": false}], "related": []}