{"code": "GPLImB-I71w", "title": "I Drew Every Day for 365 Days..... *it was painful*", "url": "https://www.youtube.com/watch?v=GPLImB-I71w", "thumbnail_url": "https://i.ytimg.com/vi/GPLImB-I71w/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLDrz9Rgg0H57x6o1i9Llk2MlN0muA", "views": 5000000, "likes": 397000, "duration": 1011, "embed_code": "https://www.youtube.com/embed/GPLImB-I71w", "uploaded_date": "29 Oct 2024", "comments_count": 12329, "comments": [{"comment": "Here's the article I wrote in case some of you want more details:\nhttps://the-kjellberg-mail.beehiiv.com/p/i-drew-every-day-for-a-year", "commenter_channel_name": "@PewDiePie", "likes": 3000, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:50.368712", "replies_count": null, "liked_by_creator": false}, {"comment": "He's even hit the point where \"the more you learn, the more you realize you don't know much\", that's so good lol", "commenter_channel_name": "@KimiOmega", "likes": 1000, "date": "1 month ago", "fetched_date": "2025-01-19 13:12:50.405707", "replies_count": null, "liked_by_creator": false}, {"comment": "\"I'm never gonna draw this good ever again\" feeling is all too familiar for us artists pewds, great job sticking it for a year man!", "commenter_channel_name": "@nicksuperheroart", "likes": 51000, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:50.456969", "replies_count": null, "liked_by_creator": false}, {"comment": "There's something so humbling about this. Taking one step forward and simultaneously three steps back, but still keeping at it... So happy to see Felix continuing this series :,)", "commenter_channel_name": "@mel4416", "likes": 23000, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:50.494600", "replies_count": null, "liked_by_creator": false}, {"comment": "Im 22, 0 art experience ever, and I just ordered a drawing tab for digital art. Thank you for this vid, it was the last push I needed to jump for it", "commenter_channel_name": "@jamilawada389", "likes": 654, "date": "1 month ago", "fetched_date": "2025-01-19 13:12:50.531813", "replies_count": null, "liked_by_creator": false}, {"comment": "11:47  The “in my head it was so much more” hits hard. It reminds me of this one art video I watched that explains how our ability to analyze art develops faster than our ability to create art. It’s probably why it’s so hard to see our own improvement.", "commenter_channel_name": "@liesl5313", "likes": 8000, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:50.568318", "replies_count": null, "liked_by_creator": false}, {"comment": "\"This is still better\" about the thing you did months ago is a perfect summary of what progress can be like sometimes! lol You can always see new mistakes as you learn more.\n\nStoked to see you keep at it,  man!", "commenter_channel_name": "@ProkoTV", "likes": 2000, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:50.610281", "replies_count": null, "liked_by_creator": true}, {"comment": "So glad this series is continuing, great job Felix.", "commenter_channel_name": "@MidosujiSen", "likes": 32000, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:50.653289", "replies_count": null, "liked_by_creator": false}, {"comment": "Love to see it PewdieTry! Keep at it, I would suggest taking a life drawing class. It will help out immensely with poses/body anatomy <3", "commenter_channel_name": "@iHasCupquake", "likes": 381, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:50.695407", "replies_count": null, "liked_by_creator": false}, {"comment": "As an artist who has been burnt out for a few years, this truly warmed my heart and re-sparked something in me. Truly, thank you Felix", "commenter_channel_name": "@Pumpkin_Gutss", "likes": 3000, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:50.732825", "replies_count": null, "liked_by_creator": false}, {"comment": "I started seriously drawing as a 28 y/o man, after quitting my server job. The first years were rough but now I'm 35, a professional fantasy illustrator. It is never too late to start\n\nEdit: I'm so happy to hear my personal story inspired so many artist out there. It warms my heart", "commenter_channel_name": "@maximilianomoretto258", "likes": 16000, "date": "2 months ago (edited)", "fetched_date": "2025-01-19 13:12:50.771179", "replies_count": null, "liked_by_creator": false}, {"comment": "11:39 \"I looked at it so much now it just pisses me off\" felix just made every artist who tried to execute a grand idea and had middling results hard relate", "commenter_channel_name": "@nubnce5705", "likes": 5000, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:50.808946", "replies_count": null, "liked_by_creator": false}, {"comment": "can't wait for the next video \"i spent 365 days learning animation\"\n\nit feels like a great way to progress with the things he mentioned. it'll be great for learning anatomy, plus it's great for drawing things you wouldn't normally. alot of us get in a loop of drawing what we like, pewds with anime girl and me with futuristic cars or eyes, but animation has a way of breaking you out of that comfort zone by making you draw whatever the scene needs.", "commenter_channel_name": "@cXspXr", "likes": 72, "date": "2 months ago (edited)", "fetched_date": "2025-01-19 13:12:50.844795", "replies_count": null, "liked_by_creator": false}, {"comment": "as a profesional artist, im so proud of you Pewds!! \nThe next step I can recomend you to try is take references irl. for example the hands: (which i assure you, 99% of artists have trouble with) ask someone, maybe martzia to do the pose you have in mind and recreate it in your style. it doesnt have to be realistic or shaded or anything, just understand the basic shape of the pose. that will help you a ton with anatomy!", "commenter_channel_name": "@GaelRice", "likes": 8000, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:50.882732", "replies_count": null, "liked_by_creator": false}, {"comment": "8:53 that full bodied one is seriously good. The anatomy, linework, soft coloring and everything. That might actually be the best one for me", "commenter_channel_name": "@moditb3247", "likes": 4000, "date": "2 months ago (edited)", "fetched_date": "2025-01-19 13:12:50.920924", "replies_count": null, "liked_by_creator": false}, {"comment": "I really LOVE when you draw buildings 7:18 it just has a really cozy vibe to it and I feel like you're already having some sort of personal style", "commenter_channel_name": "@jil8091", "likes": 1000, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:50.959837", "replies_count": null, "liked_by_creator": false}, {"comment": "I deeply appreciate this video, I've been drawing since I was 6, and around my teenage years I slowly lost touch in it, it became so boring, I can literally draw anything, I've become so numb of the feeling of drawing something, sorta how Saitama felt about fighting. I am 31 now. The emotions you've gone through this process is the feeling I miss the most and seeing someone go through the ups and downs of improvement made me feel happy. I might just get back to Drawing again one day, thanks to you.", "commenter_channel_name": "@vrnhdt", "likes": 36, "date": "2 months ago (edited)", "fetched_date": "2025-01-19 13:12:50.997763", "replies_count": null, "liked_by_creator": false}, {"comment": "@PewDiePie Bro, the “Am I allowed to be happy?” hit so hard. You’ve improved so much at so many things over the course of the year, it’s truly inspiring. Your final pice looks absolutely fantastic, but even if it didn’t, you’ve gotten so much better at anatomy, perspective, drawing actual boys, even your landscapes look insane man! It’s unbelievable progress for a year and I truly believe you should be proud. \nI know your job kind of requires others validation, but putting that on hold for a sec, I hope you can come to see just how far you’ve come from when you started and be happy man, because you deserve it.", "commenter_channel_name": "@Ns-uo2um", "likes": 1000, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:51.036223", "replies_count": 0, "liked_by_creator": false}, {"comment": "In my 33 years drawing (I'm 41 by the way), I never had a year so full of experiences like you did Pewds.\nEven if you think you can't see the evolution, you went from through s lot. Drawing by yourself, watching tutorials, actually learning from books, even learning perspective (my nightmare....), and you even went for the digital art.\nYou've accomplished so much, and I think all other artists here can see that, and we are all happy and proud of you.", "commenter_channel_name": "@MagodoCaos1", "likes": 1000, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:51.071565", "replies_count": null, "liked_by_creator": false}, {"comment": "This series gives me so much hope as someone who is also trying to improve at art later in life in a world where most artists start as kids, I'm doing this journey with you man, love to see your progress!", "commenter_channel_name": "@BlueJayYT", "likes": 1000, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:51.106911", "replies_count": null, "liked_by_creator": false}, {"comment": "PewDiePie, thank you so much for inspiring me with this video. When I watched your 100 days of drawing video, I really thought about the reasons I never could be consistent with art in my life. Watching you just simply go at it changed my perception about how I could approach my art and I thought “What would happen if I really tried to do the same 100 days challenge?” And I tried it. I met a lot of struggles at first, but I kept at it. Today, I’m proud to say that I’ve reached the 100 days milestone and I plan on making this a part of my daily life from now on. I am grateful to have been inspired by you and other amazing artists. I wish you all the best and thanks again!", "commenter_channel_name": "@JonathanTran07", "likes": 13, "date": "1 month ago", "fetched_date": "2025-01-19 13:12:51.140632", "replies_count": 0, "liked_by_creator": false}, {"comment": "Your digital piece for the 365th day was incredible. Not just the drawing, the rendering was amazing. Thank you for sharing this, it can be weirdly vulnerable to share art.", "commenter_channel_name": "@iinkstain", "likes": 1000, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:51.176047", "replies_count": null, "liked_by_creator": false}, {"comment": "9:04  \"going through the pain of sucking again\"  is the most genius art advice there ever will be!! \nBecause to grow and improve is literally that! \nSo many people lose heart when they improve because of that pain but its part of it and you have to change the mindset of it or be depressed untill it looks a little better than before. \n\nYou are doing a great job Felix! Good work, keep going!!", "commenter_channel_name": "@stephquest315", "likes": 1000, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:51.213092", "replies_count": null, "liked_by_creator": false}, {"comment": "As an artist, seeing you jump from colour to linework and back  to colour and then to digital was so so impressive!!! Colour is a completely other beast and the processes of paper and digital drawing are completely different in my oppinion and you did very good! But the brush marker black-and-white Blame drawings were simply amazing! Your urge to always learn more has always been so inspiring to me, Felix:)", "commenter_channel_name": "@adsok7046", "likes": 673, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:51.247919", "replies_count": null, "liked_by_creator": false}, {"comment": "I guess I'll leave this comment here just because I now felt I needed to say this, even though you might not see it. \n\nFelix, you have been one of my biggest inspirations ever since you used to play a lot of horror games still. Watching these \"I drew everyday for X days\" made me pick up art again, and I really challenged myself to draw every single day despite the struggles that comes with being a college student. It was arguably much harder for me to even manage my time properly, but I could've never had the courage and motivation to do something I thought I WAS good at but started again at scratch, if it wasn't for your drawing videos. My biggest enemy was myself, until you showed me the light to guide the way.\n\nI really thought 100 Days was a good stopping point, but you continued because you loved to make more and improve. And now whenever I'm down, I am reminded of the reason why I started and that progress is always slow but honest. It's currently Day 54 for me, but I'm already reaching levels I never thought I was able to reach.\n\nYour winning so much in life Felix, and I hope you'll continue to do what you do best: being an inspiration to everyone else. Thank you so much... seriously, and I'd love to see you continue making more art in the future! I wish you and your family all the best!", "commenter_channel_name": "@asterialumi.", "likes": 17, "date": "1 month ago", "fetched_date": "2025-01-19 13:12:51.283810", "replies_count": null, "liked_by_creator": false}, {"comment": "One quote I heard that I think is great for all creative ventures is, \"Art isn't a leaderboard.\" \n\nThat makes it so much easier for me to write knowing the stories are just different, not necessarily that one is better than the other.", "commenter_channel_name": "@JLHoskins", "likes": 2000, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:51.319636", "replies_count": null, "liked_by_creator": false}, {"comment": "“am i allowed to be happy?” felix i almost burst into tears lmao you are capturing every artist’s experience with this series. it is accomplishment enough to choose to create art at all, to answer the artistic call within you. thanks a bunch for this series and for your vulnerability! really love your work!", "commenter_channel_name": "@RayneBlakeman", "likes": 875, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:51.355707", "replies_count": null, "liked_by_creator": false}, {"comment": "You've come a long way! The art livestreams are especially nice too.", "commenter_channel_name": "@blankbudder", "likes": 5000, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:51.391129", "replies_count": null, "liked_by_creator": false}, {"comment": "dude your drawings are amazing", "commenter_channel_name": "@MrMeep-kc5pz", "likes": 5000, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:51.452486", "replies_count": null, "liked_by_creator": false}, {"comment": "this inspired me to get started with my goals! Not drawing, specifically, but the message this video implies is just to get started. And that's where I struggle the most. I am impatient, and if I don't see great results after two tries I'm done. But this gave me the push I needed and the mindset I should have.", "commenter_channel_name": "@ssharu7016", "likes": 1000, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:51.488225", "replies_count": null, "liked_by_creator": false}, {"comment": "One of the best thing Felix says here, is \"Progress is not a straight line\" In the middle of this he talked about comparing himself to his previous work and how he felt they were better, especially in comparison. It's so easy to get into a mindset that you aren't improving, that things aren't getting better in the way you want them to. But like he says, its a process, you do get better, just a different rates. There's a ton of things you have to learn to draw, and they'll all take different amount of effort and time to learn. Especially going from traditional to digital, as someone who's still learning digital art, it's rough. Just make sure you enjoy yourself, and don't be afraid to just, draw what you want sometimes. Amazing video, so happy he's still doing this! So happy that it's getting so much popularity!", "commenter_channel_name": "@Stormwolf4", "likes": 721, "date": "2 months ago (edited)", "fetched_date": "2025-01-19 13:12:51.523700", "replies_count": null, "liked_by_creator": false}, {"comment": "And the most beautiful thing about this. That it gets even BETTER from here. I truly wonder where your art will be at in 5 years. I just back back to drawing and I honestly draw like a 2nd grader but watching this inspired me a lot to keep giving it my all. I’m 18 about to turn 19 soon. I honestly wonder where my art will be at once I turn 24 if I keep up my consistency on drawing everyday and practicing. I enjoyed the video a lot.", "commenter_channel_name": "@JosueVarela-b8u", "likes": 6, "date": "2 weeks ago (edited)", "fetched_date": "2025-01-19 13:12:51.557236", "replies_count": 0, "liked_by_creator": false}, {"comment": "I've been drawing all my life, and I can see so much of my own inner critic in this. It's normal to progress \"faster\" as a beginner, because you basically start from 0. But then as you progress and get better and better, the progress also slows down. And it can feel incredibly frustrating, because you want to see immediate results, but that's just not how learning works. \n\nThat being said, I'm genuinely impressed with how persistent you've been! Idk if it's my ADHD or depression or what, but I've never been able to draw every single day for long periods of time - yet alone a whole year! And YES study art books and tutorials! Draw different items, and perspective, study anatomy, animals etc. That it exactly how you become a great artist! It's genuinely so cool and so inspiring to see how far you've come in such little time! ", "commenter_channel_name": "@crownclowncreations", "likes": 741, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:51.593992", "replies_count": null, "liked_by_creator": false}, {"comment": "There is this guy that appears on my reel that says “did I improve this drawing?” I think he is an inspiration to go to the next step (especially for shadows and colors)", "commenter_channel_name": "@marcelloascani", "likes": 537, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:51.707845", "replies_count": null, "liked_by_creator": false}, {"comment": "As someone who's been drawing for 10 years, but haven't been consistent in it, I found out that trying different things and media is really where the fun is. When I got tired of color pencils I picked up markers, then watercolors, then gouache, now acrylic paint. It's so much fun and learning how to use something you've never tried before makes you want to keep going! Also, color theory is pain in the ass, but it's so worth it! Everything looks better when the colours are good. Keep going, Felix! And have fun with it! You're doing amazing and your consistency is really impressive", "commenter_channel_name": "@aschita1569", "likes": 294, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:51.744071", "replies_count": null, "liked_by_creator": false}, {"comment": "Impressed. The growth is impressive. The drawing is good too. I love that you realized that you don't always have to be the best at something, in fact it's totally ok to suck at something and still do it, if you love doing it. Eventually you get better but sometimes it's not about that. The goal doesn't always need to be world domination. Sometimes it can simply be enjoying the doing of the thing.", "commenter_channel_name": "@LaughingInTiny", "likes": 3, "date": "1 month ago (edited)", "fetched_date": "2025-01-19 13:12:51.779121", "replies_count": 0, "liked_by_creator": false}, {"comment": "Felix, as an artist who’s been drawing for over 16 years, there will always be one thing—it could seem big or small—that you’re gonna be annoyed about with your own art (mine is hands and lineart, I’ve resigned myself to having a sketchy style lol). And that feeling SHOULD be there. That means you’re always going to be creating, always trying to improve. And the people around you will marvel at what you make. And they want you to keep creating because they genuinely love your art. Being an artist is a blessing and curse in multiple ways, but the pros very much outweigh the cons when you see how far you’ve come and how people are impacted by what you do. Your art style is beautiful btw ", "commenter_channel_name": "@autumnaki725", "likes": 376, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:51.816590", "replies_count": null, "liked_by_creator": false}, {"comment": "Felix should redraw his 80 day whatever every year to see how much he has improved! I love when artists do that :3", "commenter_channel_name": "@morganprooby1016", "likes": 386, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:51.851157", "replies_count": 0, "liked_by_creator": false}, {"comment": "Your line sensitivity is absolutely amazing. You also have a great sense of colour and form with more smart practice you'll be improving IMMENSELY. I am honestly extremely impressed with your progress and wish you lots of fun in the future of your drawing. \nI have a bachelor's in graphics design and animation currently working on my masters so I feel qualified enough to say this you're doing absolutely amazing. Seriously congratulations the further you progress the more stagnant you will feel, but never forget your perspective of your progress is entirely different than that of other people just keep going, don't give up and don't be afraid to take a break if you do burn out. I wish you all the best!!!", "commenter_channel_name": "@aziraphalemonka1520", "likes": 583, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:51.888064", "replies_count": null, "liked_by_creator": false}, {"comment": "This actually made me a little emotional. I think this is so cool and so great! Falling into a hobby/ interest is so nice. Especially drawing for the sake of drawing. It’s so nice… ", "commenter_channel_name": "@CozieGhosty", "likes": 3, "date": "1 month ago", "fetched_date": "2025-01-19 13:12:51.922160", "replies_count": 0, "liked_by_creator": false}, {"comment": "Bro pewds you're a mad man, your progress is amazing. There's this quote that I've read, \"Draw what you actually see, not what you think what you see.\". It helps me a lot on my drawing journey that I finally understand values, tonal values, details, etc. It's all in the eyes, brain, hands. Learning from the masters really helps, I hope it helps you too.", "commenter_channel_name": "@nagazackyishida2160", "likes": 315, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:51.959346", "replies_count": null, "liked_by_creator": false}, {"comment": "13:04 \"Am I allowed to be happy?\" Yes! I'm so glad you're somewhat forcing yourself to see your improvement because it's so easy to hate everything you do with art and forget where you started. Don't give up! I'm super excited to see you keep growing on your art journey!! <3", "commenter_channel_name": "@baphoheck", "likes": 139, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:51.993615", "replies_count": 0, "liked_by_creator": false}, {"comment": "Instead of feeling discouraged, this inspired me, I kept going with drawing. Thanks :)", "commenter_channel_name": "@EMMR0228", "likes": 578, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:52.029989", "replies_count": null, "liked_by_creator": false}, {"comment": "Genuinely, thanks for this. It was a random YouTube recommendation, I don't watch your content with any regularity at all, I hadn't seen any of the previous videos of your journey, but this was amazing. As a kid I thought art was cool, but was \"too cool\" for it, being labeled the math and science kid. Then later in life when I grew up enough to realize how silly that was it felt too late to get into art, I tried it briefly - VERY briefly - and hated what I drew so I gave up on it, saying I couldn't do it, I was too old, I didn't have the motor skills, and any other excuse I could think of. I saw this video a three weeks ago now, and it inspired me to try again. But to actually give it a shot, not half-ass it, to not let myself run away because it was tough or I wasn't happy. To sit down and dedicate some real time and effort into learning, to watch YouTube tutorials and just actually sketch for hours.\n\nAnd in two weeks I can proudly say I suck, miserably, but I suck noticeably less than when I started, and I feel like I have an actual direction. I can look at my stuff and say \"Wow, that's awful, I really got the proportions wrong, I really need to work on my line work, I really need to lower the eyes\". I can see where I'm going wrong, and I'm starting to learn how to actually learn how to draw, how to look at what people draw and see how I'd go about applying that myself. Where before I'd see something someone drew and think \"Wow, that looks so nice, I could never do that in my life\" now I think \"Wow, look at how they did that, look at the shape of the face, the perspective, how it's posed - how would I go about doing that? Where would I start? What are the proportions they used?\"\n\nIt's been super fun, and it's a lifelong regret I've managed to rectify, specifically thanks to the push from this video. The idea that I could try something just for fun, that it didn't have to be in furtherance of work or employment, that it doesn't ever have to be for some grand purpose, is so foreign to me it was super difficult to take that first step. Thanks!", "commenter_channel_name": "@Nightstick24", "likes": 1, "date": "4 weeks ago", "fetched_date": "2025-01-19 13:12:52.064129", "replies_count": 0, "liked_by_creator": false}, {"comment": "\"If i'm having fun, I would remain consistent\" the term that I always wanna use! it may sounds irrational to others, but I'm glad to hear from him as well. Maybe we gotta do what just work for us all along without feeling too much unnecessary pressure", "commenter_channel_name": "@Drifter26", "likes": 317, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:52.100807", "replies_count": null, "liked_by_creator": false}, {"comment": "So, as someone who's been in fine arts, 3d animation and film directing studies(now I am a 2d animator professionally), you are doing fucking amazing.\nYou are hard on yourself, because you already see and understand your way to progress. Keep it on pal, and you will put all of us, who have done this for years to shame! Your work is superb!", "commenter_channel_name": "@nefelijeevas1782", "likes": 292, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:52.135022", "replies_count": 0, "liked_by_creator": false}, {"comment": "When's the manga coming?!\nLove the lesson that improving isn't a straight line. Artworks go through \"ugly\" stages when you're trying new things, it's important to not get discouraged by that and to stay the course. I think you've inspired a lot of people with this art series, keep it up ", "commenter_channel_name": "@JordanPersegati", "likes": 117, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:52.171858", "replies_count": null, "liked_by_creator": false}, {"comment": "That \"am I allowed to be happy?\" was- I can't even put it into words but I had to pause the video and think to myself. Felix may not have been someone I was always watching as a kid but I always found his, like many YouTubers journeys, inspiring. And hearing him go through the struggles I've found myself in despite what others say about my work just hit my soul fatally. For what it's worth, your improvement is very apparent. Getting in that block where you think you'll never improve is dangerous to your creativity and it is hard to break but you have to remember what you love about what you do and take a step back to simply enjoy the process. I hope this helps anyone. I'm currently halfway through 3D animation and I still feel this way. It's never too late to start working towards your dreams. Even if you fall in a ditch, you can dig yourself back up. It's not the end for your imagination.", "commenter_channel_name": "@MizzClareJonesKNS", "likes": 105, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:52.231777", "replies_count": 0, "liked_by_creator": false}, {"comment": "I think this might be one of my favorite series on YouTube seriously, I feel so deeply inspired watching it, it's not simply the progress but the consistency and he being so open about the process, how it really isn't a straight line and how that can be frustrating even when it's something you like and you choose to do and keep doing", "commenter_channel_name": "@samiasouen", "likes": 188, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:52.266880", "replies_count": 0, "liked_by_creator": false}, {"comment": "\"I felt like I could do more\" is so relatable. I've been having really bad art block for a couple years now and seeing your dedication makes me want to pick up my sketchbook again. Great job and I hope you continue your art journey, Felix!", "commenter_channel_name": "@Gigi-s1x", "likes": 75, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:52.302515", "replies_count": 0, "liked_by_creator": false}, {"comment": "Drawing is such a therapeutic thing to do! This should be a universal challenge.", "commenter_channel_name": "@Psych2go", "likes": 136, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:52.365683", "replies_count": null, "liked_by_creator": false}, {"comment": "Every artist who makes the switch to digital feels your pain. \nIt can be so demoralizing to know in your heart and have proof that you can do better but still be unable to because you don't understand the new toolset yet.\nI don't know you, but I am proud of you for the sheer determination and I truly believe you made the right decision by sticking with drawing the things you find fun as it helps to keep motivated.", "commenter_channel_name": "@BriteSydeBob", "likes": 162, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:52.403409", "replies_count": null, "liked_by_creator": false}, {"comment": "4:20 this is a genuine part of being a good artist, in a way. Having life experiences, witnessing new and different things in person over time as you age, gaining perspective. All of these things make you better art. A large part or art is understanding the world. It's not so much the creative part as the technical part of art, which might not immediately come to mind", "commenter_channel_name": "@monochromebunni3887", "likes": 246, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:52.440840", "replies_count": null, "liked_by_creator": false}, {"comment": "This feeling of suddenly sucking after drawing something really good is so common for us artists. My passion for art has really died down these last few years. I really miss when I was able to draw a full piece with outline and color. Now I get exhausted after just sketching two faces and give up. I'm also super frustrated I cannot seem to draw the same original character twice the same way. Your video really does help motivate though, so I hope you keep drawing and sharing because I find it incredibly fun to see what you create. Much love <3", "commenter_channel_name": "@girffe7442", "likes": 2, "date": "9 days ago", "fetched_date": "2025-01-19 13:12:52.475539", "replies_count": 0, "liked_by_creator": false}, {"comment": "8:55 WHAT!!?? THE FULL BODY IS SO GOOD???? WHAT IS HE SAYING???", "commenter_channel_name": "@MintPicker09", "likes": 1000, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:52.512431", "replies_count": null, "liked_by_creator": false}, {"comment": "Because of your second video \"drawing 100 days\" I picked up my sketchbook that I haven't touched in 20 years and I haven't stopped drawing since. I'm a little sad I didn't keep it going when I was a teenager but happy I found it again and I'm 100% sure I wouldn't have dove back into it without Felix. I'm so grateful for that.", "commenter_channel_name": "@Babl069", "likes": 87, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:52.548826", "replies_count": null, "liked_by_creator": false}, {"comment": "Art is definitely not a linear experience for sure, as someone whos been drawing for 8 years now I have months where i see my old art and sob cause its so much better than some current stuff, while i have other months where I skyrocket in skill. it ticks back and forth and lot of it is a gap in growing observational skills and jetlagged practice trying to keep up  with that. you have improved so much though!", "commenter_channel_name": "@blooerror4046", "likes": 109, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:52.585199", "replies_count": null, "liked_by_creator": false}, {"comment": "8:15 I like how you addressed that here. What people dont know about me is that in order for me to get this good in to where i currently am now, I have to restart from the basics like 15 times, literally learn how to draw the head, proportions and what not so its imbedded into my muscle memory. \n\nMy friends tell me its time consuming and it really feels demotivating, however I do understand thier frustration. But as youve said before on one of your videos, is that \"youre not doing it all again from scratch, youre doing it all with experience.\" so its not as slow or demotivating. Kinda the opposite really, youre just watching yourself not suck as much", "commenter_channel_name": "@abalphas0604", "likes": 199, "date": "2 months ago (edited)", "fetched_date": "2025-01-19 13:12:52.645182", "replies_count": 0, "liked_by_creator": false}, {"comment": "I genuinely don't understand why people are hating PewDiePie because he is good at art now. To me, all of the haters just sounds like jealous artists. I find his dedication and visible progression to making good art very inspiring.", "commenter_channel_name": "@kirbyrush7007", "likes": 202, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:52.682581", "replies_count": null, "liked_by_creator": false}, {"comment": "PEWDS! Geniunely congratulations AND thank you (for making this video)!\nIts been incredibly inspiring to see your journey, both for professional artists and those who are getting there.\n\nContent like this is much needed right now when lots of us are feeling a bit overwhelmed, afraid to take the plunge and follow our passion.\nThank you for showing us that it is a worthwhile quest! Can't wait to see what else you'll create!!", "commenter_channel_name": "@ManuMercurial", "likes": 168, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:52.719011", "replies_count": null, "liked_by_creator": false}, {"comment": "What makes me so happy, as a professional artist myself, is that I like to think a lot of people will watch this series and go “hey I could do that” or will maybe be inspired to try for a bit just because it is fun. Because seeing the progress from the start feels much more attainable. And art IS FUN man! This also made me smile because it reinforces the daily joy that drawing brings, still to this day. It made me remember when I was a beginner. Love it still, at the end of the day, even after 13 years since I began.  happy drawing y’all", "commenter_channel_name": "@iliadele", "likes": 69, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:52.778981", "replies_count": 0, "liked_by_creator": false}, {"comment": "A future manga author/artist in the making and he doesn't even realize it. Pewds always had a natural talent for art in general, he just needed a push to learn how to properly demonstrate his creativity through pen and paper. You'd be surprised how good you're at something once you finally learn how to do it.", "commenter_channel_name": "@PsychoKupo", "likes": 115, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:52.813167", "replies_count": 0, "liked_by_creator": false}, {"comment": "I grew up  watching him\nnow he is a dad doing what he enjoys\nI wish you a happy life", "commenter_channel_name": "@ahanaftahmid5612", "likes": 217, "date": "2 months ago (edited)", "fetched_date": "2025-01-19 13:12:52.846682", "replies_count": 0, "liked_by_creator": false}, {"comment": "Should make a manga, will make you draw bodies more, landscapes, action scenes, and perspective. Will give you something to work towards as well!", "commenter_channel_name": "@ill4570", "likes": 198, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:52.909400", "replies_count": null, "liked_by_creator": false}, {"comment": "As a professional artist that has been drawing all my life... in the words of Jake the Dog, \"Sucking at something is the first step to being kind of good at something.\" What you said about success absolutely hit the nail on the head -- rarely is improvement ever linear. I hope that you've fallen in love with drawing and keep at it, your work is better than you think!", "commenter_channel_name": "@kmagers2892", "likes": 72, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:52.947304", "replies_count": null, "liked_by_creator": false}, {"comment": "This might be my favorite pewdiepie series to date. And I have been watching you since 2012. Truly it’s inspiring stuff and I hope to see more of it down the line, even if it’s not every day anymore. Good work Felix. Proud of ya", "commenter_channel_name": "@lebendigesgespenst7669", "likes": 113, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:52.982463", "replies_count": 0, "liked_by_creator": false}, {"comment": "6:20 that Makima drawing kinda fire tho", "commenter_channel_name": "@arokunaga6387", "likes": 175, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:53.043820", "replies_count": 0, "liked_by_creator": false}, {"comment": "WOW. THE FACT THAT YOU EVEN EXCELLED IN DIGITAL ART IS INSANE.", "commenter_channel_name": "@ichigooo7746", "likes": 91, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:53.079260", "replies_count": 0, "liked_by_creator": false}, {"comment": "7:00 branching out is the best way to improve overall. Peaking with anime girls at day 80 is totally normal. Doing side quests into landscape sketches, still life, city scapes, animals etc. is a great way as a beginner to learn the feel pens/ contrast/ composition without the difficulty of human anatomy. We're able to spot the slightest imperfections when it comes to human and even anime drawings. Starting off with a more forgiving subject is helpful in that regard. But at the end of the day having fun and being motivated to draw anything is the most important, regardless of what is drawn.", "commenter_channel_name": "@Random-Saurus", "likes": 111, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:53.114943", "replies_count": 0, "liked_by_creator": false}, {"comment": "That beginner passion as you improve with every little thing you try because you've started from nothing, there's nothing like it. And it does suck to reach that point where the improvement stops being a pure increase. You start looking at your art critically and see all the ways you're falling short, it sucks! But it's so fun. Drawing can be so much fun. I'm glad you got into art, and I hope you keep enjoying it.", "commenter_channel_name": "@Paego_", "likes": 1, "date": "12 days ago", "fetched_date": "2025-01-19 13:12:53.149943", "replies_count": 0, "liked_by_creator": false}, {"comment": "As an artist that has a mountain of scraped art because \"it's not good enough\" mindset. But after watching your journey it really inspired me to continue and power through while learning from my mistakes in my art.Thank you Felix!", "commenter_channel_name": "@Ecorkill04", "likes": 124, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:53.187301", "replies_count": null, "liked_by_creator": false}, {"comment": "dude... you already surpassed me so much... a lot of those drawings were great, maybe not finished but the base was very good. You humilliated me haha I'm been suffering with inktober but watching your progress, you got better at drawing than me in just one year than me who spent years and years drawing, but it shows me that I'm not taking it seriously, you have practiced a lot and searched how to get better, whereas each time I was dissatisfied with my drawings I stopped for a while before coming back to drawing. It encourages me. And seriously you are so good now that you could easily take commissions (you draw muuuch better that many people in the commissions pages I am a member of) The last drawing was incredible! It is normal for artists to hate some of their pieces when actually they are not bad at all, I can see that with your drawings, trust yourself more!! Great, reaaalllyyyy great progress!", "commenter_channel_name": "@agula44", "likes": 43, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:53.224202", "replies_count": null, "liked_by_creator": false}, {"comment": "Feeling like you peaked is a CORE part of the art experience!!!! I'm so fucking proud good god. Watching you go from knowing nothing to what you've shown in the video is literally mind-blowing. Thank you so much for being diligent about drawing every day. It's just... I can't explain it. I love it so much. Seeing the process that all artists go through accelerated and condensed into one video is so pleasing, nostalgic. This is my favorite video on the channel now, previously it was your first book recommendation vid, it got me into philosophy. \nSide note I'm an old fan, I remember the Skate videos being one of the first things I saw from you and had been watching since. As I grew up I kind of diverged and started doing my own thing like... living my life instead of watching youtube all the time. But whenever I check back in it makes me so happy to just see you grow and become a new person. And then I check in today and you have a soN???? And you're drawing now, I just... I'm so happy for you Felix. Seeing your life through the years is really something special. I'm so happy this channel exists :)", "commenter_channel_name": "@violentabyss", "likes": 45, "date": "2 months ago", "fetched_date": "2025-01-19 13:12:53.259619", "replies_count": 0, "liked_by_creator": false}], "related": []}