{"code": "j0XyUEQYIdc", "title": "filming outside during my first typhoon for no good reason", "url": "https://www.youtube.com/watch?v=j0XyUEQYIdc", "thumbnail_url": "https://i.ytimg.com/vi/j0XyUEQYIdc/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLByS5v2PT3DoXAaBoBT-P1K5DP5Qg", "views": 2000000, "likes": 144000, "duration": "", "embed_code": "https://www.youtube.com/embed/j0XyUEQYIdc", "uploaded_date": "13 Aug 2022", "comments_count": 5132, "comments": [{"comment": "Pewds feels like a new YouTuber again, its so refreshing. I remember the QnA's he's done on his first Friday's with Pewdiepie and honestly, this video feels very reminiscent of days gone by.", "commenter_channel_name": "@Hexra_", "likes": 8000, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:05.255583", "replies_count": null, "liked_by_creator": false}, {"comment": "As a Japanese person, my personal opinion is that I like foreigners very much.  Because there are not as many foreigners in Japan as there are in America or Europe, so when I see foreigners, I wonder if they are enjoying Japan.  And so on.  So when I see foreigners in Japan, I feel happy.", "commenter_channel_name": "@%E3%82%B3%E3%83%B3%E3%83%99%E3%82%A2-f8c", "likes": 1000, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:05.296966", "replies_count": null, "liked_by_creator": true}, {"comment": "He's slowly turning into the chill uncle or the fun dad and I'm loving it", "commenter_channel_name": "@johnphilipdestacamento512", "likes": 1000, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:05.335880", "replies_count": null, "liked_by_creator": false}, {"comment": "i don't think felix realises just how much we learn from him and how much we look up to him. honestly each and every video he's posting lately, i love with all my heart, felix and marzia just mean everything to me and his vlogs and videos especially one's like these make me feel like i'm just having a conversation with a friend. it's amazing how special he makes me feel even with an audience of 111M. thank you for every video you upload felix! \ni feel like ever since japan, this channel has become a close knit group of amazing people just adoring any video felix gives us <3", "commenter_channel_name": "@piyalipawar", "likes": 574, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:05.372172", "replies_count": null, "liked_by_creator": false}, {"comment": "You literally made a lot of our childhoods. That’s why we are so open online. We didn’t just watch your videos and say “wow I love this man” we spent literal years watching every video you posted. Knowing when we got back from school or a difficult day, that your videos will be there. We related to what we saw, you were funny and told jokes most didn’t. You were unique and for us lonely insiders, we actually felt like we knew you even though we dont", "commenter_channel_name": "@brycesasser6204", "likes": 3000, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:05.407845", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewds is entering this really calm and reflective phase man. It feels amazing to have watched this guy grow so much over the last decade, overcome so many obstacles and uncertainties. It's very inspiring. Role model for sure.", "commenter_channel_name": "@peppyhydra4544", "likes": 421, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:05.441738", "replies_count": 0, "liked_by_creator": false}, {"comment": "with the minimal editing and the hand-held camera, this video feels like i'm on a video call with a friend who's just giving me advice for my nonexistent problem.", "commenter_channel_name": "@vx2section", "likes": 389, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:05.477433", "replies_count": null, "liked_by_creator": false}, {"comment": "0:00 Intro\n0:28 Do you feel like your Japanse fanbase has grown since you moved to Japan\n1:28 What's your philosophy for being satisfied with yourself?\n2:56 Do you have anymore goals or ambitions lately\n Has everything lived up to your expectations?\n Do you get bored at times being sober\n Was it difficult to find housing that was comfortable space wise \n How do you take criticism when you give \"controversial opinions\"\n Have you ever felt some sort of imposter syndrome?\n I've heard that Japan has one of the most xenophobic cultures but from your vlog they all seem to be nice\n Do you think MrBeast will overtake you in subs\n Will there be more book reviews?\n I've always been in awe how you keep your Swedish traditions\n Is it hard to hear about your fans so frequently?\n Wich works do you feel had been the most influential in helping you attain your present state?\n Why is your channel not growing faster\n What age did you really start caring about your health?\n I was wondering how it has been learning Japanese in Japan\n Is it hard to have lived abroad for so long?\n Do you think Japanese's people are \"pretending\" to be polite to non Japanese's people\n Dos life feel hollow when you accomplish a of things to soon\n Have you ever sat their and thinking about how scary and terrible dying actually is\n How do you not notice the mess of cables when you go outside in Japan\n What is like to be famous for basically you entire adult life?\n Do you ever have anxiety and how do you deal with it?\n outro", "commenter_channel_name": "@Spiritwonder420", "likes": 1000, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:14:05.516440", "replies_count": null, "liked_by_creator": false}, {"comment": "I still deeply appreciate after all these years and over 111 million subscribers, Felix still makes every video like he’s talking to a friend. His videos and attitude are so inclusive and comforting. It feels like the video was made just for me even though I know millions are watching it.", "commenter_channel_name": "@cruisematt8585", "likes": 1000, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:05.554827", "replies_count": null, "liked_by_creator": false}, {"comment": "This dude has become wise as heck. Its like hearing your mentor speak and give you advise. Kudos to you bro. Thanks for all that you have shared with us.", "commenter_channel_name": "@deviant3193", "likes": 207, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:05.599197", "replies_count": null, "liked_by_creator": false}, {"comment": "This actually didn’t need to be a video. I was listening to it while crocheting and I surprisingly picked up a lot of stuff that he was saying. Pewds, honestly you could just have a podcast and talk about anything, I would listen to it. I love how mature you are now and all this time I was wondering why I can’t bring myself to watch your previous type of videos anymore. Its most likely that I have grown and matured too and I love that you transitioned to these types of calm and serene vids just talking about life. More power to you bro.", "commenter_channel_name": "@kafka9358", "likes": 1000, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:05.637898", "replies_count": null, "liked_by_creator": false}, {"comment": "It just really puts a big smile on my face to see Felix walking around and enjoying life and still sharing the journey with us along the way.", "commenter_channel_name": "@supercellgallery5579", "likes": 353, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:05.676825", "replies_count": null, "liked_by_creator": false}, {"comment": "We’re growing up, aren’t we. My gratitude for this man will always be deep, I am glad to have been apart of this generation.\n\nI am glad my grammatically wrong spelling still reached my fellow nine year olds.", "commenter_channel_name": "@Sinatracle", "likes": 907, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:14:05.717902", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewds this QnA was so incredibly refreshing and insightful. I've been following you ever since I was in elementary school (I'm now starting Uni) and being able to witness how much you've matured over the years, feels like an honor. This video and the Japan vlogs make me emotional for the same reasons, but it's also incredibly calming. The vlogs also bring a true joy by seeing you, Marzia, and the puggos authentically happy in all of your elements. Please continue to make these videos if you enjoy making them and thank you.", "commenter_channel_name": "@natcaxx", "likes": 755, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:05.758403", "replies_count": null, "liked_by_creator": false}, {"comment": "Felix's philosophy is always so interesting to listen to. He's like the Wise Old Man of YouTube. He's seen just about everything there is to be seen and has come to peace with his level of success. He literally helped all of us grow up into better people. Thank you, Felix!", "commenter_channel_name": "@Sheep.", "likes": 565, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:05.802033", "replies_count": null, "liked_by_creator": false}, {"comment": "I just love how pewds does anything he wants now it's so nice to see him genuinely happy", "commenter_channel_name": "@fall3718", "likes": 616, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:05.837233", "replies_count": null, "liked_by_creator": false}, {"comment": "This was the most unexpected comforting therapy session of a video ever. Glad I watched. Been feeling a bit overwhelmed lately and I’m just happy to sit and hear others going through the same as me and having pewds give his take on how he dealt with those situations really just put me in a better mood", "commenter_channel_name": "@Giessepe", "likes": 407, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:14:05.877149", "replies_count": null, "liked_by_creator": false}, {"comment": "I've actually quite missed pewds uploading usually.... Sometimes i check the chennel to see if he's uploaded.... But whenever he uploads these days...  Seeing him so happy and calm and positive, it's just feels so good. Wish you the best to you and marzia, pewds....  And thank you, man!", "commenter_channel_name": "@barathvarshan4902", "likes": 292, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:05.914613", "replies_count": null, "liked_by_creator": false}, {"comment": "Can we just take a minute and appreciate Felix microphone doing awesome even though the extreme wind.", "commenter_channel_name": "@farbrornilsson9709", "likes": 128, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:05.948607", "replies_count": 0, "liked_by_creator": false}, {"comment": "Felix not being able to stop smiling is the most wholesome thing I've seen of him over the years!", "commenter_channel_name": "@ComicDubbers", "likes": 158, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:05.982551", "replies_count": 0, "liked_by_creator": false}, {"comment": "felix is honestly one of the most lowkey, chill, and wholesome person ever. i hope he knows how much comfort he gives not just to me but to a whole lot of people. this simple Q&A vid is giving me so much more inspiration and comfort and i just wanna thank him for it.", "commenter_channel_name": "@alyxdgreat_", "likes": 192, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.016252", "replies_count": 0, "liked_by_creator": false}, {"comment": "I actually cried listening to the part of \"being satisfied with yourself\" I always have the mindset of pity and hating my life. But listeing to you saying \"to be satisfied with yourself, you can always be better at anything--but as long as you're trying or taking steps you have to be satisfied with that\" which hits hard because i compare myself from other people's life and giving up easily. This also reminds me of my boyfriend's favorite quote from Bojack Horseman: “Every day it gets a little easier… But you gotta do it every day — that's the hard part. But it does get easier.” So Thank you Felix, I should've watch this video earlier. :)", "commenter_channel_name": "@bybeata", "likes": 179, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.050018", "replies_count": 0, "liked_by_creator": false}, {"comment": "This is beautiful, the community questions have grown along with Felix his mindset, the mental topic questions are amazing, it's making my soul shine like crazy, Felix is becoming a humble Philosopher, his positive thinking will hopefully reach many people, some massive AoE healing might be done <3", "commenter_channel_name": "@koodorichan", "likes": 229, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:14:06.085954", "replies_count": null, "liked_by_creator": false}, {"comment": "Something I learned, when Felix  talked about anxiety he’s absolutely right working out getting more active as well as having a schedule and sleeping at the same time helps it won’t fix it magically for everybody unfortunately. Some people won’t have a easy time understanding that if you grew up in a mess up situation could even not be a very bad one but if it was not great you’ll likely to have a bad time regulating yourself and also the genes right? So some people really won’t have chronic anxiety they’ll get anxious and stressed in life and experience loss and heartbreak but they’ll cope better. There’s no reason to beat yourself over it. Try to sleep better eat better do better… not perfect, better… no reason not to try you have all to gain and nothing to lose", "commenter_channel_name": "@heyhorinshi", "likes": 7, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.123130", "replies_count": 0, "liked_by_creator": false}, {"comment": "Wow, it really seems like Felix is using this move to Japan as a chance to reset his life and reinvent himself as a happier and healthier person. Great to see that. Actually, I went through a similar process myself after moving to Japan more than 20 years back. It wasn’t really such a deliberate change maybe, but I can say that without a doubt this country made me into a better and healthier person. Embrace the change, Felix! ", "commenter_channel_name": "@Jordan-inJapan", "likes": 407, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.158126", "replies_count": null, "liked_by_creator": false}, {"comment": "Although it may not be your focus, I do hope you keep uploading to youtube, especially the japan vlogs. Those vlogs feels like an event for me. Every time a new vlog is uploaded, I just keep the notification afloat, go back home from work, and chill the rest of the day watching the vlog. Really really feels like I'm living the dream myself, and I absolutely love it.", "commenter_channel_name": "@kueapel911", "likes": 147, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.193763", "replies_count": null, "liked_by_creator": false}, {"comment": "I, a Japanese fan of you for almost 8 yrs, wouldn’t stop you to say Hi even if I see you on street in Tokyo. I just silently wish you live happily and peacefully here Pewds.\n\nP.S. Just in case, I know he wouldn’t be bothered! I’m just a silent supporter that’s all.", "commenter_channel_name": "@ncp9095", "likes": 2000, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:14:06.229961", "replies_count": null, "liked_by_creator": false}, {"comment": "I could listen to Felix talk all day. I love this type of videos.", "commenter_channel_name": "@ninthefrog3911", "likes": 9, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.263822", "replies_count": 0, "liked_by_creator": false}, {"comment": "“It’s impossible to have fun when you’re sober” and Felix’s response is stellar, wise, straight to the point\n\n“Stop saying shit like that, it’s not true.” Thank you haha.", "commenter_channel_name": "@skysmusic__7666", "likes": 118, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.299891", "replies_count": null, "liked_by_creator": false}, {"comment": "So happy to see that you and Marzia are living out your dream together. Building your forever life together. I'm glad you guys get peace and the ability to have a normal life in Japan. I hope the best for you two!", "commenter_channel_name": "@krisj5561", "likes": 229, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.335349", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewds I'm 48 years old, I've been living in Japan for a year and 8 months, I don't know the language all by heart but I got enough to get by. All I can say is just keep you being you. My job I'm lucky enough as an actor to meet a lot of foreign people, and no matter who you are in Japan you will always be foreign. And it's a welcome equality for all of us. Just to be different but unique all the same.", "commenter_channel_name": "@Lostrelic", "likes": 208, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.371393", "replies_count": null, "liked_by_creator": false}, {"comment": "i’ve been watching you since i was a child. has to be almost 10 years at this point. i had a rough childhood up until adulthood and your videos have given me so much comfort. it feels like i know you!! though we will probably never meet and you don’t know anything about me, you’ve gotten me through the darkest moments in my life. i love how real you keep it, and the death stuff has been heavy on my mind recently too. but to know that everyone on earth all go through the same motions, makes me feel connected and more at ease. we’re all navigating the same path, though they’re all different. it just feels more comforting to know that we’re all here together in this lifetime, and it reminds me to always share love. thank you felix. ", "commenter_channel_name": "@mykenziehartman103", "likes": 41, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.406189", "replies_count": 0, "liked_by_creator": false}, {"comment": "Pewds is such a cheery guy. Literally in every frame of this video he is smiling genuinely.", "commenter_channel_name": "@LaurenceMosca89", "likes": 132, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.442101", "replies_count": 0, "liked_by_creator": false}, {"comment": "For how insanely successful you got at one point you've remained a very ''normal'' guy. Your head is in the right space and you are developing yourself after all this hard work you've done still. Makes me proud to see you do so well and its also somewhat inspirational. i guess", "commenter_channel_name": "@ferryv6740", "likes": 128, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.478906", "replies_count": null, "liked_by_creator": false}, {"comment": "having been a fan for almost 10 years now, its so refreshing to see Pewds doing these type of chill and laid back videos", "commenter_channel_name": "@kwaiston", "likes": 46, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.516130", "replies_count": null, "liked_by_creator": false}, {"comment": "I like to think people connect quickly and so abnormally close to vloggers is because of how close we get to faces in videos, so it kind of sparks that intimate moment we rarely get in real life.  I also find myself feeling nostalgic watching this kind of stuff, especially Let's Plays, more so because I'm reminded of just sitting next to my older brother as he played games.  Just odd bonding.", "commenter_channel_name": "@SICProwl", "likes": 4, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.551674", "replies_count": 0, "liked_by_creator": false}, {"comment": "this feels like it’s a 73 questions interview by Vogue but instead of being staged down to every step and answer, it’s lowkey and real. very wholesome", "commenter_channel_name": "@SweetDonut_with_sprinkles", "likes": 371, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.593392", "replies_count": null, "liked_by_creator": false}, {"comment": "I'm so proud and happy for him that he's finally moved somewhere he can walk down the street without being pestered and bothered constantly.", "commenter_channel_name": "@baggaza", "likes": 172, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.634400", "replies_count": null, "liked_by_creator": false}, {"comment": "Really appreciate that he chose to share a part of his experience since moving to japan, it's been very wholesome and entertaining.", "commenter_channel_name": "@kaiman8569", "likes": 69, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.674064", "replies_count": null, "liked_by_creator": false}, {"comment": "I think the reason so many fans say that he’s done so much for them is because it’s consistency. People like to have consistency in their lives and knowing that you can watch a new video everyday for sometimes hours from someone you really enjoy can probably be the highlight for some peoples days. People throwing themselves into a fandom or a hobby can be therapeutic but I understand why he doesn’t understand because from his perspective he’s just doing a video for fun why would it be anything other than entertainment.", "commenter_channel_name": "@madisonmuennich8143", "likes": 5, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.711492", "replies_count": 0, "liked_by_creator": false}, {"comment": "I feel like he is exploring a little nature rather than to sit on his streaming chair whole day. Love this version", "commenter_channel_name": "@Nitengohain", "likes": 537, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.749682", "replies_count": null, "liked_by_creator": false}, {"comment": "I can’t believe I subbed to you when you made that video saying you would quit YouTube at 50mil. Knew nothing about you except you played horror games and happy wheels to entertain a younger fan base. Now it’s been 6 years or so of watching you and connecting with you. You’re a great energy on this platform and it’s truly heart warming to watch you become a beacon of hope, warmth, and happiness for more and more people.", "commenter_channel_name": "@lacrosse4higher", "likes": 46, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.788896", "replies_count": null, "liked_by_creator": false}, {"comment": "That answer to the question how do you deal with criticism while maintaining a positive mindset. Is such a great answer. It seems like a healthy way of being. I think if more people thought that way there'd be less conflict in general.", "commenter_channel_name": "@stevenbeech4684", "likes": 8, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.823805", "replies_count": 0, "liked_by_creator": false}, {"comment": "Anyone else been binge watching the old playthroughs? I saw a thumbnail of an old video from 2012 of him playing TWD and a wave of nostalgia just hit me and ever since then I've just been watching his old videos. I felt like a kid again, just getting home exhausted from school and watching PewDiePie the whole evening. Although I wouldn't recommend ever showing his content to a kid (sorry), thanks for being a big part of my childhood. I think I can say for others that you have no idea the positive impact you've had on us. I can't even describe it, you were just the automatic choice to be cheered up when we felt down. You don't have to read this, I'm just saying this with the off-chance you might see it: thank you. I hope all your hard work has lead you to be happy in life, cause years and years of dedication and uploading daily, banger video after banger video must have been exhausting. You deserve it. \n\nBtw ya'll should watch his old playthrough of Trials: Evolution. Such an underrated video, it's nine years old and it still kill me. Currently watching his playthrough of the Grudge Wii VR. These videos are just timeless.", "commenter_channel_name": "@krisskrossSSS", "likes": 2, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.858676", "replies_count": 0, "liked_by_creator": false}, {"comment": "I love just watching pewds sharing his thoughts and opinions. something about it is just so chill.", "commenter_channel_name": "@joakimwolff3626", "likes": 137, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.893546", "replies_count": null, "liked_by_creator": false}, {"comment": "I am a Japanese living in Tokyo. I think you are right, there are unspoken rules in Japan. For example, when you are invited to a wedding, the etiquette is to pay the fee in new bills. It conveys the thoughtfulness that I had prepared new bills in advance for the bride and groom for your friend's marriage.\n\n Conversely, it is bad manners to prepare new bills for a funeral. It gives the impression of rudeness to prepare new bills in advance, assuming that a friend or relative will be dying soon.", "commenter_channel_name": "@mo5zy", "likes": 9, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:14:06.927327", "replies_count": 0, "liked_by_creator": false}, {"comment": "you definitely made some solid points here. i’ve been in a big slump and i didn’t realize but i think a lot of it is because i let every little thing get to me and ruin my mood when it doesn’t need to. i’m gonna write some things you said down in a notebook and remember it next time something negative happens. i know said you don’t think your videos help much but this truly did make me sit here and think. thank you man.", "commenter_channel_name": "@micameows", "likes": 62, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.962100", "replies_count": 0, "liked_by_creator": false}, {"comment": "feels like an old friend which i don’t really hang with that much anymore checking in from time to time", "commenter_channel_name": "@markusjacobsen6475", "likes": 4, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:06.999092", "replies_count": 0, "liked_by_creator": false}, {"comment": "You have honestly helped me grow as a person. Not in the “ you saved me when I was in my low “ but in a sense that you were very influential to me in the ways that I respond to things now. I know when and to when not be immature about some topics and also how to deal with people (I work at a fast food restaurant and people can be rude for no reason). You also helped me learn and improve my English when I wasn’t very confident in my pronunciation and that it is okay to make mistakes as long as you make sure you  correct yourself and be a better person in the future.", "commenter_channel_name": "@elidaalvarado9320", "likes": 73, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:07.038484", "replies_count": null, "liked_by_creator": false}, {"comment": "Watching you since 2013, for almost 10 years now thats insane", "commenter_channel_name": "@FolliYt", "likes": 165, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:07.076464", "replies_count": null, "liked_by_creator": false}, {"comment": "I'm amazed at how good the audio is in the strong weather conditions. This video felt spectacular, and it made me feel like I was taking a walk with a friend. Thanks pewds.", "commenter_channel_name": "@theShadeslayer", "likes": 20, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:07.111699", "replies_count": 0, "liked_by_creator": false}, {"comment": "The answers to xenophobic Japan was spot on. I’ve traveled and lived in other countries and this is what sets us apart. Those that don’t let others experience dictate their own will be happiest. I lived in countries where I felt blessed while my friends lived there afterwards and say they prefer being in the USA lol. I feel at this point I can find the silver lining in almost any situation.", "commenter_channel_name": "@michaelsotomayor5001", "likes": 11, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:07.149397", "replies_count": 0, "liked_by_creator": false}, {"comment": "This is honestly one of my favorite videos of Pewds. By being deeply personal and offering advice/tips based on his own experiences, this video is one of the most relatable and even comforting videos I have ever seen him do. He may not understand exactly how a video can change peoples lives for the better, but this is an example of one. From a kid screaming at horror games to  a grown man immersed in philosophy and literature, living his best life, his journey has most definitely been unexpected, but definitely very inspiring.", "commenter_channel_name": "@VibeSparx", "likes": 34, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:14:07.190427", "replies_count": null, "liked_by_creator": false}, {"comment": "I really connected with this video. Talking about the challenges you overcame really inspired me to want to try better and be better. Keep doing you pewds wish you all the best", "commenter_channel_name": "@senorbacon1598", "likes": 361, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:07.231161", "replies_count": null, "liked_by_creator": false}, {"comment": "I think your comments about death and how we can deal with thinking about it and control our fear is really accurate especially when we can't change it but we can focus on our fulfilment in each of our lives and most of all enjoy the little things as well as our hobbies and goals. I've watched you since I was little and now I have been to university but had to put a pause on that and my life after being diagnosed with a heart disease. It has completely changed my life and I have had to learn how to cope again. I'm 22 so it's hard to accept the things I can't do anymore but I have a new love and appreciation for every day and I am somehow less existential than I used to be, maybe because I have accepted the journey and if mine is short I want to be happy and spend as much time making memories with friends and family as I can. I hope others can find comfort in their thoughts and focus on living their best lives because you all deserve to ️. It's really lovely to see your vlogs and your videos have been a joy to watch so thank you.", "commenter_channel_name": "@zerolefty1907", "likes": 10, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:07.284407", "replies_count": 0, "liked_by_creator": false}, {"comment": "Ive been watching Pewds for over a decade, These Japan vlogs have bee some of my favorite content he's ever made", "commenter_channel_name": "@SpicyDisco", "likes": 11, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:07.339209", "replies_count": 0, "liked_by_creator": false}, {"comment": "As somebody who is over weight with crippling anxiety (mine effects my vision), my therapist and I have agreed that working out has been extreamly helpful for my mental heath. Not even for loosing weight, just the release from breaking a sweat.", "commenter_channel_name": "@chloerhodes1127", "likes": 20, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:07.385421", "replies_count": null, "liked_by_creator": false}, {"comment": "i had no idea that this video would move me to tears while ironing lmao, i just clicked for a chill  q&a but got hit hard with so much philosophy. Needless to say i’m so happy I did click when I saw, your words bring me so much internal comfort and i’m so happy that there are people everywhere that have these deep thoughts, I always felt like my overthinking was a flaw but i’m now starting to view it differently. Thank you so much Felix", "commenter_channel_name": "@Mila-vd7bs", "likes": 170, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:07.428970", "replies_count": null, "liked_by_creator": false}, {"comment": "I've been watching Felix for so long that even on his breaks I still visit his YouTube to see if he uploaded. I'm happy knowing that him not uploading every single day is making him happy, as he said his videos  now are more on what he actually wants to talk about, which is very fun for me and a lot of other people. It's nice to see too what people say on the comments, it's fun looking at these people who appreciates Felix for who he is not just the Felix who plays video games, or the Felix who do stunts. I see Felix as a Father now that he's old but back when he plays i see him as a brother/friend. I don't mean to be weird or anything. I don't have both of those so having someone like him makes me happy. He's made me happy for so many years and seeing him happy is so refreshing to see. We love you Felix️", "commenter_channel_name": "@rachelvargas5856", "likes": 85, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:07.470489", "replies_count": null, "liked_by_creator": false}, {"comment": "Felix has grown so much, I'm so proud of him and Marzia! (Bro since COD) Is nice to see him explore life, and us with them. Love your answers to the dark questions, that was a spot on answer. I used to help all of my friends with their emotions and thoughts, it required me to carry all of their suicidal intentions and attempts in the middle of the night, but I'm finally healing myself, and they all made it and live in peace knowing how to deal with that.", "commenter_channel_name": "@SKR-141", "likes": 1, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:07.507868", "replies_count": 0, "liked_by_creator": false}, {"comment": "3:03 amazing choice of a background!", "commenter_channel_name": "@1PolinaMJ", "likes": 7, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:07.542832", "replies_count": 0, "liked_by_creator": false}, {"comment": "在生活很糟糕的时候能看到pewds的视频确实是每天的一点安慰。我是一个生活里面很需要consistency的人，这些年来pewds已经成为我生活中的一个锚点，所以很感谢他能一直拍视频，一直和我们分享，能够坦诚且乐在其中。希望我们和pewds是互相陪伴。虽然不应该对content creator倾注太多感情，应该更专注于自己的生活和现实情感，但时间久了还是免不了会把pewds当做远方的朋友，也因为pewds收获了一个很好的线上社群，交到了新朋友。就像朋友也总会有渐行渐远的一天一样，哪怕pewds更新没那么频繁了，甚至有一天不再发视频了，我都依然会很珍惜pewds这些年来的陪伴，和他为我带来的一切。", "commenter_channel_name": "@tildatian0809", "likes": 45, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:07.580998", "replies_count": null, "liked_by_creator": false}, {"comment": "That's exactly what I was thinking about, honestly it is nice to be able to go out and not have ppl constantly wanting your attention etc.", "commenter_channel_name": "@hailypierce1057", "likes": 4, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:07.616034", "replies_count": 0, "liked_by_creator": false}, {"comment": "i kind of disagree with what you said about “how much can a video change you” maybe not a video but throughout the years of watching your videos, you have definitely changed my perspectives, my ambitions, mindset, relationships, & life in general. it was because of you that i started reading more and more so i guess you did technically change my life for the better. i also managed to learn more vocabularies from your videos so thank you for that !! c: i’m not dependent on you or anything, but you gave me a reason to start reading and i’ll always be grateful. this is something i will never regret ", "commenter_channel_name": "@angelinachue2410", "likes": 7, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:07.651474", "replies_count": 0, "liked_by_creator": false}, {"comment": "You remind me of my little brother. He was a silly guy and grumpy at times but always friendly with everyone. And now that he has grown he has looked at life as if he needs to just live his life and figure it out himself. Not caring who thinks about how he dresses or thinks. I've been needing to go down that path but it's hard with a family. Been taking tiny steps but thank you for being you Felix!", "commenter_channel_name": "@bananabrainzz4331", "likes": 15, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:07.686924", "replies_count": 0, "liked_by_creator": false}, {"comment": "Title should’ve been “Getting distracted in a typhoon for half an hour” XD\nThat’s cool that Pewds is going into this new chapter of his life with a positive attitude. He’s changed a lot and he’s gonna change more, but hopefully he keeps that positive attitude", "commenter_channel_name": "@KATinBLACK", "likes": 72, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:07.723582", "replies_count": null, "liked_by_creator": false}, {"comment": "Felix is literally the most relatable person, if i were to make videos like this we would most likely have the same perspective haha", "commenter_channel_name": "@nuqi", "likes": 28, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:07.758191", "replies_count": 0, "liked_by_creator": false}, {"comment": "Felix is such a cool guy, to put his sponsor at the end of the video. I always let it run regardless of being interested in it just to help him out in whatever way I can.", "commenter_channel_name": "@chamamemestre", "likes": 8, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:07.793164", "replies_count": 0, "liked_by_creator": false}, {"comment": "Love to see him more relaxed and chill when he moved, you can feel that in the questions that he answers and in his tone. I'm watching him for almost 10 years (I was 13 and now I'm 23) and I'm happy to see his joy in the things he loves.", "commenter_channel_name": "@yamhorin1715", "likes": 16, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:07.830267", "replies_count": null, "liked_by_creator": false}, {"comment": "Whether he wants it or not, Felix is a thought leader of a few generations. Young men could really learn from him.", "commenter_channel_name": "@libertylovin2359", "likes": 161, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:07.934068", "replies_count": null, "liked_by_creator": false}, {"comment": "I was really getting absorbed into this, it’s so calming to hear how at peace you are with life at the moment. Please make these more frequent or longer, I really enjoy listening to your unfiltered thoughts.", "commenter_channel_name": "@Anny-me9ny", "likes": 12, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:07.977728", "replies_count": 0, "liked_by_creator": false}, {"comment": "How can you not love this guy. More than anything you're an interesting person sharing their best life with us. I always feel like you give way more to us than we give to you!", "commenter_channel_name": "@You4Own", "likes": 306, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:08.020924", "replies_count": null, "liked_by_creator": false}, {"comment": "Tbh your Japanese sounds already good or even better than some other YouTubers living in Japan for years. Love to see you're doing well and happy Felix! Please continue to share your happiness with us.", "commenter_channel_name": "@Tz3952ii", "likes": 30, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:08.061972", "replies_count": null, "liked_by_creator": false}, {"comment": "i love how happy you sound and are. I been watching since 2011 or 12 and seeing you being so at peace makes me so happy.", "commenter_channel_name": "@MiguelGonzalez-uw5ns", "likes": 44, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:08.111414", "replies_count": null, "liked_by_creator": false}, {"comment": "This man could start a religion and I'd follow it. What a way to look at life! It's so inspiring and liberating to hear about how you dealt with problems and challenges in your life", "commenter_channel_name": "@Snoflakes_1", "likes": 6, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:08.144310", "replies_count": 0, "liked_by_creator": false}, {"comment": "Whenever i watch pewds childhood nostalgia hits hard like its crazy this guy is part of life everyday since 2014", "commenter_channel_name": "@ebbies1816", "likes": 125, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:08.185607", "replies_count": 0, "liked_by_creator": false}, {"comment": "That was so much valuable information about how to deal with my current problems that I will have to watch it again and take some notes. Yes, this video will not change my life but maybe it will slightly push me in the right direction.", "commenter_channel_name": "@kris2455", "likes": 33, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:08.222657", "replies_count": 0, "liked_by_creator": false}, {"comment": "Im not saying felix was ever a negative person but I can tell when he is frustrated about something when filming and since he moved to Japan the happier side of felix has shown up in his videos more and im happy for him :) some people miss felix old content but it is better to see his mental health thrive.", "commenter_channel_name": "@angelramic1229", "likes": 11, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:08.259527", "replies_count": null, "liked_by_creator": false}, {"comment": "I'm happy just looking at mature and fulfilled man that Felix has become. He's a very real motivation and honestly a proof that true self fulfillment exists and it's worth fighting for.", "commenter_channel_name": "@Otawee", "likes": 78, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:08.299635", "replies_count": 0, "liked_by_creator": false}, {"comment": "Proud of you and Marzia for everything you’ve accomplished, you truly are living the dream right now. So happy for you both ", "commenter_channel_name": "@livosuction5365", "likes": 62, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:08.340604", "replies_count": null, "liked_by_creator": false}, {"comment": "28:33 He thought about the brofist (: I'm so happy he did it!", "commenter_channel_name": "@gabrielaagusts9854", "likes": 5, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:08.375960", "replies_count": 0, "liked_by_creator": false}, {"comment": "Here I am, searching for pewdiepie vlogs in Japan for the second night in a row. Absolutely loving the content, I’ve learned so much. What a beautiful place.", "commenter_channel_name": "@fredarthur924", "likes": 7, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:08.409831", "replies_count": 0, "liked_by_creator": false}, {"comment": "Hearing Felix talk about philosophy just makes me feel this calmness. Having been a fan for a few years, I really like the change in content. Keep it up man.", "commenter_channel_name": "@bloodyburger6023", "likes": 12, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:08.444304", "replies_count": 0, "liked_by_creator": false}, {"comment": "I like how pweds video grow along with his audience. He doesn't need to keep up with the algorithm because there will be people who will gravitate to his videos no matter what. Thanks Pweds", "commenter_channel_name": "@nickulette", "likes": 17, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:08.478348", "replies_count": 0, "liked_by_creator": false}, {"comment": "I can see him from his eyes that he is very comfortable and happy about his Japanese life, which was not quite common when he stayed in the uk. I hope he will have a wonderful life there..", "commenter_channel_name": "@pedenpieee", "likes": 6, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:08.514654", "replies_count": null, "liked_by_creator": false}, {"comment": "I really love these chill videos. It’s always nice to hear Felix’s thoughts and see how he’s grown and progressed through the years", "commenter_channel_name": "@iamanj2", "likes": 24, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:08.550471", "replies_count": null, "liked_by_creator": false}, {"comment": "1:44 - be satisfied with doing more than the end goal\n\n\"I love it too much that i dont need to achieve it\" - t 2023\n\n\n - i started putting my hobbies and inspos in school, which overtime makes school unimportant therefore not sakop my mind\n\n\n - 3x3: things are not that important after 17 \n\n nothing is that important\n\n things are not that important\n\n - big goals\n\n law of attraction\n\n stoic , handling problems\n\n - 30 days to create habits", "commenter_channel_name": "@Uuiiai", "likes": 1, "date": "1 year ago (edited)", "fetched_date": "2025-01-19 14:14:08.587157", "replies_count": 0, "liked_by_creator": false}, {"comment": "4:40 As someone who also used to drink heavily, after I quit, I did find it more difficult to just \"have fun,\" but after a while I learned to dedicate my time to productive things that interested me like DIY projects and building things. Those always interested me before I started drinking heavily, but I didn't realize how fulfilling they were until I quit them for a while and then picked them up again when I was looking for things to keep busy with. Now, I feel like it's more fun to not be hungover and enjoy a hobby than it was to be drunk and doing stupid shit.", "commenter_channel_name": "@jacobleetech", "likes": 5, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:14:08.630182", "replies_count": null, "liked_by_creator": false}, {"comment": "Just wanted to say thanks for making this, Felix, you have no idea the power of one video at the right time. i watched this at 3am and this is really what i needed to hear. I'm struggling with nicotine/pot addiction and it's really messing me up. I get really depressed when i give into my addiction and can't beat it...i feel weak and powerless. but thanks to you I'm really looking into Buddhism and breaking the control vices have over me. i know you don't have to make these videos but i just wanted to say thanks you for doing so.", "commenter_channel_name": "@vbjr5930", "likes": 3, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:08.664511", "replies_count": 0, "liked_by_creator": false}, {"comment": "The way he just goes with the weather and keep doing his video are so chill, he really comfortable with himself here", "commenter_channel_name": "@NghiaHoang-nt4ib", "likes": 19, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:08.699041", "replies_count": 0, "liked_by_creator": false}, {"comment": "This felt like going for a walk with your big brother. So nice. So glad you're all happy", "commenter_channel_name": "@NicoleSummerProductions", "likes": 1, "date": "1 year ago", "fetched_date": "2025-01-19 14:14:08.743494", "replies_count": 0, "liked_by_creator": false}, {"comment": "This is a incredible video pewds. It's so motivational and refreshing after everything on YouTube this is just so calming and real to watch. Thank you.\n\n\n\n\n\n\nEdit- and the replies are getting boted. The state of YouTube atm.", "commenter_channel_name": "@zephyr9210", "likes": 485, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:14:08.780484", "replies_count": null, "liked_by_creator": false}, {"comment": "I am so glad felix is finally happy now and is finally where he wants to, I am so proud of where he has gone to, I'm so proud of him and marzia. that they can finally be happy and be at peace. Love to felix and Marzia and the pugs ️", "commenter_channel_name": "@duchesskeishacarreon4893", "likes": 58, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:08.825291", "replies_count": null, "liked_by_creator": false}, {"comment": "it still make me teary eyed seeing Felix living the best time of his life after all these years of his hardworks", "commenter_channel_name": "@m3dward", "likes": 34, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:08.865436", "replies_count": null, "liked_by_creator": false}, {"comment": "This video is so cool!\n\nIt’s like Felix is a close friend or relative of the viewer, and he takes them out on a calming walk&talk in nature, but it suddenly turns into a windy and rainy situation instead but they keep up the casualness and it just ends up looking really cool and spiritual in a way.", "commenter_channel_name": "@khadath1682", "likes": 5, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:08.926818", "replies_count": 0, "liked_by_creator": false}, {"comment": "After watching this Q&A with Pewds I am convinced he is going to become a wise old Japanese Sensei", "commenter_channel_name": "@willfrank1364", "likes": 56, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:08.968517", "replies_count": 0, "liked_by_creator": false}, {"comment": "Ugh that brofist hit me right in the feels. Pewds man your advice is invaluable. Hoping for more book reviews and stoicism discussion in the future", "commenter_channel_name": "@veganmama6750", "likes": 6, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:09.009111", "replies_count": null, "liked_by_creator": false}, {"comment": "Hi！I am Japanese! Thank you for loving Japan I got to know you on the news since you moved to Japan! You are very famous among Japanese people! Some Japanese people know that pewdiepie wants to live quietly in Japan, so there is a rule that you should not talk even if you find it! So please live with peace of mind I'm sorry for my poor English because I'm using Google Translate.", "commenter_channel_name": "@kisslqmbrl2811", "likes": 8, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:09.050743", "replies_count": null, "liked_by_creator": false}, {"comment": "Felix is such a nice guy! As a swede myself i look up to Felix very much, best youtuber of all time. Remember the good old days when he was farming awards in swedish youtube.", "commenter_channel_name": "@yoloman5358", "likes": 2, "date": "2 years ago", "fetched_date": "2025-01-19 14:14:09.089672", "replies_count": 0, "liked_by_creator": false}, {"comment": "I LOVE how genuine Felix is, at at the same time he's at the top of the pyramid, not that it matters but still. You always see these youtubers trying to start up beef or do something stupid for clout. Felix is just true to himself, doesn't chase fame or anything, hes just living life with marzia and edgar and maya(sry if i spelt that wrong). Its so so inspiring seriously, I think we should all just say thank you Felix...for whatever it might be but just thank you so much. We love you", "commenter_channel_name": "@juliansteyn2", "likes": 4, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:14:09.125530", "replies_count": null, "liked_by_creator": false}], "related": []}