{"code": "Jal7jd_ocL0", "title": "Setting the record straight about kids!", "url": "https://www.youtube.com/watch?v=Jal7jd_ocL0", "thumbnail_url": "https://i.ytimg.com/vi/Jal7jd_ocL0/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLDj5-mZSufq-DdVUHHXBUvC4ZI5SA", "views": 4000000, "likes": 237000, "duration": "", "embed_code": "https://www.youtube.com/embed/Jal7jd_ocL0", "uploaded_date": "20 Oct 2024", "comments_count": 6866, "comments": [{"comment": "I like that pewds is slowly starting to look exactly like his dad. The glasses and hair. It’s like a uniform", "commenter_channel_name": "@ProjectMatrix", "likes": 36000, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:24.991455", "replies_count": null, "liked_by_creator": false}, {"comment": "Björn is gonna collect languages like infinity stones.", "commenter_channel_name": "@grimmsnarlgaming4986", "likes": 20000, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:25.036465", "replies_count": null, "liked_by_creator": false}, {"comment": "11:00 The way you describe your time with your son as \"hanging out with a really cool friend\" sounds so genuine and heartwarming for some reason", "commenter_channel_name": "@Randdo32", "likes": 10000, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:25.074270", "replies_count": null, "liked_by_creator": false}, {"comment": "Shed a tear watching this. It's so cute watching Felix be a dad. So happy for you", "commenter_channel_name": "@messicomps344", "likes": 478, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:25.113566", "replies_count": null, "liked_by_creator": false}, {"comment": "As a child that grew up in a multilingual household I have a tip! My parents spoke to me in Spanish but they didn’t make me reply in Spanish so while my comprehension is good, my speaking skills are weaker. If you speak to Bjorn in your languages, make sure that he responds in the right language so he can practice speaking! \n\nAlso with him speaking Japanese in school he will catch on to the language really fast", "commenter_channel_name": "@colombiarican96", "likes": 5000, "date": "2 months ago (edited)", "fetched_date": "2025-01-19 13:13:25.150940", "replies_count": null, "liked_by_creator": true}, {"comment": "Felix's father arc is a top ten anime moment. All jokes aside, sincerely love the wholesome content and all the best to you, Marzia and your family.", "commenter_channel_name": "@ericgee198", "likes": 8000, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:25.188362", "replies_count": null, "liked_by_creator": false}, {"comment": "Felix is the definition of \"We made the right person famous\"", "commenter_channel_name": "@milkywayy2286", "likes": 17000, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:25.226929", "replies_count": null, "liked_by_creator": false}, {"comment": "Lmao the clip at 8:45 where Bjorn is chilling with a random dude is so wholesome. Already outpacing his dad's social skills, epic!", "commenter_channel_name": "@maximr1113", "likes": 232, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:25.264119", "replies_count": null, "liked_by_creator": false}, {"comment": "The Bjorn clapping as an intro to meme review NEEDS to be the canon official intro of meme review from now on, Felix! Please!", "commenter_channel_name": "@aoiuemura", "likes": 12000, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:25.309604", "replies_count": null, "liked_by_creator": false}, {"comment": "It's nostalgic to see him make a super random intro like that again", "commenter_channel_name": "@LetsbeHonestOfficial", "likes": 30000, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:25.348251", "replies_count": null, "liked_by_creator": false}, {"comment": "I was raised multilingual as a child, and it works out fine. My mom spoke her mothertongue to me and my dad his, and together they would speak english. I am now fluent in all 3, and learning new languages for me is considerably easier. I think its an awesome idea to raise Björn like that! Helps him in the long term too. :)", "commenter_channel_name": "@Alt_092", "likes": 6000, "date": "2 months ago (edited)", "fetched_date": "2025-01-19 13:13:25.386159", "replies_count": null, "liked_by_creator": false}, {"comment": "its been months since i last seen a video, honestly i started shedding a tear with how happy pewds has become over the years. I'm so grateful to have lived a childhood watching Felix. \n\nI thank you for the amazing childhood you gave me, and wish an amazing future for you Felix\n\n-Bro Army Forever", "commenter_channel_name": "@celynnec", "likes": 112, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:25.426690", "replies_count": null, "liked_by_creator": false}, {"comment": "11:05 this almost made me cry  the idea that your favorite part of having a kid is actually being able to enjoy their company. It sadly seems lost of many.", "commenter_channel_name": "@sagiren", "likes": 1000, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:25.467753", "replies_count": null, "liked_by_creator": false}, {"comment": "I love this type of videos, even after years and millions of subscribers, felix still talks with us by the \"old fashion way\" of FAQ, with everyone and everything on YouTube changing for the imo the worst, its good to see this different part where we can still talk with the creator and we know he's being honest with us", "commenter_channel_name": "@danielboy195", "likes": 2000, "date": "2 months ago (edited)", "fetched_date": "2025-01-19 13:13:25.508533", "replies_count": null, "liked_by_creator": false}, {"comment": "As a veteran parent Felix is 100% right about cocomelon. I've talked with speech therapists that have confirmed this, the big problem is the quick cuts, it doesn't give their brains time to focus on things. \n\nMy kids are old enough now to play Minecraft and the Switch has great tools where you can set time limits and I've found that the easiest way to balance,  they can budget their daily time how they want.", "commenter_channel_name": "@SpudDood", "likes": 4000, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:25.548732", "replies_count": null, "liked_by_creator": false}, {"comment": "Best honest and down to earth intro to parenting I've seen, can relate 100%. You will enjoy your bond with Björn even more when he can speak and interact more with you over the coming months, its the best feeling ever. My son is 3 next week, I am his hero and he is mine, we are best friends and he is my everything.", "commenter_channel_name": "@TheRoggan123", "likes": 52, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:25.586970", "replies_count": null, "liked_by_creator": false}, {"comment": "With all the hate and drama in every single internet corner, its SO nice and refreshing just to sit and look at positive content from Pewdiepie.", "commenter_channel_name": "@HFP94", "likes": 4000, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:25.632760", "replies_count": null, "liked_by_creator": false}, {"comment": "Bjorn will grow up having the intelligence and charisma of both his parents.\n\nThis kid's gonna topple empires.", "commenter_channel_name": "@mistermadness677", "likes": 3000, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:25.670078", "replies_count": null, "liked_by_creator": false}, {"comment": "10 years ago, we wouldn’t expect Felix to become this responsible of a father. Time flies pretty fast.", "commenter_channel_name": "@dyecast8304", "likes": 1000, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:25.707116", "replies_count": null, "liked_by_creator": false}, {"comment": "As someone who will never have kid and don't like being around them for long, I still love seeing the pew family evolve and I look forward to seeing Björn grow up", "commenter_channel_name": "@MladejjBlbejj", "likes": 12, "date": "1 month ago", "fetched_date": "2025-01-19 13:13:25.742172", "replies_count": 0, "liked_by_creator": false}, {"comment": "As someone that was emotionally neglected as a child, seeing soft parenting content is healing to the soul. More gentle love needs in this world ", "commenter_channel_name": "@phoxmoonchild", "likes": 1000, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:25.780286", "replies_count": null, "liked_by_creator": false}, {"comment": "12:34 I remember Pewds in one of his meme review videos complaining about baby crying, saying it really irritated him and made him mad. I love that he's finally connecting with them now.", "commenter_channel_name": "@Zood94", "likes": 1000, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:25.818337", "replies_count": null, "liked_by_creator": false}, {"comment": "I feel like the way his dad approached parenting, having the strength and patience to just sit down and have a talk instead of telling off harshly- has shaped Pewds A LOT. Thank you Felix's dad <3 And well done Felix you're becoming such a great dad <3", "commenter_channel_name": "@bananamuffins582", "likes": 534, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:25.861938", "replies_count": null, "liked_by_creator": false}, {"comment": "I got chills with this video. I TOTALLY agree. I just do not understand how people like the newborn phase. It is so difficult with not much reward (except caring for your kids needs). Now, having fun together as a family and seeing the toddler’s personality develop is so special. Every day is just amazing.", "commenter_channel_name": "@CPMom83", "likes": 10, "date": "1 month ago", "fetched_date": "2025-01-19 13:13:25.896839", "replies_count": 0, "liked_by_creator": false}, {"comment": "My husband and I have been watching Felix’s videos since we started dating until now with the arrival of our baby. Now, as parents, watching this video feels especially meaningful.", "commenter_channel_name": "@chihchihlin", "likes": 967, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:25.934145", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewds, Im an alumni of the British School in Tokyo. Its very diverse, you are taught Japanese and the English curriculum. They have nursery up until sixth form. There were a lot of famous people’s kids there and Ive never seen them get bothered or harassed. I recommend BST.", "commenter_channel_name": "@emmacavalier", "likes": 1000, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:25.972209", "replies_count": null, "liked_by_creator": false}, {"comment": "\"simping for my child\" is the most wholesome use of simp in internet history. brofist from one dad to another ", "commenter_channel_name": "@bamzilla1616", "likes": 457, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.009952", "replies_count": null, "liked_by_creator": false}, {"comment": "Just gave birth 3 months out here in Japan as well. Anything my baby does that's new is so mesmerizing. It makes me tear up to see her learn the basics and notice her brain developing. ", "commenter_channel_name": "@ninacruzz3103", "likes": 12, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.046069", "replies_count": 0, "liked_by_creator": false}, {"comment": "17:28 Bjorn hits the jotaro pose and felix is like star platinum.", "commenter_channel_name": "@redwansaiem8969", "likes": 707, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.085409", "replies_count": null, "liked_by_creator": false}, {"comment": "9:43 i genuinely teared up at this part, it’s so incredible and heartwarming to see felix so happy about having his family <3", "commenter_channel_name": "@plum.phobia", "likes": 630, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.123458", "replies_count": null, "liked_by_creator": false}, {"comment": "17:35 \"I've simped for my child this entire video\" felt spot on and it said a lot about your good parenting instincts. Well done, Felix (& Marzia)... well done!", "commenter_channel_name": "@playerzerothree9008", "likes": 384, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.159321", "replies_count": 0, "liked_by_creator": false}, {"comment": "Felix and I had our kids at the same time, hearing him talk about the infant phase and how every new thing your child does just blows your mind is really cool. I just had my second kid three weeks ago and it’s very strange how different things are this time around", "commenter_channel_name": "@graymangaming581", "likes": 10, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.195444", "replies_count": 0, "liked_by_creator": false}, {"comment": "Teach Bjorn some sign language! We did with our youngest two and it really helped cut down on fussing and trying to figure out what is wrong when they get upset. They may not be able to say what is wrong, but like you said, he can understand your questions, and they catch on surprisingly fast to signing. Eat, drink, more, all done, change, sleep, bath, please, and thank you are all great signs to start with!", "commenter_channel_name": "@KomanderKain", "likes": 338, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.232089", "replies_count": null, "liked_by_creator": false}, {"comment": "This feels like Friday with Pewdiepie all over again, answering fan questions and all that.", "commenter_channel_name": "@SirTalksAlot", "likes": 335, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.269368", "replies_count": null, "liked_by_creator": false}, {"comment": "Idk how pewds could get funnier...and then he had a kid. Im looking forward to 90 more years of pewdiepie", "commenter_channel_name": "@mastershep11n74", "likes": 430, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.306518", "replies_count": null, "liked_by_creator": false}, {"comment": "Yo, I just want to thank you for being a positive influence for young men, and young women. You and your wife seem to be an awesome couple and it’s brings hope back to humanity seeing someone like you showing people how awesome a family can be.", "commenter_channel_name": "@Motard.Actual", "likes": 6, "date": "1 month ago", "fetched_date": "2025-01-19 13:13:26.342179", "replies_count": 0, "liked_by_creator": false}, {"comment": "First Pewd vid ive watched in 2 years. Glad he still knows how to film videos! good quality", "commenter_channel_name": "@bloodthirstyiv8177", "likes": 1000, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.379175", "replies_count": null, "liked_by_creator": false}, {"comment": "Bjorn is in such fun stages of development! This is when he becomes more self-aware and also when he starts being more receptive to language, even though he may not be able to say much, he understands more than you may realize. I loved watching all the different milestones as my son grew up. Seems like yesterday, but now he's almost 14 so enjoy every single second- even when it may be a rough day.", "commenter_channel_name": "@katelyna2302", "likes": 144, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.414984", "replies_count": null, "liked_by_creator": false}, {"comment": "Starting out with a flashbang, nice", "commenter_channel_name": "@blankbudder", "likes": 3000, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.451216", "replies_count": null, "liked_by_creator": false}, {"comment": "I like how u vlog with ur son because really ur just showing hey we did this today instead of forcing him to perform for the camera, and it's really cool seeing little clips of u guys doing stuff together. U guys are just so wholesome, and I love watching how much u guys have grown together.  My son is about to turn 2 I stopped posting him on any of my social platforms because there are too many creeps out there for my own comfort. I hope all goes well with u guys ", "commenter_channel_name": "@allonnafreed1572", "likes": 9, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.486429", "replies_count": 0, "liked_by_creator": false}, {"comment": "As a person learning 3 languages basically since birth, I can confirm that the both parents speaking different languages is the best strat but (speaking from experience) I would recommend letting Björn watch japanese movies or yt videos ( I technically taught myself English better than school by watching Minecraft videos like the og pewdiepie series)", "commenter_channel_name": "@revioli532", "likes": 412, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.524560", "replies_count": null, "liked_by_creator": false}, {"comment": "11:30 \"People forget what having a child was like after 2 years\"  Humans HAD to evolve that way.  If people remembered how hard it was to have a child after 2 years, they'd never have another one.", "commenter_channel_name": "@originaldarkwater", "likes": 294, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.562331", "replies_count": null, "liked_by_creator": false}, {"comment": "Growing in a multilingual environment is awesome ! When you're a kid, you just absorb everything easily, i grew up with a father speaking Greek, a mother speaking French and lot of English people too.\nAnd now I speak fluently 3 languages and I love it, it's like a superpower :D", "commenter_channel_name": "@davidpouet1372", "likes": 135, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.597616", "replies_count": null, "liked_by_creator": false}, {"comment": "it's a warming site to see a fathers perspective of his child/children. My dad and I didn't have the best relationship while i was growing up and there's a lot of trauma behind it, but I've also grown to understanding that it's based on the environment, and whether or not my dad did good or bad things as methods to raise me, he did things out of what he believed was best for me. Everyone's a different person, and there's a part of me that still wishes I could've been the son my dad tried to shape me into being, but i know that my dad is proud of my progress. I am in the worst shape mentally and physically in my life but hearing my dad tell me that he's there for me has been very touching.", "commenter_channel_name": "@elloguzzla", "likes": 1, "date": "1 month ago (edited)", "fetched_date": "2025-01-19 13:13:26.631854", "replies_count": 0, "liked_by_creator": false}, {"comment": "its also important to point out felix and marzia have a more unique situation compared to the average parent where they can devote 24/7 to care of a child while most families have to balance work on top of it, so they can spend way more time stressing/researching things compared to the average parent since its the most important thing for them in the moment. Not having to work and just can spend all day with the kid is a unique situation this day in age and probably the people he is asking these questions to probably weren't the ones having to worry about it cause they would work while mom/dad stayed home to take care of the kid and faced those hurdles.", "commenter_channel_name": "@Notaforumguy007", "likes": 559, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.669112", "replies_count": null, "liked_by_creator": false}, {"comment": "for what you said at 5:40 about coco mellon, i came across a video a while back that goes into depth on why cocomelon is horrible for a childs development and actually stunts their mental capacity.", "commenter_channel_name": "@MidnightPandaGames", "likes": 379, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.706221", "replies_count": null, "liked_by_creator": false}, {"comment": "6:19 that is such a good advice \n\nLetting kids enjoy things without any stress of time limits, cause if the kid knows to balance multiple activities they subconsciously make a time limit for themselves", "commenter_channel_name": "@Justme-kd9qy", "likes": 120, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.742310", "replies_count": 0, "liked_by_creator": false}, {"comment": "Such a wholesome video. Love hearing him talk about his child with so much genuine happiness.", "commenter_channel_name": "@NicholasAdelman", "likes": 5, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.777475", "replies_count": 0, "liked_by_creator": false}, {"comment": "“It’s like hanging out with a really cool friend” THIS IS PRECIOUS ️", "commenter_channel_name": "@notsostellar", "likes": 46, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.813761", "replies_count": 0, "liked_by_creator": false}, {"comment": "as a 19 yr old daughter who grew up with an emotionally unavailable, selfish father with anger issues, seeing Felix so genuinely excited about being a dad just seems so unusual. Like, was it this easy for my father to actually love me?", "commenter_channel_name": "@sukivampire", "likes": 2000, "date": "2 months ago (edited)", "fetched_date": "2025-01-19 13:13:26.850995", "replies_count": null, "liked_by_creator": false}, {"comment": "Watching your face light up when you even think of your family is so amazing. Everything you said about parenting is absolutely true. My favorite advice advice I love to share with new parents, that feeling you get when you see them sleep, that angelic warmth never goes away. Ever. They can be teenagers and that sleeping face still rights the world. Enjoy every second, thank you sharing  it.", "commenter_channel_name": "@twistedkris7036", "likes": 170, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.888549", "replies_count": null, "liked_by_creator": false}, {"comment": "Going from watching my first PewDiePie video being from his Bully series so many years ago to now him being married and being a father feels so surreal as an experience, he's grown so much and he's given such a good impact on the youtube community.", "commenter_channel_name": "@atlasknights7145", "likes": 3, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.924056", "replies_count": 0, "liked_by_creator": false}, {"comment": "\"When you become a parent, you're forced to become an expert\" Honestly? Such a real line even though it was probably meant as a joke.", "commenter_channel_name": "@andyyistired", "likes": 273, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.961748", "replies_count": null, "liked_by_creator": false}, {"comment": "Advice from one dad to another. There's be times when you need 20 minutes. Don't feel crappie about it. Just because you're caring for someone else doesn't mean you need to forget about yourself. All the best", "commenter_channel_name": "@Mayo501", "likes": 94, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:26.997178", "replies_count": 0, "liked_by_creator": false}, {"comment": "Honestly we need more men like Felix being a good example of what fatherhood should look like. His total adoration and commitment to every aspect of raising Bjôrn is so heartwarming. And I wish more people (mem especially) had the same level of pride in becoming a parents! and these two.. they clearly love being parents and that sweet baby wil cherish these videos of watching his mom and dad fall in love with him and life changing jorney of parenthood ", "commenter_channel_name": "@lala_lakeypoo", "likes": 56, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:27.032818", "replies_count": 0, "liked_by_creator": false}, {"comment": "as a 32-year-old mom of 2 toddlers who has been watching you for yearrrrrs, i feel so seen lol. happy for you, man", "commenter_channel_name": "@talonandtealeaves", "likes": 4, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:27.068417", "replies_count": 0, "liked_by_creator": false}, {"comment": "Felix making his own heaven up in here ", "commenter_channel_name": "@thejesuschrist", "likes": 616, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:27.106145", "replies_count": null, "liked_by_creator": false}, {"comment": "I’m also a new Dad my boy turn 1 not to long ago, I am going through most experiences that Felix is going through. The way I like to put it, it’s like Christmas all year around. Seeing them develop and doing simple tasks that we do all day and not thinking about is like a huge milestone for them and you feel sooooo proud , it’s crazy. I’ve never felt this way before until I had my boy! Definitely the best feeling on earth!", "commenter_channel_name": "@2Good_14", "likes": 32, "date": "2 months ago (edited)", "fetched_date": "2025-01-19 13:13:27.141702", "replies_count": 0, "liked_by_creator": false}, {"comment": "7:07 omfg I hope you'll say you're proud of him like this all his life", "commenter_channel_name": "@eliott761", "likes": 65, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:27.177358", "replies_count": 0, "liked_by_creator": false}, {"comment": "I’m due in June after us struggling with losses for two years. We are so excited to be parents and it’s been so exciting to see your journey. To see you speak honestly about your experiences and share that things are hard but completely worth it is so assuring, also to just have faith in yourself to make choices in the best interests of the family. You’ve grown a lot over the last few years in many ways but since expanding your family your change is noticeable and great! It’s been fun to grow up along side you Felix!", "commenter_channel_name": "@AshtonR-j7h", "likes": 1, "date": "1 month ago", "fetched_date": "2025-01-19 13:13:27.213286", "replies_count": 0, "liked_by_creator": false}, {"comment": "The video title scared the hell out of me", "commenter_channel_name": "@CoolScratcher", "likes": 1000, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:27.250965", "replies_count": null, "liked_by_creator": false}, {"comment": "I can't wait to see the Bjorn Minecraft series", "commenter_channel_name": "@DeathByZombieGames", "likes": 89, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:27.286791", "replies_count": 0, "liked_by_creator": false}, {"comment": "6:14 I can actually not wait for the Felix & bjorn minecraft lets play", "commenter_channel_name": "@VygoUwU", "likes": 129, "date": "2 months ago (edited)", "fetched_date": "2025-01-19 13:13:27.326583", "replies_count": null, "liked_by_creator": false}, {"comment": "13:45 this approach to parenting is actually the key to world peace.", "commenter_channel_name": "@JingleJoe", "likes": 22, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:27.362230", "replies_count": 0, "liked_by_creator": false}, {"comment": "\"How to Raise a Viking\" XD 0:41", "commenter_channel_name": "@Kas1122", "likes": 212, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:27.399538", "replies_count": null, "liked_by_creator": false}, {"comment": "6:39 dang I didn't know Björn was such a homie respect", "commenter_channel_name": "@pastapositto3007", "likes": 68, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:27.438562", "replies_count": null, "liked_by_creator": false}, {"comment": "5:14 that helicopter sound is prolly the best asmr\nI need a 1hour version of this", "commenter_channel_name": "@ashborn____", "likes": 53, "date": "2 months ago (edited)", "fetched_date": "2025-01-19 13:13:27.474039", "replies_count": 0, "liked_by_creator": false}, {"comment": "These videos always make me cry, truly love watching Felix grow and its very heartwarming. From childhood to adulthood he's been here and feel good about the future because he's here.", "commenter_channel_name": "@mello2184", "likes": 2, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:27.510139", "replies_count": 0, "liked_by_creator": false}, {"comment": "Dude the fact that you're stressing about taking good care of your family and your kid shows that you're a good father. It''s natural, and you're doing great man. Congrats on everything!", "commenter_channel_name": "@Turbo187KillerB", "likes": 29, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:27.545884", "replies_count": 0, "liked_by_creator": false}, {"comment": "The \"seeing life with a brand new set of eyes\" after having a kid is really so spot on. My kiddo is my best friend and it really does change your life. For some kids aren't for them and that's great but my kiddo definitely saved my life i feel so blessed to become a parent.  thank you for this felix. What a beautiful video being able to watch you be so proud to be a Father.", "commenter_channel_name": "@ToxicBloodScourge", "likes": 26, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:27.583067", "replies_count": 0, "liked_by_creator": false}, {"comment": "15:00  Glad Felix said this, a lot of people who have children are often dismissive of childfree by choice folks.  So lovely to see him in his dad era!", "commenter_channel_name": "@becki8000", "likes": 160, "date": "2 months ago (edited)", "fetched_date": "2025-01-19 13:13:27.619206", "replies_count": 0, "liked_by_creator": false}, {"comment": "Wow it’s been a long time since I’ve watched your videos. It’s weird, but I’m strangely so proud!! You two are doing such an awesome job raising your son, I’m so excited for yours and Marzia’s parenting journey and for who Björn is going to become", "commenter_channel_name": "@cro.artwork", "likes": 1, "date": "13 days ago", "fetched_date": "2025-01-19 13:13:27.654119", "replies_count": 0, "liked_by_creator": false}, {"comment": "You bring such positive energy and always glowing! :)", "commenter_channel_name": "@Psych2go", "likes": 229, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:27.692573", "replies_count": null, "liked_by_creator": false}, {"comment": "Very cool that you want to keep Bjorn off camera after a certain point. Look forward to what vlogs we have left", "commenter_channel_name": "@typicallynotawake9911", "likes": 77, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:27.729081", "replies_count": 0, "liked_by_creator": false}, {"comment": "Im on my second. My wife and I became cloee in middle school literally watching your videos. We would watch you through high school and even now into adulthood. And man im not going to lie. Your words have made me take a breath as a father. Ive been so nervous about my actions but it all feels  so much better. You have touched more lives than you can ever know. You are apart of houses you'll never think of. But you are easily one of the best people ive never met.", "commenter_channel_name": "@josephramirez3798", "likes": 110, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:27.764587", "replies_count": 0, "liked_by_creator": false}, {"comment": "I agree with EVERYTHING you said Felix. About parenting. Everything. The infant phase was so stressful I actually had PTSD and severe anxiety for two years afterwards. I agree also, having your kid grow and being able to do things with them makes the relationship so much more rewarding. Maybe I was an atypical mother, but for me there was nothing relaxing, natural or fulfilling about the infant stage. Things make a lot more sense and feel way more natural and instinctive now that my child is 3 and can talk fluently and ask questions.\n\nLoved the video!", "commenter_channel_name": "@kaisumaria", "likes": 2, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:27.799051", "replies_count": 0, "liked_by_creator": false}, {"comment": "We love pewds hes legit our childhood first time watching him in like a year or sum", "commenter_channel_name": "@B3ANfps", "likes": 66, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:27.834461", "replies_count": 0, "liked_by_creator": false}, {"comment": "15:36 shinzo abe possessed him there for a sec", "commenter_channel_name": "@Kay-Hiwatari", "likes": 29, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:27.870467", "replies_count": 0, "liked_by_creator": false}, {"comment": "As someone who went to an international school in a country I wasn't born in, here are some (unsolicited) pros and cons you might consider for Bjorn (of course experiences vary depending on the individual school):\n- pros: not simply speaking English fluently, but learning it academically (this makes a huge difference imo especially from high school onwards); it may be mostly Japanese kids but many will have dual citizenship, and there will be other foreigners, so it will still be a more multicultural, heterogeneous experience; a private American/British education (healthier approach to studies imho); better facilities.\n- cons: might be somewhat removed from local culture (unless he hangs out with Japanese Japanese kids), stuck in a kind of international bubble; kids are usually rich and spoiled; expensive tuition.", "commenter_channel_name": "@eun-solkim7080", "likes": 29, "date": "2 months ago (edited)", "fetched_date": "2025-01-19 13:13:27.906555", "replies_count": 0, "liked_by_creator": false}, {"comment": "1:53 so now he's telling us that Pewdiepie was Felix Kjelberg ALL ALONG!!???!?", "commenter_channel_name": "@burnt_nard", "likes": 280, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:27.975081", "replies_count": null, "liked_by_creator": false}, {"comment": "The cam being effed up on the biggest youtube channel would never tire me", "commenter_channel_name": "@Popotato7777", "likes": 65, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:28.010632", "replies_count": 0, "liked_by_creator": false}, {"comment": "12:45 I believe that part of this is the child being brought up well enough for them to know themselves that they did something \"bad\". At that point of feeling guilty, having time to themselves becomes productive. The parent coming in to guide their emotions at the perfect time makes for amazing growth in social intelligence. It's truly a beautiful thing.\n\nFelix, keep doing what you're doing and all the love to you and your family ", "commenter_channel_name": "@GreenT_LoR", "likes": 12, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:28.046649", "replies_count": 0, "liked_by_creator": false}, {"comment": "Bjorn is just so adorable, I love watching your family grow and be happy", "commenter_channel_name": "@THEqueenspringday", "likes": 1, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:28.082707", "replies_count": 0, "liked_by_creator": false}, {"comment": "I first discovered your content through your Stoicism and philosophy videos a few years ago. At the time, I was going through a rough patch, stuck in a deep nihilistic depression, and studying philosophy—especially Stoicism—was a huge help. Since then, I’ve grown to really appreciate your outlook and attitude toward life. In a way, you’ve felt like an older brother figure to me (without wanting to sound too para-social), especially since I grew up with three sisters and an often-absent father.\n\nNow, as I approach my thirties and have a son of my own, who’s about to turn one, your advice and insights resonate even more. Thank you for sharing your experiences, and I wish you and your family all the best.", "commenter_channel_name": "@ataraxiafpv", "likes": 9, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:28.118522", "replies_count": 0, "liked_by_creator": false}, {"comment": "Really happy to see you coming into fatherhood the same way I did in 2021. We had our 2nd almost the same time Bjorn was born and I can easily say the toddler phase is my favourite. Sure, they got up to way more trouble, but they're also way more communicative and you can actually do stuff with them! It's so incredible witnessing how much they understand before they can answer back in words.", "commenter_channel_name": "@Atticus113", "likes": 14, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:28.166944", "replies_count": 0, "liked_by_creator": false}, {"comment": "Man, you hit the nail on the head with watching our child learn and hanging out with them. \n\nMy favorite memories are seeing my child learn things and evolve. It’s so cool to see something click in their head when they finally figure something out. It’s also fun hanging out with your child. It truly is like having a really cool best friend to hang out with. I love it.", "commenter_channel_name": "@XandeRToXic", "likes": 12, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:28.209331", "replies_count": 0, "liked_by_creator": false}, {"comment": "mr pewdiepie, you were my childhood, it’s weird seeing you semi retired but i hope the best for you and your family. take care bro  love you man", "commenter_channel_name": "@xxdragonkiller57xx82", "likes": 4, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:28.248533", "replies_count": 0, "liked_by_creator": false}, {"comment": "whenever i watch pewds i feel this nostalgic trip going on in my head, used to watch you since amnesia days,  have watched almost everyday since. watching pewds is a constant reminder of my childhood and all my happy days! feels genuinely happy to see him be a great dad! always seemed like a big bro to me whenever i watched you since i was 14!", "commenter_channel_name": "@saatviksingh", "likes": 7, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:28.283490", "replies_count": 0, "liked_by_creator": false}, {"comment": "playing Minecraft with my son are some of the best memories I have with him so far, I think he was 7 when we started, it was the pandemic and we were mostly locked indoors. We played Minecraft for hours and it was really nice to create all sorts of buildings and things together, trying to navigate through the nether etc.", "commenter_channel_name": "@mr.hgorgan1812", "likes": 11, "date": "2 months ago (edited)", "fetched_date": "2025-01-19 13:13:28.320798", "replies_count": 0, "liked_by_creator": false}, {"comment": "Feels incredibly surreal. I’ve been a fan since 2012 and to see you be a father (an amazing one at that) and for myself to have just gotten married last month and thinking about when to have children is insane. If 12 year old me realised I’d still be watching pewds AND seeing his family blossom… crazy. However long you do this whole YouTube thing, glad to have been here for so many milestones in your life ️", "commenter_channel_name": "@charlottebrodie3296", "likes": 9, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:28.359139", "replies_count": 0, "liked_by_creator": false}, {"comment": "You and Marzia are great parents  Being a great parent is never ending, even as they get older!", "commenter_channel_name": "@lisalovleyu3757", "likes": 31, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:28.429426", "replies_count": 0, "liked_by_creator": false}, {"comment": "I’ve been watching your videos since 2016, I wasn’t really expressive growing up and your videos gave me the idea to start making videos and learn to express myself more and be confident.\n\nIt’s really satisfying how you grew in span of 8 years.\nfrom silly gamer youtuber to a great Husband/Dad", "commenter_channel_name": "@MikiSlicky", "likes": 21, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:28.468295", "replies_count": 0, "liked_by_creator": false}, {"comment": "Popularity, Family, Passion, Felix Kjellberg acquired this and everything else Youtube had to offer. His retiring words drove countless people to Youtube but none could match him.", "commenter_channel_name": "@Zero-c5v", "likes": 18, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:28.505818", "replies_count": 0, "liked_by_creator": false}, {"comment": "I haven't always been on tracked of Felix's videos, but I see his from time to time, rarely or just sometimes. I love how there's always something to learn especially when youre going through adulthood and I felt like they were there as I grew up, Markiplier was another one, I literally grew up along the years with watching ther videos sometimes while I eat, after school, and now that he is a parent (also saw that he was married years before) I'm just glad he has made it this far. And now that I'm in college, even though I may miss some of his videos, or I get pulled in by new creators, I still appreciate those moments I had to face battles everyday especially during high school, something about watching their videos made me feel like I wasn't alone.", "commenter_channel_name": "@itsdavidarries", "likes": 2, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:28.542654", "replies_count": 0, "liked_by_creator": false}, {"comment": "My son is about as old as bjorn is. Glad one of my favorite youtubers has, and is going through all the same thoughts and experiences as i am right now. You're doing great pewds", "commenter_channel_name": "@Vinchenzo2k1n", "likes": 13, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:28.580163", "replies_count": 0, "liked_by_creator": false}, {"comment": "Felix, you've been someone that I looked up to for a long long time, and seeing you talk about how things are going, makes me incredibly happy. It's heartwarming to see you, Marzia, and Bjorn enjoying life together, and looking back up to now, you three deserve it. All the best and all the warmth to you, good sir!", "commenter_channel_name": "@BlushyVT", "likes": 14, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:28.617268", "replies_count": 0, "liked_by_creator": false}, {"comment": "Been watching from the beginning, and having had Felix be such a big part of my childhood/young adulthood, it’s crazy to now relate to parenthood & the experience of growing a little human (my baby boy Alex is now 3!)\nCompletely agree that it’s continued to become more fun & easier as he’s grown older for us as well.\n\nKnew you’d be such a good dad & love seeing you just genuinely enjoy life. \n\nSending your beautiful little family love from the US ", "commenter_channel_name": "@allicarter1317", "likes": 10, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:28.656710", "replies_count": 0, "liked_by_creator": false}, {"comment": "I just watched this video after not watching pewdiepie for years since i was 12 he used to be such a big part of my childhood and now he has a kid is a sobering thought.", "commenter_channel_name": "@ChasePotts-w5z", "likes": 4, "date": "2 months ago", "fetched_date": "2025-01-19 13:13:28.694999", "replies_count": 0, "liked_by_creator": false}], "related": []}