{"code": "MJDtQTTAogk", "title": "I Drew Every Day for 100 DAYS!", "url": "https://www.youtube.com/watch?v=MJDtQTTAogk", "thumbnail_url": "https://i.ytimg.com/vi/MJDtQTTAogk/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLAlm6R4m_5TpYRNUbSkxbS3x6gbFw", "views": 7000000, "likes": 610000, "duration": "", "embed_code": "https://www.youtube.com/embed/MJDtQTTAogk", "uploaded_date": "31 Jan 2024", "comments_count": 18699, "comments": [{"comment": "#ad - Get exclusive NordVPN deal here ➵ https://NordVPN.com/pewdiepie It’s risk free with Nord’s 30 day money-back guarantee!", "commenter_channel_name": "@PewDiePie", "likes": 3000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:47.873034", "replies_count": null, "liked_by_creator": false}, {"comment": "Retired pewdiepie era is one of the most comforting things i see in yt now. Especially his vlogs with his wife and kid.", "commenter_channel_name": "@Viridi4n-w2c", "likes": 13000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:47.937188", "replies_count": null, "liked_by_creator": false}, {"comment": "I love seeing Felix trying out something new and finding new interests. Much love!", "commenter_channel_name": "UCNARIaNYb5IDhP6V2z8Bomg", "likes": 43000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:47.973423", "replies_count": null, "liked_by_creator": false}, {"comment": "seeing him say things like “i was too scared to add color” or “you may not see the improvement but i can tell” is just so refreshing to hear people actually say since i think at one point every artist has said it. you’re really improving at a crazy rate! its so cool to see someone get into art and drawing. maybe you can try getting into drawing backgrounds/scenery then apply it to one of your character drawings :) good luck!!!!", "commenter_channel_name": "@kirbz_zz7606", "likes": 5000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:48.016064", "replies_count": null, "liked_by_creator": false}, {"comment": "This video helped me realise that I just can't be good at drawing by just looking at other people doing it and forcing myself the thought of \"I like art\", or \"I like drawing\". I understand now that I'm supposed to be ENJOYING what I truly like. I guess I'm more comforted now that I know this instead of thinking everyday that I'm just embarrassing myself by drawing something that doesn't reach my expectations. Thank You!", "commenter_channel_name": "@kordude4649", "likes": 1000, "date": "8 months ago", "fetched_date": "2025-01-19 13:29:48.060517", "replies_count": null, "liked_by_creator": false}, {"comment": "\"I fear not the man who has drawn 10,000 things once, but I fear the man who has drawn an anime girl 10,000 times.\"", "commenter_channel_name": "@bunburried64", "likes": 17000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:48.098059", "replies_count": null, "liked_by_creator": false}, {"comment": "Overwhelmed by the support, not sure what to say! THANK YOU ", "commenter_channel_name": "@PewDiePie", "likes": 20000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:48.134712", "replies_count": null, "liked_by_creator": false}, {"comment": "“I drew that one but I was too scared to actually commit to coloring it cuz I thought i would ruin it.” This is one of the most relatable sentences I’ve ever heard. Love how you improved each day Felix!", "commenter_channel_name": "@SpiritSpiked", "likes": 3000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:48.171189", "replies_count": null, "liked_by_creator": false}, {"comment": "“40 days to draw something I like again”\nThat’s the most relatable shit I’ve ever heard. As an artist with other artist friends the perfectionism, imposter syndrome, and the self doubt are pretty par for the course. I am so impressed with your progress and respect the dedication to the 100 days of sketches. I’ve tried to do something like that but couldn’t make the time to commit to it.", "commenter_channel_name": "@ulfurkjalkur5165", "likes": 732, "date": "9 months ago", "fetched_date": "2025-01-19 13:29:48.207852", "replies_count": null, "liked_by_creator": false}, {"comment": "this is actually really motivational. the part where you made so much progress then felt u were bad again is super relatable in general with everything new too!", "commenter_channel_name": "@yumis_cells", "likes": 1000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:48.247293", "replies_count": null, "liked_by_creator": false}, {"comment": "Bruh you’re pewdiepie you grew a whole generation , you don’t “fish for compliments” it makes us happy that you’re doing other things with your life", "commenter_channel_name": "@Abdaljawadsakka", "likes": 5000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:48.286088", "replies_count": null, "liked_by_creator": false}, {"comment": "As an artist who is drawing since toddler age and now studies art at university, your improvement is INSANE! It took me at least 5 years to get from my beginner level to your level now, still improved since then and still doing now. Huge respect!\nEdit: since everyone is so worried about my skill apparently, I improved very slowly in my early teenage years, where I also haven't drawn everyday or even every week. I also drew mostly anime. Things change yk", "commenter_channel_name": "@gojo9442", "likes": 1000, "date": "11 months ago (edited)", "fetched_date": "2025-01-19 13:29:48.326526", "replies_count": null, "liked_by_creator": false}, {"comment": "A tip i heard a long time ago thats stuck with me, is to never scribble out the art your don’t like, instead write next to it what bothers you. For me it tends to be the eyes, nose, or even the pose. And writing that down can help you realize what you need to look into or what references could help you like your art more.\n\nAlso its really cool seeing someone try to learn art, i dont see many people record their growth like this, its nice.\n\nEdit: other things you can do is use sticky-notes to cover a mistake and try again. I dont do that as often but ik people who do", "commenter_channel_name": "@VoidedBunnie", "likes": 135, "date": "7 months ago (edited)", "fetched_date": "2025-01-19 13:29:48.365585", "replies_count": null, "liked_by_creator": false}, {"comment": "The addition of Colors was absolutly mind blowing. The fact that you can see the slow progression in the pencil drawings and then the sudden mastery of color in just a handfull of drawings is crazy! \nGreat work Felix!", "commenter_channel_name": "@34zporlier10", "likes": 986, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:48.406348", "replies_count": null, "liked_by_creator": false}, {"comment": "as an artist, I see it as an absolute win, the funny guy I watched when I was a kid, and was learning drawing for architecture university, now my favorite YT-ber has grown with me, got through a lot, changed, got married, and now he even has passion for art as I do. I wish you the best on this art journey, Felix, and never give up!", "commenter_channel_name": "@SuzukiChen", "likes": 1000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:48.444671", "replies_count": null, "liked_by_creator": false}, {"comment": "As an artist I'm legitimately SHOCKED by how fast you've improved, please keep going! This is fascinating to see. I also really like that you're being transparent about which ones were done without reference and which ones were done with reference, sometimes even showing the original drawing or photo you used. You're doing great, seriously, I bet next time there's a new GFUEL Pewdiepie flavor you'll end up drawing the promo art.", "commenter_channel_name": "@EnzoDraws", "likes": 508, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:48.486799", "replies_count": 0, "liked_by_creator": false}, {"comment": "ive been struggling with art block and watching this reminded me why i love art so much. i got so caught up in trying to do the best i possibly could that i forgot how fun it is to just draw. how much fun i had in my first few years doing it and the joy i got from learning and progressing. I hope i can find that joy again soon :)", "commenter_channel_name": "@Kris-jr9yw", "likes": 44, "date": "8 months ago", "fetched_date": "2025-01-19 13:29:48.522978", "replies_count": 0, "liked_by_creator": false}, {"comment": "Seeing Felix's progression from screaming at barrels to a father with a happy family who dabbles into his artistic side is so beautiful. You'll always be number one in heart.", "commenter_channel_name": "@fiddlediddle8640", "likes": 746, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:48.558703", "replies_count": null, "liked_by_creator": false}, {"comment": "As someone who has been drawing for 2 years now, I am in complete awe by your improvement, not even my 2 years worth of practice can be compared with how much you've improved. It was even hard for me to watch the whole video without being shocked every time you turn a page. You have genuinely inspired me to practice harder, Kudos to you Felix!", "commenter_channel_name": "@fernkai", "likes": 1000, "date": "11 months ago (edited)", "fetched_date": "2025-01-19 13:29:48.595445", "replies_count": null, "liked_by_creator": false}, {"comment": "As someone who's drawn for over 2 years in a casual manner, I am honestly so impressed by this pace of improvement. Like, genuinely shocked, actually. Ive never seen someone improve in art like that in around 2 and a half months. Amazing", "commenter_channel_name": "@neeevirus", "likes": 1000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:48.632771", "replies_count": null, "liked_by_creator": false}, {"comment": "this was so wholesome that it made me cry. i've been ignoring my passions due to lack of skill to others, and this inspired me to start those things again. i love this new content- thank you pewds!", "commenter_channel_name": "@raindrops_keepfalling4331", "likes": 29, "date": "7 months ago", "fetched_date": "2025-01-19 13:29:48.667922", "replies_count": 0, "liked_by_creator": false}, {"comment": "6:00 The self-modeling for the anime girl poses killed me man, I love this guy", "commenter_channel_name": "@lorenzoserrano", "likes": 1000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:48.705016", "replies_count": null, "liked_by_creator": false}, {"comment": "“You can’t tell a massive difference” \nMe literally flabbergasted, jaw droppingly amazing!", "commenter_channel_name": "@YuriyZakk", "likes": 8000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:48.742448", "replies_count": null, "liked_by_creator": false}, {"comment": "Nice progress, it's inspiring to see what you can achieve when you stick at something long enough. I'd love to see your drawings in a year or two, you've already improved so much dude.\nTime to get some Copics!", "commenter_channel_name": "@JordanPersegati", "likes": 5000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:48.779240", "replies_count": null, "liked_by_creator": false}, {"comment": "This is pretty inspiring. I have been in an art rut for 5 years. I lost my motivation for many different reasons and just recently decided to try to get back into it after hearing about your draw progress videos. Part of me wishes i could start from scratch and go back to that time where i just drew for fun, not overly criticizing myself, always over analyzing and just adjusting over and ovet and over...to see such progress in a third of a year from when you started is amazing. I cant wait to see where you end up in a year  dont lose your drive!", "commenter_channel_name": "@darientheghoul8869", "likes": 28, "date": "9 months ago", "fetched_date": "2025-01-19 13:29:48.814944", "replies_count": 0, "liked_by_creator": false}, {"comment": "Love you so much for this! Even as someone who draws professionally, it is so encouraging to see your documentation and it inspires me to draw even more ^^.", "commenter_channel_name": "@CuteC3", "likes": 2000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:48.851419", "replies_count": null, "liked_by_creator": false}, {"comment": "8:00 As an artist this was too relatable  I have so many off days that it feels like it takes forever until I actually feel proud of my work. I’m so impressed with Felix’s improvement.", "commenter_channel_name": "@Dreaming_RedPanda", "likes": 1000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:48.889480", "replies_count": null, "liked_by_creator": false}, {"comment": "5:54 Felix discovers the “awkward picture of yourself” pose reference technique ", "commenter_channel_name": "@Yippieyiyo", "likes": 2000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:48.928853", "replies_count": null, "liked_by_creator": false}, {"comment": "I can feel the words... \"I was too scared to commit to coloring.\" This happens when you take too much time, and the sketch is too beautiful. I do suck at coloring so I really relate to those words.", "commenter_channel_name": "@marielvillaruz9771", "likes": 14, "date": "7 months ago (edited)", "fetched_date": "2025-01-19 13:29:48.963414", "replies_count": 0, "liked_by_creator": false}, {"comment": "I'm blown away by how much you've improved in such a short time. Keep up the amazing work!", "commenter_channel_name": "@%E4%B9%82", "likes": 4000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:48.999531", "replies_count": null, "liked_by_creator": false}, {"comment": "A very quick out of the blue tip, when shading with white, use blue instead of gray, it looks so much better! This is genuinely amazing!", "commenter_channel_name": "@BroccoliDoctor", "likes": 2000, "date": "11 months ago (edited)", "fetched_date": "2025-01-19 13:29:49.036206", "replies_count": null, "liked_by_creator": false}, {"comment": "7:24 holy, man! That is absolutely gorgeous. As an artist that has been drawing since she can remember, I am so proud and maybe even a little jelly.", "commenter_channel_name": "@pugsforeveryone", "likes": 1000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:49.072424", "replies_count": null, "liked_by_creator": false}, {"comment": "Even if you can't tell a physical difference from, yesterday till' tommrow, the linework condfidence is definitely noticeable! Keep drawing felix we can see the improvements!! ️", "commenter_channel_name": "@vivi1as", "likes": 15, "date": "8 months ago", "fetched_date": "2025-01-19 13:29:49.106392", "replies_count": 0, "liked_by_creator": false}, {"comment": "I am an artist and everyone's learning curve is different! \"I don't think you're supposed to do this\" doesn't exist. If that is how you judge the proportions in your process, then it works!  So proud you're already talking like an artist.", "commenter_channel_name": "@zoebigbeedunn", "likes": 718, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:49.142100", "replies_count": 0, "liked_by_creator": false}, {"comment": "It's amazing to see how much progress you can make in such a short amount of time. Great job, Felix!", "commenter_channel_name": "@nuqi", "likes": 2000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:49.178178", "replies_count": null, "liked_by_creator": false}, {"comment": "It’s hard to convince people on how much they can improve by drawing daily, you can improve so much in the span of a month if you’re willing to suffer through the “bad days.” You just need to be willing to spend a lot of time feeling frustrated before something clicks and all of a sudden you start to get it.", "commenter_channel_name": "@ronillust", "likes": 966, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:49.215692", "replies_count": null, "liked_by_creator": false}, {"comment": "Idk why people hating on my man he clearly worked on himself everyday and did a lot of efforts to get to be this good at art", "commenter_channel_name": "@darksaiyan3726", "likes": 3, "date": "1 month ago", "fetched_date": "2025-01-19 13:29:49.249862", "replies_count": 0, "liked_by_creator": false}, {"comment": "Pewds really took it upon himself to prove that practice really does make perfect. \n\"Practice\" is genuine advice and the best thing you can do to improve.\n\nI feel this is the genuine start of an anime arc for him, lol.", "commenter_channel_name": "@Pudding404", "likes": 1000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:49.287465", "replies_count": null, "liked_by_creator": false}, {"comment": "I CANNOT TELL YOU HOW MOTIVATING THIS IS!!! Been Drawing off and on all my life, and I've felt like I messed up by not drawing as much as I should have for the last 5 years or so, But Seeing How amazing your art is even after 100 days reminds me that If I want to be better it's not unattainable. I can't Wait for the Next update!", "commenter_channel_name": "@SpikedPie", "likes": 817, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:49.322685", "replies_count": null, "liked_by_creator": false}, {"comment": "This is dope.", "commenter_channel_name": "@TheMrSark", "likes": 3000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:49.359051", "replies_count": null, "liked_by_creator": true}, {"comment": "7:50 BROOOOOOOOOOOOO AMAZING", "commenter_channel_name": "@Faelcomefezes", "likes": 9, "date": "9 months ago", "fetched_date": "2025-01-19 13:29:49.394262", "replies_count": 0, "liked_by_creator": false}, {"comment": "Watching the progress pewds made not just inspired me to attempt the same method, but also reminded me that it's always never too late to learn something you were passionate about but procrastinated for years because of how unsure you are about the imaginary disappointment it will lead.", "commenter_channel_name": "@MameruArune", "likes": 584, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:49.431657", "replies_count": null, "liked_by_creator": false}, {"comment": "As an artist, it’s clear felix does have a natural creative flare. Enjoy the process of learning felix, I love your characters they’re so cute! ", "commenter_channel_name": "@ELLINKZ", "likes": 1000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:49.469386", "replies_count": null, "liked_by_creator": false}, {"comment": "As an artist and art manager, I find this soooo incredibly genuine and inspiring! Thank you for taking us through your journey and really showing everyone that growing in art is a skill like everything else - it takes lots and lots of practice and even then there are days you're just not good... and suddenly. That being said your initial color studies are WONDERFUL - I absolutely love that you did the hair color on the inside!!", "commenter_channel_name": "@Diana-uv7kc", "likes": 902, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:49.503692", "replies_count": 0, "liked_by_creator": false}, {"comment": "13:25 Felix really out here making me inspired to draw again like i wanna pick it and finally be able to draw too", "commenter_channel_name": "@pancakesiguess", "likes": 2, "date": "2 months ago", "fetched_date": "2025-01-19 13:29:49.538486", "replies_count": 0, "liked_by_creator": false}, {"comment": "7:52 My jaw dropped. It’s so true that it takes drawing 3000 bad drawings before making 1 good one. That’s what makes art so rewarding. Awesome process video! Looking forward for the 1 year update :)", "commenter_channel_name": "@Jimmyjones4628", "likes": 557, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:49.575114", "replies_count": null, "liked_by_creator": false}, {"comment": "As an artist with a tendency to get so much art block, seeing this video really lit up something within me. I am so proud of how far you’ve come and I look forward to future videos as you continue to improve!! Great job felix, you inspire many people!!", "commenter_channel_name": "@iamlinax1025", "likes": 1000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:49.612107", "replies_count": null, "liked_by_creator": false}, {"comment": "you have a very intuitive sense of color. I've been drawing for over 15 years and I still can't get the hang of coloring, but your colored pieces already look like a sketchbook you could apply to a color assistant position  if you improve in composition and original character design you could probably be at a level to apply to art school  the envy is killing me", "commenter_channel_name": "@ChibiChidorii", "likes": 825, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:49.649912", "replies_count": null, "liked_by_creator": false}, {"comment": "these videos about learning skills in realistic timelines and with realistic results are so encouraging", "commenter_channel_name": "@frroggyy", "likes": 563, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:49.711388", "replies_count": null, "liked_by_creator": false}, {"comment": "As an artist, seeing Felix going through his art journey is very heart warming. Great work", "commenter_channel_name": "@jessann_art", "likes": 982, "date": "11 months ago (edited)", "fetched_date": "2025-01-19 13:29:49.749323", "replies_count": null, "liked_by_creator": false}, {"comment": "Felix that sketchbook tour was AWESOME,  you improved so well, and the colors are actually really good. Also you'll eventually find your own style, just keep trying different techniques and stuff.", "commenter_channel_name": "@SleepyZenXen", "likes": 388, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:49.785159", "replies_count": null, "liked_by_creator": false}, {"comment": "marker recommendation: the ohuhu brush markers are my fav!! you can get loads of colors for a decent price and the quality is really nice ", "commenter_channel_name": "@skybluelixiee", "likes": 1, "date": "9 months ago", "fetched_date": "2025-01-19 13:29:49.822202", "replies_count": 0, "liked_by_creator": false}, {"comment": "9:36 the way one creates art literally can’t be \"wrong\" if it works for you and you’re having fun then it’s the right way to draw", "commenter_channel_name": "@iggiboii", "likes": 1000, "date": "11 months ago (edited)", "fetched_date": "2025-01-19 13:29:49.858948", "replies_count": null, "liked_by_creator": false}, {"comment": "There's something very human about drawing.\nPewdiepie, with this and with your gym journey and your amazing family, you are truly this generation's best role model", "commenter_channel_name": "@apertioopening3425", "likes": 437, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:49.895827", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewds' grasp of colour as a beginner is INSANE! huge progress!", "commenter_channel_name": "@sele1595", "likes": 713, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:49.933519", "replies_count": null, "liked_by_creator": false}, {"comment": "If this becomes an art channel that shit would be crazy", "commenter_channel_name": "@IDKSomethingCool555", "likes": 831, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:49.996380", "replies_count": null, "liked_by_creator": false}, {"comment": "1:22 as a artist call this the \"potemkim phase\" because this happens after you go crazy and start improving but the next day the improvement you had disappears. This happens because you see something wrong and you fix it but you don't understand why and you revert back to the stage where you didn't see the mistake. Then your soul starts singing \"im a fool,I know nothing.  I take the role of a silly clown\" hence the potemkim phase. So  to counter that, you must understand everything to the point where you can teach and or fundamently understand why it's supposed to look like that", "commenter_channel_name": "@leschroder7773", "likes": 1000, "date": "11 months ago (edited)", "fetched_date": "2025-01-19 13:29:50.032951", "replies_count": null, "liked_by_creator": false}, {"comment": "All the ones you hate or think are bad are still so good! And some of the coloured ones are amazing, they look like a digital picture !", "commenter_channel_name": "@genrose3829", "likes": 2, "date": "1 month ago (edited)", "fetched_date": "2025-01-19 13:29:50.068306", "replies_count": 0, "liked_by_creator": false}, {"comment": "man, i really love his style. his current art style with the coloring already really goes well already. amazing work felix!", "commenter_channel_name": "@TsuZer0", "likes": 816, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:50.104405", "replies_count": null, "liked_by_creator": false}, {"comment": "There's something very human about drawing.", "commenter_channel_name": "@TimeBucks", "likes": 473, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:50.140633", "replies_count": null, "liked_by_creator": false}, {"comment": "As an artist and non-fan, he's quite impressive ngl. He already has the observational, eye-hand coordination, color sense naturally. He has the natural talent for sure. It's quite impressive how his shape design and linework drastically improved in every 40 days cycle!", "commenter_channel_name": "@reisatsuki5891", "likes": 1000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:50.176816", "replies_count": null, "liked_by_creator": false}, {"comment": "9:45, bro I don't know where my brain went, but I just blew on my phone, to rid the paper of those eraser bits", "commenter_channel_name": "@dorians2138", "likes": 3, "date": "2 months ago", "fetched_date": "2025-01-19 13:29:50.213049", "replies_count": 0, "liked_by_creator": false}, {"comment": "A \"Draw with me\" stream would actually be pretty cool now that you're on that grind", "commenter_channel_name": "@Hirotara", "likes": 760, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:50.247857", "replies_count": 0, "liked_by_creator": false}, {"comment": "Great progress! Let me know if you want any help!", "commenter_channel_name": "@ProkoTV", "likes": 8000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:50.284521", "replies_count": null, "liked_by_creator": true}, {"comment": "a lot of artistic improvement isn't necessarily a better looking drawing, but improving speed, reducing mistakes/erasing, and increasing confidence! good on you for recognizing that. I'm excited to see your continued progression with art", "commenter_channel_name": "@eyrene10", "likes": 438, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:50.320838", "replies_count": null, "liked_by_creator": false}, {"comment": "7:57 if i could draw like that i can die happy man. PewDiePie, your skills drawing are amazing for just 100 days.", "commenter_channel_name": "@SebasSlayer", "likes": 2, "date": "2 months ago", "fetched_date": "2025-01-19 13:29:50.355302", "replies_count": 0, "liked_by_creator": false}, {"comment": "Pewdiepie as a mangaka doesn't seem impossible all of a sudden.", "commenter_channel_name": "@wickedboo2595", "likes": 1000, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:50.390920", "replies_count": null, "liked_by_creator": false}, {"comment": "5:56 Pewds, it’s 100% not weird. Literally every artist does that— using yourself as a reference for a pose is a common thing that most artists do. It’s wayyy easier to use yourself as a guideline than a 3D model or going on the internet. Artist moment fr o7", "commenter_channel_name": "@thatextrovertartist5474", "likes": 796, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:50.426998", "replies_count": null, "liked_by_creator": false}, {"comment": "Seeing Felix improve so much within 100 days motivates me to get better at drawing, I've been struggling to get any motivation for a while \"It's impossible for me to get better\" i would tell myself constantly. After watching Felix ( someone I've been watching since my childhood, I'm 19, almost 20), it has really opened my eyes and made me realize, it definitely is possible, and to you Felix i thank you for that.", "commenter_channel_name": "@Tenshitheextra", "likes": 589, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:50.463899", "replies_count": null, "liked_by_creator": false}, {"comment": "It's amazing how much progress you did in 100 days!", "commenter_channel_name": "@fortenator4730", "likes": 2, "date": "1 month ago", "fetched_date": "2025-01-19 13:29:50.499642", "replies_count": 0, "liked_by_creator": false}, {"comment": "Felix as someone who has drawn all my life and is currently going to art school I can say that I am SO impressed. I know that sometimes it feels like you aren’t improving and it can cause you to spiral and give up. Your ability to persevere and continue drawing everyday is very admirable (I can’t even do that)! Kudos to you man!", "commenter_channel_name": "@weirdflexbutok", "likes": 347, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:50.536851", "replies_count": null, "liked_by_creator": false}, {"comment": "I've been in a weird spot with my art lately and find myself unmotivated to practice and just do it now for work. I definitely DID NOT expect to find my spark and motivation back from watching a Pewdiepie video. You really reminded me how fun drawing can be. Keep it up king, I can't wait to see more improvements!", "commenter_channel_name": "@RiriRuruu", "likes": 673, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:50.572881", "replies_count": null, "liked_by_creator": false}, {"comment": "Around @07:00 when you begin colouring in your drawings, it’s super motivating and inspiring- it makes me want to draw again- I really like the blue colours", "commenter_channel_name": "@mikiyachi2", "likes": 635, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:50.610051", "replies_count": null, "liked_by_creator": false}, {"comment": "Woah what!!! Drawing has always seemed so fun to me but I’ve always been held back by the fact that I’m not good… the speed at which you’re progressing and making it a habit is super inspiring and I think I’m going to try to incorporate drawing into my day to day :)", "commenter_channel_name": "@audreylewis8119", "likes": 2, "date": "5 months ago", "fetched_date": "2025-01-19 13:29:50.644737", "replies_count": 0, "liked_by_creator": false}, {"comment": "My dude has the best talents \n1. Hardwork\n2. Discipline\n3. Consistency", "commenter_channel_name": "@rishan_sir", "likes": 118, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:50.683963", "replies_count": 0, "liked_by_creator": false}, {"comment": "6:00 \"I think I used myself as reference for some of these, I know that's kinda weird, I just needed the pose\" That is absolutely not weird! That's exactly what other artists do as well all the time, either with mirror or with photos.", "commenter_channel_name": "@woahhaow10yearsand41", "likes": 518, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:50.720718", "replies_count": null, "liked_by_creator": false}, {"comment": "He’s legitimately a professional learner. His attitude to YouTube, Minecraft, art, rock climbing, exercise. He just puts in the work and progresses like nobody’s business.", "commenter_channel_name": "@muneeb-khan", "likes": 191, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:50.757494", "replies_count": null, "liked_by_creator": false}, {"comment": "I also tried the 100 days challenge last year and I improved A LOT. Like my speed of drawing become a little faster and it was a fun experience. Although I think it didn't get a lot attention but I learned a lot of things.", "commenter_channel_name": "@bilibozo", "likes": 1, "date": "2 weeks ago", "fetched_date": "2025-01-19 13:29:50.792138", "replies_count": 0, "liked_by_creator": false}, {"comment": "As an artist im really impressed with the way he draws the sketch so clean! It's okay to make the sketch messier and use more geometric shapes! It will make the beginning stage less time consuming and you wont have to restart a bunch of times until you're satisfied with the result!", "commenter_channel_name": "@Artichokaaaa", "likes": 399, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:50.828857", "replies_count": null, "liked_by_creator": false}, {"comment": "7:55 this one is litterally a masterpiece", "commenter_channel_name": "@solochief67", "likes": 846, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:50.865919", "replies_count": null, "liked_by_creator": false}, {"comment": "as an artist for 15 years since i was a wee lad its so crazy to see felix on this journey, the same one ive was on and have been on for the last 15 years. it never stops felix, but i think thats tge joy of it, your always improving and creating new techniques and sometimes its shit and other times your so very proud of yourself. thats what being an artist is like, from a veteran artist", "commenter_channel_name": "@thefluffyaj4119", "likes": 555, "date": "11 months ago (edited)", "fetched_date": "2025-01-19 13:29:50.902642", "replies_count": null, "liked_by_creator": false}, {"comment": "Great job ", "commenter_channel_name": "@cartooningclub", "likes": 1, "date": "8 months ago", "fetched_date": "2025-01-19 13:29:50.937288", "replies_count": 0, "liked_by_creator": false}, {"comment": "I don't think I've ever watched a video with mouth and eyes actually opened wide. I'm in absolute AWE. These are SO GOOD. This is coming from a person who has drawn since she was 3. I didn't think I could look up to you more than I already do, but then you go and absolutely kill it in my favorite hobby. You're amazing, Felix", "commenter_channel_name": "@fridaaa0", "likes": 989, "date": "11 months ago (edited)", "fetched_date": "2025-01-19 13:29:50.973622", "replies_count": null, "liked_by_creator": false}, {"comment": "as an art student, i love watching the progress, it's refreshing to see the \"crappy\" art and learning from those flaws, the ups and downs through out, and reminds me that often times our work isn't always gonna land every time :')", "commenter_channel_name": "@netba_art", "likes": 266, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:51.008222", "replies_count": 0, "liked_by_creator": false}, {"comment": "Bro PewDiePie raging at drawing is the most Down to Earth thing I’ve ever heard from him. I understand your pain man", "commenter_channel_name": "@regenc0cksmasochist", "likes": 446, "date": "11 months ago (edited)", "fetched_date": "2025-01-19 13:29:51.042694", "replies_count": 0, "liked_by_creator": false}, {"comment": "This has motivated me to get back into drawing. I love drawing and it refreshes my soul but I just got out of the habit. Keen to get back into it!", "commenter_channel_name": "@genrose3829", "likes": 2, "date": "1 month ago", "fetched_date": "2025-01-19 13:29:51.080570", "replies_count": 0, "liked_by_creator": false}, {"comment": "5:59 LMAO as an artist I've used myself as a reference so many times and I feel cringy every time! Sometimes you just need that very specific pose and none of the images online are up to par lol", "commenter_channel_name": "@Ari_A1357", "likes": 976, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:51.117407", "replies_count": null, "liked_by_creator": false}, {"comment": "6:43 It's not just the marker scribbles to hide the drawing that does it for me, it's the added \"fuck\" to the side of it. lol", "commenter_channel_name": "@KimiOmega", "likes": 257, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:51.153939", "replies_count": null, "liked_by_creator": false}, {"comment": "Your comments about your work are so relatable! Especially the “did I trick everyone?” When self doubt and imposter syndrome kick in. But your progress is so impressive! Especially how well you picked up coloring and shading. The trick to improve like crazy is to draw something you really really love. Something you hyper focus on and can keep drawing over and over. Thank you for this video it’s given me the motivation to practice today!", "commenter_channel_name": "@messisauce2880", "likes": 472, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:51.197335", "replies_count": null, "liked_by_creator": false}, {"comment": "i hope you make video like this more! I'm an artist suffering from art block and this reminded me of my love for art again!", "commenter_channel_name": "@lairakuromasu56", "likes": 1, "date": "1 month ago", "fetched_date": "2025-01-19 13:29:51.233402", "replies_count": 0, "liked_by_creator": false}, {"comment": "Hey! Quick sketching tip. Sometimes its recommended to use post-its for correcting drawings, that way the color pop of the note can make it look prettier and you can flip it to see your mistakes before the correction! Anyways, love the journey and im so grateful to growing up watching the amazing person you have become. Lots of love!", "commenter_channel_name": "@angsty_creator", "likes": 532, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:51.270528", "replies_count": null, "liked_by_creator": true}, {"comment": "As an artist he said so many relatable things throughout the video…. Art is really a blessing. Congrats on your journey, Felix! Glad you’re having fun", "commenter_channel_name": "@Elioououou", "likes": 180, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:51.319719", "replies_count": 0, "liked_by_creator": false}, {"comment": "This video is so weirdly inspirational.\n\nBecause you can genuinely tell that Pewds really didnt take a shortcut. He didnt run off and pay someone for lessons, he didnt spend alot of money to achieve his goal, he just genuinely sat, and drew to the best of his ability, maybe looking at some techniques online and provided his results. I actually have hope for having an ounce of artistic talent with this kind of inspiring video lol.", "commenter_channel_name": "@christop3", "likes": 371, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:51.358292", "replies_count": null, "liked_by_creator": false}, {"comment": "I really love that one green haired girl! Idk if you realized, or if it works slightly differently with markers, but green is actually not a very straightforward color to use. It really tests one's understanding of color theory wherein lighter areas would actually be slightly more yellowish while darker areas would actually be slightly more blueish; and it looks like you got that right on the green haired girl!\nGreat job, Pewds 🥹", "commenter_channel_name": "@SkitsyCat", "likes": 414, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:51.422927", "replies_count": null, "liked_by_creator": false}, {"comment": "he actually improves so quickly wtf", "commenter_channel_name": "@moogleydoot", "likes": 672, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:51.461516", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewds your journey hits so close to home it makes me fall in love with drawing all over again.\nUsing yourself as reference, suddenly drawing weaker after a really good piece, being scared to ruin a sketch with lineart and colour, looking back and seeing what an older drawing needs to be improved, and drawing from a manga you like.\nDespite not being an art channel, Pewds is the most relatable artist to me!", "commenter_channel_name": "@henryaung7229", "likes": 306, "date": "11 months ago", "fetched_date": "2025-01-19 13:29:51.500035", "replies_count": 0, "liked_by_creator": false}], "related": []}