{"code": "peloHl5sb4I", "title": "1 Year Japan Review (0 - 10) 👏👏", "url": "https://www.youtube.com/watch?v=peloHl5sb4I", "thumbnail_url": "https://i.ytimg.com/vi/peloHl5sb4I/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLA96EnT7cRVqC_kkWOHHZV9v6ZvcA", "views": 3000000, "likes": 176000, "duration": "", "embed_code": "https://www.youtube.com/embed/peloHl5sb4I", "uploaded_date": "15 Jun 2023", "comments_count": 6972, "comments": [{"comment": "When I was in Japan, I was walking along one of the many lakes around Mt. Fuji when an old fisherman waved me over. He didn't speak much English, and I didn't speak much Japanese, but he invited me into his fishing shack and we talked about our jobs and what we like about our homes. He gave me a huge bag of jerky fish and said, \"if you come back, I will be here\". I think about him every week ", "commenter_channel_name": "@TheVermilliaFamily", "likes": 12000, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:42.590944", "replies_count": null, "liked_by_creator": false}, {"comment": "When we visited Kyoto I gave an old japanese lady my seat on train and she was SO incredibly thankful, she thanked me like 30 times and when she got off the train she thanked me again 10 times. Not gonna lie, this adorable old lady was one of my highlights in japan.", "commenter_channel_name": "@XRubyDuby", "likes": 2000, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:42.631571", "replies_count": null, "liked_by_creator": false}, {"comment": "It sounds like the final thing about Japan that Felix enjoys is that he's at peace there! So happy he is in such a good place in his life!", "commenter_channel_name": "@azianimations4883", "likes": 1000, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:42.686205", "replies_count": null, "liked_by_creator": false}, {"comment": "12 years living here, and I love how his list of good and bad mirrors experience here from arrival to having been here for awhile. The trash bins you notice almost immediately. The language hurdles and small victories over time. The rules one is spot on though. If it is written, or generally understood & accepted to be, it means that is how it is and there will be no other way. I am so happy for you both, on both your life and work change, and for your new additions.", "commenter_channel_name": "@Twoface227", "likes": 148, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:42.728854", "replies_count": 0, "liked_by_creator": false}, {"comment": "I remember being younger and thinking “what will pewdiepie be doing when I’m grown up” and now he’s got a child on the way, lives in Japan. Nice to see him living life to the fullest.", "commenter_channel_name": "@Bongwater2k", "likes": 592, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:42.766606", "replies_count": null, "liked_by_creator": false}, {"comment": "Felix finally got sponsored by Japan. He’s truly becoming a top YouTuber", "commenter_channel_name": "@andreslosada559", "likes": 6000, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:42.807887", "replies_count": null, "liked_by_creator": false}, {"comment": "I lived there for 3 years, and i would say that most of the japanese are really kind. I started doing ubereats there and once i couldnt find the house i was delivering to ( the ping on the map was not correct ), i awkwarldy asked a couple that was passing by, the guy say come, come ( in inglish ) and run like 100 meters with me on the bicycle to the right adress, a true hero.", "commenter_channel_name": "@gonzalorossi4645", "likes": 287, "date": "1 year ago (edited)", "fetched_date": "2025-01-19 13:41:42.851647", "replies_count": null, "liked_by_creator": false}, {"comment": "When I first visited Japan we were still learning the subway station and of course we were in Shinjuku. This lady named AIko spent an hour and a half of her day helping us set up Passmo (buss pass) and explaining the subway system to us. She didn't speak much english but was still a huge blessing when we had no idea what we were doing.", "commenter_channel_name": "@robt9790", "likes": 330, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:42.890041", "replies_count": 0, "liked_by_creator": false}, {"comment": "Having a child opens up a while new world to you. You shop at special places in the stores, you go to playgrounds, people look at you differently and talk to you like making a cute baby is the most important thing in the universe. But most importantly you notice the beautiful things around you to describe it to him, toys start having backstories, the most commont stuff in the house becomes interesting, it's CRAZY.", "commenter_channel_name": "@luca57882", "likes": 95, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:42.930863", "replies_count": null, "liked_by_creator": false}, {"comment": "It's just so cool to me how he and Marzia wanted to go to Japan for so long and finally his dream came true and now he's reviewing it. We're glad to be part of your journey Pewds. Keep on living your life.", "commenter_channel_name": "@theonewhosees586", "likes": 1000, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:42.971323", "replies_count": null, "liked_by_creator": false}, {"comment": "As a Japanese, foreigners like you who try to live happily with lots of respect and follow the customs and maybe the rules here even you dont like, are very appreciated, and nice to hear your thoughts this time. Your Japanese speaking sounds quite good and i guess you can speak Japanese well more than you feel.", "commenter_channel_name": "@sssis", "likes": 636, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:43.022441", "replies_count": null, "liked_by_creator": false}, {"comment": "I lived in Poland for 3 months and you really learn to enjoy the little things in a new place.  Just sitting with coffee somewhere feels more meaningful. I started learning Polish nearly a year before I went and my Polish was passable enough for basic convo/at least understanding the general idea of what someone’s saying even if I couldn’t reply in Polish super well. It’s so fun to exercise your brain with more languages", "commenter_channel_name": "@laylafiretruck", "likes": 37, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:43.066554", "replies_count": null, "liked_by_creator": false}, {"comment": "it's always nice to see how relaxed felix is and how happy he and marzia are since they've moved to japan! ", "commenter_channel_name": "@arcticxabyss", "likes": 722, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:43.114686", "replies_count": null, "liked_by_creator": false}, {"comment": "When I was in Japan the elderly talked to me the most and were so incredibly friendly, even gave me gifts so I never experienced that stereotype either", "commenter_channel_name": "@thecreampuffchan", "likes": 392, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:43.157179", "replies_count": 0, "liked_by_creator": false}, {"comment": "It sounds odd but the final reason reminds me of \"Ma\" in Ghibli movies. \"Ma\" being the the emptiness of a scene that gives both the characters in the film and the audience a chance to breathe. Felix's life has been non-stop for YEARS, Japan and these moments have finally given him a chance to enjoy the silence, transition, and peace of living a non-hectic life. It makes me so incredibly happy to see these two (now three) deserving people of such a life ", "commenter_channel_name": "@Voelizce", "likes": 567, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:43.202626", "replies_count": null, "liked_by_creator": false}, {"comment": "共感します！\n晴れた日は散歩したくなる、心が軽やかになる。夕方は1時間の間に3色に変化して驚いたり、夜の風にあたると急に感傷的になったり、変な感じある。", "commenter_channel_name": "@%E3%81%84%E3%82%82%E3%83%8B%E3%82%B9%E3%83%88", "likes": 27, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:43.240332", "replies_count": 0, "liked_by_creator": false}, {"comment": "I just got back from a trip to Japan and I have got to say it is unlike any country I have ever been to. I had studied the language on and off for around 4 years but your point on conversation is absolutely true; there are tons of phrases and concepts that you just don't get until you go to the actual country. Loved hearing your views on their culture and can't wait to see you grow further with your experiences in Japan!", "commenter_channel_name": "@BigDave309", "likes": 110, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:43.281772", "replies_count": null, "liked_by_creator": false}, {"comment": "6:06 \n\"SMILE BACK\" Got me cracked 'cause I was trying not to smile at all cost", "commenter_channel_name": "@cemcimet5825", "likes": 38, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:43.321672", "replies_count": null, "liked_by_creator": false}, {"comment": "I completely understand that \"feeling\" you're referring to at the end. In 2015 I went on a high school exchange to Japan for a year and lets just say my arrival in Japan was very stressful. Because of all that stress I went through I began regretting my decision to study abroad and was feeling really bad. After my host family at the time picked me up from the airport and I was in the car on the way to their home, I had a change of heart. What made me change my outlook was simply seeing life going on around me. I saw a person riding their bike, other cars on the road with us, all the homes in my host family's neighborhood and all that made me think \"you know what, this is nice\" and I never regretted my decision again after that. I ended up loving my year in Japan so much that I plan to move back in a few years.", "commenter_channel_name": "@hanafruit98", "likes": 746, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:43.362533", "replies_count": null, "liked_by_creator": false}, {"comment": "Thank you so much for speaking on how locals treat you", "commenter_channel_name": "@TimeBucks", "likes": 746, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:43.401187", "replies_count": null, "liked_by_creator": false}, {"comment": "Watching you pre-Japan and seeing how stuck you felt not being able to move, to now being IN Japan and living your best life - I\"m super happy for you (and Marzia)! Its amazing what can happen in a year :)", "commenter_channel_name": "@juniperloo", "likes": 142, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:43.440777", "replies_count": null, "liked_by_creator": false}, {"comment": "I like how pewds these days looks like he found his balance in life. He looks so content and peaceful. Cheers mate happy for you pewds.", "commenter_channel_name": "@consciouslasagne354", "likes": 3000, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:43.481315", "replies_count": null, "liked_by_creator": false}, {"comment": "Felixさんが日本で楽しく過ごせているようで嬉しいですー！ご家族とこれからも幸せに暮らせますように！", "commenter_channel_name": "@ck-nw8hc", "likes": 518, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:43.521497", "replies_count": null, "liked_by_creator": false}, {"comment": "I've lived in Japan for five months, and I also experienced that feeling when you suddenly appreciate something small in daily life.", "commenter_channel_name": "@Saturinus", "likes": 1000, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:43.562499", "replies_count": null, "liked_by_creator": false}, {"comment": "I can't believe a lot of us have watched him grow so much. I love how much his mind expanded. You two will have an amazing journey through life.", "commenter_channel_name": "@7ona", "likes": 331, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:43.601007", "replies_count": 0, "liked_by_creator": false}, {"comment": "let’s be honest, we all genuinely smiled when he smiled", "commenter_channel_name": "@%EB%83%89%EB%8F%99%EB%94%B8%EA%B8%B0", "likes": 1000, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:43.642725", "replies_count": null, "liked_by_creator": false}, {"comment": "日本人でずっと日本にいるけど今でも夢のような瞬間は感じるよ\n朝の澄んだ空気とか\n四季によって変わる匂い\n春は桜が咲きほこりピンクに染まる景色を見てあまりの美しさに見惚れるし\n花が咲いて街の色が変わると冬の終わりを知らせ、始まりとワクワクを感じさせる\nお花見で賑わい活気がわく\n\n夏は空がとても青々しく、緑も濃くて景色が鮮やかになる\n花火大会やお祭りが盛んになって賑やかなのに夏の夜は虫の声と静けさと空気が切なさを感じさせる\n\n秋になると朝の空気が澄んでいて冬が近付く空気が切なくさせる\n自然が多くなにげなく目をやると紅葉で色付く景色が目に入る\n秋の夕焼けをみると胸がキュッとなる\n\n冬はクリスマスが近くなりイルミネーションでキラキラしてる街が幸せな雰囲気につつまれる\nお正月になると日本文化が盛んになりほっこりするような暖かさを感じる\n温泉旅行でもしたくなる\n\nいつもふと何気ない日に空を見上げるとあまりの綺麗さに時々立ち止まる\nなんか儚いというか切ないというか懐かしい気持ちに突如襲われる時がある\n空気や匂いがそうさせるのか", "commenter_channel_name": "@%E7%8F%8D%E7%8F%8D-g8k", "likes": 104, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:43.682941", "replies_count": null, "liked_by_creator": false}, {"comment": "That feeling you couldn’t describe is called peace and serenity. So glad you are experiencing life with these emotions. I pray that Marzia and the baby have a safe delivery. ", "commenter_channel_name": "@victoriasherwood8911", "likes": 415, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:43.724366", "replies_count": null, "liked_by_creator": false}, {"comment": "Been to Japan, I love the rural areas and countryside more, kind of peaceful. It’s like an instagram picture that you don’t need to filter. People are surprisingly polite.", "commenter_channel_name": "@elgritton", "likes": 73, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:43.761722", "replies_count": 0, "liked_by_creator": false}, {"comment": "One of the reasons I love Japan is the culture. From the food to the towns, to the people, and the natural beauty from Mount Fuji to the Cherry Blossom trees. There’s just something about the culture that is just so exciting.", "commenter_channel_name": "@SuperNASCARrocks", "likes": 77, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:43.800599", "replies_count": 0, "liked_by_creator": false}, {"comment": "日本に付いて発信してくれて有難うございます。最近は様々な国籍の人が日本に流れ込んで来ています、世界的に影響力のある方が日本について話してくれて嬉しいです", "commenter_channel_name": "@%E8%8F%AF%E8%93%AE-e1b", "likes": 2, "date": "1 month ago", "fetched_date": "2025-01-19 13:41:43.837080", "replies_count": 0, "liked_by_creator": false}, {"comment": "Felix, about the being in the delivery room thing: I know you said there isn’t really any bending the rules but I hope you do try! I’ve read someone say that they were able to stay the whole time before birth (not after) after doing a PCR COVID test on the spot. Maybe you could also ask the doctor for help with getting some sort of exception due to whatever reason: not fluent in Japanese, first pregnancy, high stress, whatever it is. Medically there is good reason for her to have you there to provide support and comfort in an extremely unfamiliar situation. I hope you’re able to be there at the very least longer than the 2 hours ", "commenter_channel_name": "@monicasmm", "likes": 1000, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:43.883141", "replies_count": null, "liked_by_creator": false}, {"comment": "pewds: \"...people may smile back.\"\nme: smiles*\npewds: SMILE BACK!\nme: smiles aggressively.\npewds: thank you.", "commenter_channel_name": "@jaskii6879", "likes": 10000, "date": "1 year ago (edited)", "fetched_date": "2025-01-19 13:41:43.924733", "replies_count": null, "liked_by_creator": false}, {"comment": "Such a wholesome video. We all have our stereotypic ideas of Japan, but most of us never get the chance to actually have those stereotypes exposed to reality.\nThanks, Felix, for giving us these slices of Japanese life.", "commenter_channel_name": "@carlbrown9082", "likes": 474, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:43.963578", "replies_count": null, "liked_by_creator": false}, {"comment": "I’m Japanese and have lived in Ireland. I don’t like working in Japan even though I’m Japanese. But I’m so glad you are able to settle in Japan and enjoy it!! Each prefecture has each culture and food in Japan so highly recommend go many places as much as you can!!", "commenter_channel_name": "@yn5610", "likes": 19, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:44.002924", "replies_count": 0, "liked_by_creator": false}, {"comment": "12:15 the word for it is \"tranquillity\", when you just feel at peace and dont have any stress or worries in the moment", "commenter_channel_name": "@Sakuma_san", "likes": 14, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:44.040873", "replies_count": 0, "liked_by_creator": false}, {"comment": "I lived on Denmark for almost a year and it was the happiest and most peaceful I have ever been: going on my bicycle everywhere, everyone being super nice to me, finding extreme beauty on every sunset and moment.. as I heard you say this about Japan, it brings me back memories and I can't help but smil and feel so happy for you!", "commenter_channel_name": "@nejidanandgaalimar", "likes": 52, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:44.081780", "replies_count": null, "liked_by_creator": false}, {"comment": "Not gonna lie time seems to fly by so fast, like in a blink of an eye you see felix go from playing minecraft, reaching 100 million subscribers to living in japan for a year, having a son, and living the most out of his life, pretty cool seeing him still making videos ", "commenter_channel_name": "@Aquwu", "likes": 309, "date": "1 year ago (edited)", "fetched_date": "2025-01-19 13:41:44.123661", "replies_count": null, "liked_by_creator": false}, {"comment": "最近では、日本の文化や風習を否定するのに日本にいる外国人が外国人の権利を主張するなど一部で問題になっていますが、日本人は日本の文化風習を愛し尊重してくださる外国の方が旅行に訪れてくれることは心から歓迎しています\n日本に好意的な外国の方々、本当にありがとうございます", "commenter_channel_name": "@hiizu", "likes": 7, "date": "6 months ago", "fetched_date": "2025-01-19 13:41:44.162736", "replies_count": 0, "liked_by_creator": false}, {"comment": "I went to Japan a few weeks ago now and i can say it's a truly beautiful place. The people are so polite and respectful of each other, something that seems to be missing these days in the UK. I would happily move there tomorrow if i had the money to.", "commenter_channel_name": "@shredasaur8857", "likes": 238, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:44.203377", "replies_count": null, "liked_by_creator": false}, {"comment": "日本の良いところも悪いところも感じながら、すべてを楽しんでくださっているところが日本人として嬉しいです。", "commenter_channel_name": "@yudai5785", "likes": 936, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:44.241650", "replies_count": null, "liked_by_creator": false}, {"comment": "felix being \"serious\" then ranting about goddamn traffic cones had me for a bit", "commenter_channel_name": "@prehistorich7963", "likes": 242, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:44.282906", "replies_count": null, "liked_by_creator": false}, {"comment": "I’m from Australia and I came back from Japan last Tuesday, was my first time visiting it and I loved it. But yes I would be holding my rubbish for ages looking for a trash can  on the other hand japanese people are the most nicest people I’ve met.", "commenter_channel_name": "@jeremym9739", "likes": 5, "date": "10 months ago", "fetched_date": "2025-01-19 13:41:44.326598", "replies_count": 0, "liked_by_creator": false}, {"comment": "it is like watching an old friend talking abt his recent lives~ so relaxing and felt cheerful", "commenter_channel_name": "@lawtam95", "likes": 16, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:44.364731", "replies_count": 0, "liked_by_creator": false}, {"comment": "So nice to see Pewds just having fun with Youtube and uploading fun stuff.", "commenter_channel_name": "@Clem_Grineer", "likes": 1000, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:44.408549", "replies_count": null, "liked_by_creator": false}, {"comment": "I love the fact that you are now just enjoying life and enjoying Japan as much a possible. You truly deserve it after all the years you put into making high quality content for us. And we appreciate it a lot when you occasionally upload a video or two. I believe that because you upload videos less often, the videos are very heartfelt ️", "commenter_channel_name": "@xPasis", "likes": 51, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:44.446848", "replies_count": 0, "liked_by_creator": false}, {"comment": "Japan is amazing. Japan is the leading country in technology and robotics and I absolutely love the culture and food, it's truly amazing. The scenery is beautiful too. Japan is an amazing country that has achieved so much. 🇯🇵️", "commenter_channel_name": "@Anonymous_world5000", "likes": 4, "date": "10 months ago", "fetched_date": "2025-01-19 13:41:44.485392", "replies_count": 0, "liked_by_creator": false}, {"comment": "Ahhh Ive been following and watching you for so long Felix. It's been a crazy ride but it's nice to see you slow down and smell the roses and enjoy life and start a family in Japan. Makes me so happy that you still update us and make videos here and there even if you really don't have to. Thank you Felix and I'm so happy for you", "commenter_channel_name": "@Jaypickels", "likes": 46, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:44.524899", "replies_count": 0, "liked_by_creator": false}, {"comment": "so happy to see how he has changed through the beginning. he seems so peaceful now… i’m glad that i was watching him while growing up. it’s just feels like that he somehow influenced on my life and i’m very grateful to him for that", "commenter_channel_name": "@mira_xo", "likes": 52, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:44.563069", "replies_count": 0, "liked_by_creator": false}, {"comment": "I understand your last like point perfectly. You can feel the 'soul' of Japan alive in you when you're there. In the mountains, staring down a huge gorge in the pouring rain, the trickling of ankle deep waters between the streets. You can't explain it, but maybe all those temples and shrines truly kept the spirits alive all this time.", "commenter_channel_name": "@SalemGamorrah", "likes": 70, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:44.602170", "replies_count": 0, "liked_by_creator": false}, {"comment": "I’ve been learning Japanese, and it’s so difficult. It’s insanely rewarding when you watch Japanese content and can understand what’s being said. I’ve always wanted to go to Japan, and I’ve recently had dreams about going.. and I remember always being so anxious in my dream because I couldn’t speak the language.", "commenter_channel_name": "@kawaiiAriya", "likes": 78, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:44.642576", "replies_count": null, "liked_by_creator": false}, {"comment": "今回は、あえて日本語で感謝のコメントを残します。 \n日本のいい所や悪いところを客観的に、丁寧に多くの人に紹介してくれた事に日本人として、感謝しています   \n\n日本は文化も凄く良い部分ですが、とても安全に暮らして行けるという面でも良い国だと思います。  \n  しかし動画で紹介されているように、理由が成り立っていなくても強制されている、誰にとっても幸福では無い理不尽なルールを守らされているというのは、日本人から見てもおかしいと感じる事があり、変えていかなければならない問題だと感じます。（例えば、自分より上の立場の人が残業をしていると、自分の仕事が終わっていてもその上司の仕事を手伝うのが優先になり、定時で帰宅できない等。）\n\n最後に、日本を好きでいれくれてありがとうございます🇯🇵  これからも、より多くの人にとって暮らしやすい国であり続けられれば嬉しいです。", "commenter_channel_name": "@%E3%82%91%E3%82%90%E3%82%8A%E9%98%BF%E3%83%B3", "likes": 818, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:44.685311", "replies_count": null, "liked_by_creator": false}, {"comment": "いつも翻訳かけて見るぐらい英語分かんないんだけどぴゅでぃぱが日本語喋ってるの見る度上手くなってて凄いな〜！私も頑張んなきゃな〜！って思わされるよ\nテキスト放置してるフランス語も中国語も英語もちゃんと勉強したい！って今回も思えた！ありがと〜🫶🫶🫶", "commenter_channel_name": "@%E3%81%8F%E3%82%93-m5d", "likes": 69, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:44.726017", "replies_count": null, "liked_by_creator": false}, {"comment": "spent a lot of time in Japan. he’s right, the best places to be are outside the touristy areas and just spending time meeting locals as a foreigner. the people of japan have my respect, including my japanese girlfriend ", "commenter_channel_name": "@clinical_caliber", "likes": 9, "date": "6 months ago", "fetched_date": "2025-01-19 13:41:44.765091", "replies_count": 0, "liked_by_creator": false}, {"comment": "フェリックスさんみたいに、英語が話せない私たちを理解してくれる外国人の方に、日本にたくさん来てほしいです。日本の悪いところも理解してくれてありがとう。がまんしてくれてありがとう。ずっとマルツィアさんとワンちゃんが日本で幸せに暮らせますように", "commenter_channel_name": "@hcc9969", "likes": 369, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:44.805544", "replies_count": null, "liked_by_creator": false}, {"comment": "Felix just radiates this new calm and content energy and I'm here for that! And I must say that the way he described him having those happy moments in Japan is so well captured in his vlogs, atleast I get these vibes from them. Thank you for sharing that with us Pewds and keep on living happy and peaceful life ", "commenter_channel_name": "@lucylikes", "likes": 131, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:44.847477", "replies_count": 0, "liked_by_creator": false}, {"comment": "Yesss, Japanese people are the friendliest people ever. Went to Japan in January for the first time and was amazed by how welcoming it is!", "commenter_channel_name": "@AlexTehGr8", "likes": 32, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:44.887803", "replies_count": null, "liked_by_creator": false}, {"comment": "Dude this makes me so happy. I remember watching your videos when I was young, and to see your life unfold like this is so special. Congrats and good luck with tha bebe. Japan is awesome; I love visiting so much.", "commenter_channel_name": "@samd1075", "likes": 5, "date": "8 months ago", "fetched_date": "2025-01-19 13:41:45.011443", "replies_count": 0, "liked_by_creator": false}, {"comment": "On the last point. Personally, after living about 10 years in Japan, this still holds up. It's very rewarding to live here, as long as you can keep up with the rules. It's a peaceful place, although you will never fit in 100% and you will have to answer the same questions a million times. It's part of the \"gaman\" you have to endure, like everyone else, though the reward is unparalleled IMO.", "commenter_channel_name": "@ToniBabelony", "likes": 28, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:45.049547", "replies_count": 0, "liked_by_creator": false}, {"comment": "Pewds seem so peaceful and content at this point of his life and I'm all for it. Happy for you and Marzia, and the soon baby boy!", "commenter_channel_name": "@AggieTheFirst", "likes": 2000, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:45.089371", "replies_count": null, "liked_by_creator": false}, {"comment": "Japan is the GOAT winter vibe. Nothing beats sitting in a Japanese coffee shop at night time watching everyone go past. All the city lights etc. It's surreal", "commenter_channel_name": "@Enncee93", "likes": 30, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:45.130432", "replies_count": 0, "liked_by_creator": false}, {"comment": "日本のことをこんなにも褒めて下さりありがとうございます！日本は本当に意味がわからないルールが多いですよねわかるなぁーって思いながら聞いてました笑英語が話せない人が多い日本で暮らすのは大変なことが多いと思いますし、嫌な経験をすることもあると思いますが、これからもあなたの日本での生活がいいものであることを願ってます。\n\nThank you for praising Japan so much! There are a lot of rules in Japan that I don't really understand  I was listening while thinking I understand lol I think it's often difficult to live in Japan where there are many people who can't speak English, and you can have bad experiences. I hope that your life in Japan will continue to be a good one.", "commenter_channel_name": "@mm-w5z", "likes": 286, "date": "1 year ago (edited)", "fetched_date": "2025-01-19 13:41:45.170045", "replies_count": null, "liked_by_creator": false}, {"comment": "It makes me so incredibly happy to watch the sporadic uploads knowing that he is doing it because he wants to. He's completely at peace and living his best life, and as a long-time fan, it's beautiful to see ", "commenter_channel_name": "@sarah-sos5", "likes": 34, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:45.210636", "replies_count": 0, "liked_by_creator": false}, {"comment": "Spoiler: it's review of Japan", "commenter_channel_name": "@KalabS211", "likes": 11000, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:45.248526", "replies_count": null, "liked_by_creator": false}, {"comment": "I’m genuinely glad that you are so happy right now Felix. You definitely deserve it. ", "commenter_channel_name": "@cruisematt8585", "likes": 97, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:45.289287", "replies_count": 0, "liked_by_creator": false}, {"comment": "日本に来てくれて、ありがとうございます♡", "commenter_channel_name": "@AIdol_Nagisa_official", "likes": 18, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:45.329627", "replies_count": 0, "liked_by_creator": false}, {"comment": "Your first point was definitely what made me the most jealous of people in Japan, and that’s that it feels like there is always something unique or novel to do. And it’s so varied! You can visit thousand-year-old temples in the same day that you go to Super Nintendo World and a robot cafe. It feels like you have so many options for trips compared to other places around the world. I’m sure everywhere has a lot of options assuming your interests are varied enough, but to me it feels like domestic tourism is great in Japan", "commenter_channel_name": "@SpinningTurtle66", "likes": 124, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:45.367195", "replies_count": 0, "liked_by_creator": false}, {"comment": "I have been to Japan for on and a half months and what stood out to me that the older people was the nices and kindest of them all", "commenter_channel_name": "@natsudragonil9927", "likes": 18, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:45.405161", "replies_count": 0, "liked_by_creator": false}, {"comment": "I actually really enjoy this video, I’ll be studying in Japan soon for Uni and I enjoy seeing others opinions on japan! I enjoy your content very much!", "commenter_channel_name": "@JessicaSmith-ne6bl", "likes": 16, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:45.445177", "replies_count": 0, "liked_by_creator": false}, {"comment": "Content you seem, happy i am. Im glad you get to finallt set your journey where youre at! Im pleased to see that you and this youtube tbing is still continuing. After being here since 2012, ive had nothing but respect for you man. And now, a video like this, i understand wny you feel happier now", "commenter_channel_name": "@Brandongamesall", "likes": 4, "date": "9 months ago", "fetched_date": "2025-01-19 13:41:45.484314", "replies_count": 0, "liked_by_creator": false}, {"comment": "Having been living in Japan for 2 years, I totally relate to the last reason. Somehow I notice more simple moments like the sunlight dappling through the tree canopy, or how the dusk sky can be so vivid and varies so much depending on the time and place. Definitely gonna miss those small moments once I left Japan. \n\nPS: I saw him and Connor in one of the climbing gyms here. Didn’t want to disturb so I didn’t say hi or anything but it definitely became the highlight of the day ", "commenter_channel_name": "@jokkerrockey", "likes": 957, "date": "1 year ago (edited)", "fetched_date": "2025-01-19 13:41:45.525552", "replies_count": null, "liked_by_creator": false}, {"comment": "I've been living in Sweden from the US for about half a year now, and I can definitely relate to feeling excitement or accomplishment from being able to understand or speak the language a bit better than the last time you tried. Granted, Swedish is a LOT easier to learn for an English speaker than Japanese is, but the feeling of satisfaction is still there :)", "commenter_channel_name": "@oliviadenman155", "likes": 52, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:45.563870", "replies_count": null, "liked_by_creator": false}, {"comment": "Japaneseです️\nもし外国人と話すのを嫌がる人がいたら、その人は「ああ、外国人だ。私英語話せないよ。申し訳ないし、あんまり話さないでおこう。」と思ってる人がほとんどです\n嫌がってる顔をしても、それはあなたの事を嫌いなのではなく、英語を話さなければ行けない状況にある事が億劫なだけです", "commenter_channel_name": "@%E3%81%BE%E3%82%8B-p3n5d", "likes": 36, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:45.603102", "replies_count": 0, "liked_by_creator": false}, {"comment": "Good to hear.  Been following Abroad in Japan for almost all 10 years he's been doing vids.  I'm moving there March 2025 (got the job already, just waiting for the season I'll be working).  So absolutely excited.  I'll be in SW regions.  They haven't placed me exactly yet, but it's in the Okinawa/Miyazaki/Fukuoka area.", "commenter_channel_name": "@wildphilpresents", "likes": 3, "date": "7 months ago", "fetched_date": "2025-01-19 13:41:45.643552", "replies_count": 0, "liked_by_creator": false}, {"comment": "I’ll be moving in Japan in less than 2 weeks. I’m scared but excited. I’m sure I’ll be lonely but there are already people waiting for me there so that I won’t be too sad.\n\nIt’s my first time leaving the nest and it’ll be in my dream country. I’m there to study the language and culture.", "commenter_channel_name": "@maureencali", "likes": 27, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:45.681926", "replies_count": 0, "liked_by_creator": false}, {"comment": "I totally get the dream thing, I visited Japan last December and we were in Kyoto walking around the Yasmin-jinja Shrine. We’d looked around all of it and we went out the back exit towards the hills/forest that were filled with orange and red trees with the leaves falling, and there was a pond with a Crane standing on one leg on a rock in the middle of it. It’s probably not such a crazy thing but seeing all of that together on one of our first days in Japan didn’t really feel real.", "commenter_channel_name": "@calperrett105", "likes": 27, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:45.720830", "replies_count": 0, "liked_by_creator": false}, {"comment": "I'm an Italian studying Japanese at University. My professor found the best analogy to describe this language's difficulty: it's like Maths. Japanese truly is a hard language in the same way Maths is a hard subject for many people. If you're able to understand and memorise it's many rules and ways of expressing things, you're golden, but it's very hard to get the gist of it if you're mind is more optimised for something else. This other analogy is my own: kanji are like working out. You end up enjoying suffering and enduring because you get addicted to that sense of gradual growth and development you get when you achieve a new goal or milestone. In the end, kanji suck, but they're so much fun.", "commenter_channel_name": "@katullo11", "likes": 34, "date": "1 year ago (edited)", "fetched_date": "2025-01-19 13:41:45.760947", "replies_count": null, "liked_by_creator": false}, {"comment": "That feeling you're talking about at the end!!! The word I learned for it was \"copacetic\". It's when things are \"very satisfactory\" or \"in good order\". I get that feeling all the time, it's such a pure feeling of happiness and peace. All is right in the world for those moments. Copacetic!", "commenter_channel_name": "@belle8689", "likes": 2, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:45.799044", "replies_count": 0, "liked_by_creator": false}, {"comment": "I’ve have actively watched every video since you moved to Japan. Before your move,I would watch like 2-3 videos a month. I’ve always enjoyed your content, but now your videos look so full of life and love. This is the life you deserve after devoting so much for your fans. We appreciate and thank you ", "commenter_channel_name": "@LouforYous", "likes": 19, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:45.836148", "replies_count": 0, "liked_by_creator": false}, {"comment": "I usually don’t leave comments that often but this one hit home. I just came back from my Tokyo vacation and I kinda feel depressed being back. It was a long time dream of mine to visit Japan and it was the first time but somehow I felt really comfortable everywhere I went. The people where really nice and I felt like they really cared for your problems and it didn’t felt like I was asking for too much when I was asking for help. It really felt genuine. I don’t want to romanticize anything, I know every country has its problems but I just realized that the people are just really different form where I come from. I hope everyone can find the place where they can be happy and felix genuinely seems to have found that place.", "commenter_channel_name": "@shirayuki3242", "likes": 524, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:45.887193", "replies_count": null, "liked_by_creator": false}, {"comment": "What is your life trajectory of learning Japanese? How much did you study before arrival?", "commenter_channel_name": "@tayzonday", "likes": 379, "date": "1 year ago (edited)", "fetched_date": "2025-01-19 13:41:45.932511", "replies_count": null, "liked_by_creator": false}, {"comment": "This is extremely helpful, im about to be discharged from the military and i plan on moving to japan and ive been EXTREMLY nervous, but thanks to you i know for certain that moving to japan is what I want to do!", "commenter_channel_name": "@gabeguitar3511", "likes": 5, "date": "8 months ago", "fetched_date": "2025-01-19 13:41:45.969935", "replies_count": 0, "liked_by_creator": false}, {"comment": "Felix you made me smile very wide when you said \"smile back\" @ 6:18, thank you and hello from Ontario, Canada.", "commenter_channel_name": "@jeffharper6259", "likes": 15, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:46.009847", "replies_count": 0, "liked_by_creator": false}, {"comment": "These days watching felix’s video’s feels like catching up with an old friend. I’m genuinely happy for him finally getting where he deserves to be", "commenter_channel_name": "@wesselhoenderdos2", "likes": 52, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:46.050119", "replies_count": null, "liked_by_creator": false}, {"comment": "These videos are so much more relaxing than what other people create now. Like him and Ken just talking and laughing at funny stuff. He is just chilling now not following the trends. It helps me feel more relaxed, like most people just keep up this crazy persona to get people to watch their videos. PewDiePie is just being himself now and it really makes me happy. I did not really watch PewDiePie to much before (sorry), but these videos are in a way easy to watch and helps me feel relaxed when I am stressing out and a lot more fun to watch aswell.", "commenter_channel_name": "@thanos3534", "likes": 39, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:46.088576", "replies_count": 0, "liked_by_creator": false}, {"comment": "13:09 I really dig what you mean here…. It’s such a great feeling, like you’re living a dream without anything to worry about.", "commenter_channel_name": "@dbr_199", "likes": 3, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:46.136262", "replies_count": 0, "liked_by_creator": false}, {"comment": "this one was really wholesome. the smiles. the brofist. the reminiscing.", "commenter_channel_name": "@kristen21023", "likes": 27, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:46.184309", "replies_count": 0, "liked_by_creator": false}, {"comment": "Perhaps because I have never left Japan, I could not imagine that nature is one of the best things about Japan.\nIn fact, it feels good to hear that gentle breeze and birdsong I feel when I wake up early and go for a walk.", "commenter_channel_name": "@tat_yomi", "likes": 114, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:46.228375", "replies_count": null, "liked_by_creator": false}, {"comment": "Yeees I was just there in May and on one of my train rides, a little old man came up out of nowhere, smiled, handed me a napkin full of candies and told me to share them with my friends (as he pointed around the train). I was so dumstruck by the pure sweetness of this guy that I just gawked at him in return but I trust he knew we were cool. Everything and everyone in Japan is just on another level. I hope everyone gets to go visit one day. ", "commenter_channel_name": "@kaylawilsonx", "likes": 9, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:46.267349", "replies_count": 0, "liked_by_creator": false}, {"comment": "My grandparents are Japanese and I can relate to your last point. Whenever I visit them I leave feeling spiritual as fuck. Japan is beautiful bro the gods live there for sure", "commenter_channel_name": "@meepmoop250", "likes": 15, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:46.305895", "replies_count": 0, "liked_by_creator": false}, {"comment": "Hi Felix it's nice to see that you have found contentment, more of those happy moments and more personal peace in Japan. \nIt's nice to see that you are both so happy, and that the decision you both made has turned out to be one of the best. ", "commenter_channel_name": "@elizabethadracul120", "likes": 18, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:46.345558", "replies_count": 0, "liked_by_creator": false}, {"comment": "As a Japanese speaker and lover of Japanese culture, seeing Felix living his best life in Japan inspires me to want to live there too.", "commenter_channel_name": "@StephEatsnTravels", "likes": 148, "date": "1 year ago (edited)", "fetched_date": "2025-01-19 13:41:46.384005", "replies_count": null, "liked_by_creator": false}, {"comment": "I feel so proud to followed you all this time. This video, specially the part where you recognize those little happy moments. Make all this years worth.", "commenter_channel_name": "@marto123456able", "likes": 14, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:46.428105", "replies_count": 0, "liked_by_creator": false}, {"comment": "I'm married to an American lady and she was definitely surprised with etiquette rules in public. prior to COVID, wearing mask in public was not something she'd seen in the US. And people wear masks from allergies to having a cold. \nI always tell people Japan is a great place to visit. good review.", "commenter_channel_name": "@Ishiisan", "likes": 13, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:46.466243", "replies_count": 0, "liked_by_creator": false}, {"comment": "I love the Japan vlogs and just seeing you both so happy in Japan. It’s like a forever ongoing bonus chapters ️️️", "commenter_channel_name": "@bichtramnguyen1508", "likes": 9, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:46.503390", "replies_count": 0, "liked_by_creator": false}, {"comment": "Moved to Okinawa from Honshu 10 years ago, primarily for surfing and watersports ;)\nYou'r taking living in Japan like a champ. Taking in the good and understanding why some of the more negative aspects have to be there for all.\nTook me around 2 to 3 years to be fluent. That second year brings BIG change in understanding the language. Keep at it.", "commenter_channel_name": "@pierresakurai4812", "likes": 37, "date": "1 year ago (edited)", "fetched_date": "2025-01-19 13:41:46.546413", "replies_count": null, "liked_by_creator": false}, {"comment": "The dream feeling you talked about, I know what you mean. I felt that way when moving to England at 25 after living in Florida my entire life. It feels like every day of your life is an adventure. Everything is so new, everything is different, even the most mundane things like a walk around your neighborhood or going to a grocery store because the walk is nothing like the walk back home, the grocery store is so different from the grocery store back home. And how much different is Japan than Sweden or Italy or England - I'm sure it's amazing :)", "commenter_channel_name": "@memymomalex", "likes": 9, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:46.584974", "replies_count": null, "liked_by_creator": false}, {"comment": "(*I am using a translator!)\nWhen I saw the word \"evaluate,\" I thought, \"I wonder if I'm going to be talked down to again...,\" but I was very impressed that they were willing to accept the parts of the culture that they are not good at as part of their own culture, assuming that it is \"just personal.\n\nI really respected you as a human being.\n\nI will try my best to become a person with a flexible way of thinking like you. ......\n\nPS : I was born and live in Japan. I can hear birds chirping. The sun shining brightly through the trees. I love the feeling of being filled up just by that.\n\nI am very happy to know that even people from overseas feel the same way. ️", "commenter_channel_name": "@%E7%8C%AB%E3%81%A8%E3%81%84%E3%81%86%E5%90%8D%E3%81%AE%E7%95%9C%E7%94%9F", "likes": 5, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:46.625241", "replies_count": 0, "liked_by_creator": false}, {"comment": "日本での生活を楽しんでくれてうれしいです\nこれからも家族みんながおだやかに過ごせるよう願ってます。", "commenter_channel_name": "@%E3%81%99%E3%81%86-b2q", "likes": 101, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:46.662619", "replies_count": 0, "liked_by_creator": false}, {"comment": "7:30 「袋ご利用ですか？ fukuro goriyou desuka?」\n\n「1回払いですか？ ikkai barai desuka?」\n\n「お支払い方法をお選びください osiharai houhou o oerabi kudasai 」\n\n買った品物の代金を支払うときに、必ず聞かれるフレーズですね", "commenter_channel_name": "@%E6%A1%9C%E8%8F%9C-m9f", "likes": 7, "date": "1 year ago", "fetched_date": "2025-01-19 13:41:46.703243", "replies_count": 0, "liked_by_creator": false}], "related": []}