{"code": "Sn6NpZ6s3cM", "title": "Addressing the haters - LWIAY #00170", "url": "https://www.youtube.com/watch?v=Sn6NpZ6s3cM", "thumbnail_url": "https://i.ytimg.com/vi/Sn6NpZ6s3cM/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLDgBkLrU_hHyaZ_UPl-JwfJrwgB8A", "views": 3000000, "likes": 300000, "duration": 895, "embed_code": "https://www.youtube.com/embed/Sn6NpZ6s3cM", "uploaded_date": "2 Dec 2021", "comments_count": 9572, "comments": [{"comment": "Oh shit...I've been called out. >.>", "commenter_channel_name": "@CinnamonToastKen", "likes": 4000, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:50.685178", "replies_count": null, "liked_by_creator": false}, {"comment": "Felix, your community is wholesome, your content is entertaining, you donate to charities, remain humble and do what you like. If anyone points hate in your direction it's because they're insecure and seeking validation from others because they can't get it from themselves. Keep doing your thing king.", "commenter_channel_name": "@BackGuy", "likes": 29000, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:50.722077", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewds with a camera in a room talking shit is exactly the reason I've stayed subscribed all these years.  I love it.", "commenter_channel_name": "@DeliciousManX", "likes": 1000, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:50.763044", "replies_count": null, "liked_by_creator": false}, {"comment": "It's crazy too because despite the negativity in the community, Felix has managed to retire at 30. He is pretty much set for life now. He could disappear and still be living the dream. Now he's giving us content with what he finds enjoyable and gives us variety too", "commenter_channel_name": "@alexismurphy9641", "likes": 2000, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:50.798870", "replies_count": null, "liked_by_creator": false}, {"comment": "This man got 110 million subscribers, with just him, his camera and his pc, he could do whatever he wants, and to be honest, for somebody who's at the peak of his career like him, I'm quite amazed that he's still having fun making videos.", "commenter_channel_name": "@midfinn", "likes": 1000, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:50.834577", "replies_count": null, "liked_by_creator": false}, {"comment": "there can't be any haters, Youtube removed dislikes so everyone loves this video", "commenter_channel_name": "@Driesipops", "likes": 3000, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:50.870013", "replies_count": null, "liked_by_creator": false}, {"comment": "I honestly got back into Pewds' content because of the variety. You never know what he's gonna do next and it's simply a nice change of pace - videos with Ken, philosophy and commentary, the occasional gaming and vlog content - I feel like this is the best his channel's been because there's no pressure. He's just chilling and so should we", "commenter_channel_name": "@Bluejeanne1", "likes": 1000, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:50.905588", "replies_count": null, "liked_by_creator": false}, {"comment": "Tbh I have stuck with Felix for the last 10 years BECAUSE he’s changed. His videos have continually evolved and his variation of videos allows us to see more of his personality. It makes it feel like talking to a friend. People just love complaining and putting him into a box because they put themselves into a box.", "commenter_channel_name": "@KD36930", "likes": 318, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:50.948874", "replies_count": null, "liked_by_creator": false}, {"comment": "His assessment of how people complain because his videos have changed from what they fell in love with when they first watched his videos is 100% accurate. I feel like he described the emotions I feel about movies and shows when I’ve read the book first", "commenter_channel_name": "@abigaelwhite2383", "likes": 283, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:50.984297", "replies_count": null, "liked_by_creator": false}, {"comment": "I love how he's honest about his feelings and doesn't care about what anyone thinks. Keep doing whatever you like Felix!", "commenter_channel_name": "@psychosight3800", "likes": 1000, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.020581", "replies_count": null, "liked_by_creator": false}, {"comment": "I actually like that Felix changed over time and adapted his content, it’s the reason I kept on watching his videos. With some videos you can have a laugh and with others he inspires me/ or evokes an interest to read a book or learn more about philosophy. Keep on going! Been following the channel since Italy!", "commenter_channel_name": "@rooyvv5710", "likes": 335, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.055786", "replies_count": null, "liked_by_creator": false}, {"comment": "I really love how much I've grown with Felix. Every time I started to get bored with the channel he's evolved in a way that captured me back again, and I've been subbed since the first funny comp. I don't get how people are heated that he's changed. If his content didn't change I don't think it would be as enjoyable as it is now and I don't think Felix would be as happy.", "commenter_channel_name": "@meatywhack5300", "likes": 50, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.154508", "replies_count": null, "liked_by_creator": false}, {"comment": "I will say, I’m a 22 year old female and I subscribed YEARS ago and honestly haven’t really watched for the past like 3-4 years because the content wasn’t really what I lied. Lately though, I have watched almost every video. I feel like I can feel your actual enjoyment and change and it’s a better viewing experience for me at least. I like that you’ve decided to do what you want.", "commenter_channel_name": "@SamiraGonzalez", "likes": 379, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.194706", "replies_count": null, "liked_by_creator": false}, {"comment": "As an OG subscriber, I've never watched you as much as the last year or so. You have a great style on camera and it's so easily enjoyable to watch.", "commenter_channel_name": "@JimmyTheGiant", "likes": 4000, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.231287", "replies_count": null, "liked_by_creator": false}, {"comment": "I will admit, as a fan who found you pretty early in your YouTube career, there did come a point where your content was so different from when I started watching I took a break for a while because that high wasn't there anymore like you said but when I came back a few years ago I started catching up on the videos I missed and I realized you're just adjusting to what works for you as you get older and grow. Helped me relearn to love your new content as it continues to change with you.", "commenter_channel_name": "@chaladoonn588", "likes": 352, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.268315", "replies_count": null, "liked_by_creator": false}, {"comment": "Honestly, I'm just glad pewds still makes videos. He's been part of my routine for like 7 years. I'll literally watch whatever type of content he makes, he's entertaining ️", "commenter_channel_name": "@abbycat117", "likes": 36, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.307478", "replies_count": 0, "liked_by_creator": false}, {"comment": "Always love seeing Felix and Pewdiepie collab XD", "commenter_channel_name": "@SonicHaXD", "likes": 5000, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.344281", "replies_count": null, "liked_by_creator": false}, {"comment": "I am absolutely here for pewds being this honest self I'm all here for it", "commenter_channel_name": "@mimimi5656", "likes": 1000, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.379715", "replies_count": null, "liked_by_creator": false}, {"comment": "I like it when people grow and change otherwise it gets old and boring. I liked watching you during high school because life was hell and you made me laugh every morning, I watch you still because you’re unpredictable and happy and teach me things. Keep doing whatever you want Felix.", "commenter_channel_name": "@rollinwithpaige", "likes": 769, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.415590", "replies_count": null, "liked_by_creator": false}, {"comment": "Being almost as old as pdp I completely understand his sentiment. We’re not young anymore we can’t be screaming at video games like 5 years ago. I would have liked that 5 years ago but this version of pdp is more relatable to me as of now.", "commenter_channel_name": "@Mohashm", "likes": 22, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.448938", "replies_count": 0, "liked_by_creator": false}, {"comment": "My son grew up with you, pewds! He’s been watching you since middle school and he’s 23 now. You’re the best influence on him! He donated his birthday money to charity: water because of you, and you’ve really taught him to think critically when it comes to discerning the truth in the media. He introduced my nieces to you and they are all fantastic kids! Thank you.", "commenter_channel_name": "@saras.1718", "likes": 748, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.484699", "replies_count": null, "liked_by_creator": false}, {"comment": "pewds, loving the \"retirement\" content. Its very chill and down to earth. Keep having fun.", "commenter_channel_name": "@atomicdynamite1937", "likes": 214, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.518180", "replies_count": 0, "liked_by_creator": false}, {"comment": "perks of watching pewdiepie for almost 10 years is that youve seen how pewds channel has grown and changed over the years, im always loving whatever you have upload over this past decade!", "commenter_channel_name": "@strawbawrri249", "likes": 965, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.553363", "replies_count": null, "liked_by_creator": false}, {"comment": "I had friends who stopped watching Pewds when he started to do less play throughs. But I will always keep watching no matter what. I enjoy watching all the videos Pewds makes and growing up with him as he changes the types of videos he does. I enjoy seeing how he looks like he enjoys the videos he makes and that's what should matter in the end.", "commenter_channel_name": "@serinamutou6642", "likes": 55, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.587055", "replies_count": 0, "liked_by_creator": false}, {"comment": "I was literally saying to a friend how I’ve liked how much Pewds has grown into himself and creates the content he wants", "commenter_channel_name": "@clairecruz1325", "likes": 318, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.621578", "replies_count": null, "liked_by_creator": false}, {"comment": "honestly, on my first stumble of you when i was in school and working two jobs, i could see everyone having fun but it wasn’t really my cup of tea. my friend would convince me to check in on you every year or so, and your content and you as a person very much grew on me. now, heck, i’ve started doing YouTube, and i’m keeping up with your content far more regularly now. thank you for changing, and continuing to change, and keeping things interesting and varied. gives me hope that i can swap things around too when i feel it.\n\nCheers, Felix.\nFrom a Bro.", "commenter_channel_name": "@OneTopic", "likes": 619, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.657096", "replies_count": null, "liked_by_creator": false}, {"comment": "Man, I’ve grown up with pewds.  Been watching him for about a decade now, and I don’t think I’ve been upset about the state of his channel this whole time.  It’s impossible to get bored when the content style keeps changing.  I have no expectations, I just like Felix, and I’m happy seeing him do things that make him happy.", "commenter_channel_name": "@davidjames2788", "likes": 438, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.691656", "replies_count": null, "liked_by_creator": false}, {"comment": "Honestly, I think youre doing the best youve done in years! Im here for you and your personality. The content you do is your choice, I personally have loved how laid back and random your videos have become. Been watching you for about a decade now and I really do think youre better now than you ever were. Its been nice watching you grow and also grow along side you, too, especially being the same age. So enjoy making whatever you choose to make, you do have tons of fans that appreciate you as you have come to be!", "commenter_channel_name": "@Ishtars_Star", "likes": 26, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.725268", "replies_count": 0, "liked_by_creator": false}, {"comment": "If everyone refreshes the video 10x we can get PewDiePie his 110mil views", "commenter_channel_name": "@VasilyBuilds", "likes": 1000, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.761018", "replies_count": null, "liked_by_creator": false}, {"comment": "I know people complain that Pewds is not the same as he used to be, but seeing how he has changed/ matured over time is one of the best aspects of his videos", "commenter_channel_name": "@Bobthebuilder-tn4ns", "likes": 241, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.794611", "replies_count": 0, "liked_by_creator": false}, {"comment": "It's sad when people criticize creators for \"changing\". I understand we all get nostalgic and miss the older times, but people are allowed to grow and find new things they enjoy. When you do the same thing and over and over, it gets exhausting. You have to keep your life interesting! It's important to do things you love and not do something just because people want you to do it.\nPewds has done more than enough content wise, like he said, he's \"retired\". He just wants to make chill videos and do what he likes. He's such a wholesome, genuine person and has never let his sub count or money turn him into an asshole.\nMad respect for you, my dude. Keep doing what you love! <3 It's been so fun watching you grow over the years.", "commenter_channel_name": "@eliminature", "likes": 309, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.828127", "replies_count": 0, "liked_by_creator": false}, {"comment": "I’m a little late to the comment section here but as a 34yo fellow 19yo I must say that it’s been nice seeing Pewds mature along with his content and sub base. Haters will always hate because that’s what they are at the core. Keep doing what you love, Pewds. True fans will respect you for it.", "commenter_channel_name": "@GrandmasFolly", "likes": 7, "date": "2 years ago", "fetched_date": "2025-01-19 14:55:51.861762", "replies_count": 0, "liked_by_creator": false}, {"comment": "Personally I've enjoyed most of the content Felix has made throughout the years. I subscribe for the creator, not just the content.", "commenter_channel_name": "@Harry_SS", "likes": 1000, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.896972", "replies_count": null, "liked_by_creator": false}, {"comment": "\"If there is no sigh at the beginning, then its not an apology video\" \n - said dumbledore quietly", "commenter_channel_name": "@Avocadoughh", "likes": 360, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.932179", "replies_count": null, "liked_by_creator": false}, {"comment": "He seems really relaxed and happy in this one, nice to see him being himself more and not as worried about things", "commenter_channel_name": "@yeetusfeetus5555", "likes": 537, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:51.968073", "replies_count": null, "liked_by_creator": false}, {"comment": "Exactly Pewds, nothing lasts forever. I’m guessing in years time, some of your viewers will realize that. And I totally agree that your first time experiencing something always will fondly be remembered.", "commenter_channel_name": "@JegoEXP", "likes": 10, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:52.001231", "replies_count": 0, "liked_by_creator": false}, {"comment": "I keep watching every day, every month, every year! The other 108 mil should too", "commenter_channel_name": "@CalligraphyMasters", "likes": 2000, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:52.036909", "replies_count": null, "liked_by_creator": false}, {"comment": "\"There's always haters, no matter what you're doing whether they're complaining that everything you do sounds the same, or it's too different.\" -Avicii", "commenter_channel_name": "@MartiganzYT", "likes": 303, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:52.072284", "replies_count": null, "liked_by_creator": false}, {"comment": "Article: They crashed after 65 hours\n\nFelix: They crashed after 68 hours", "commenter_channel_name": "@evanjoao9678", "likes": 210, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:52.108004", "replies_count": null, "liked_by_creator": false}, {"comment": "Been with you since the original Slenderman and Amnesia playthroughs. I feel as though I've watched you grow and grown alongside you. Don't let the haters get to you. OG 9yo army's got your back!!! ", "commenter_channel_name": "@Orion_TheyThem", "likes": 13, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:55:52.141973", "replies_count": 0, "liked_by_creator": false}, {"comment": "“I’m just chillin’, homie, goddamn. Don’t ruin the vibe.”\nIf that ain’t me every day at work. \n\nBut for real, Felix, it’s been awesome seeing you change/grow and to be able to grow up with you in a way. Thanks for not giving in to the whiners and for being true to yourself.", "commenter_channel_name": "@monicaleah2951", "likes": 686, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:52.176408", "replies_count": 0, "liked_by_creator": false}, {"comment": "It’s actually like super refreshing seeing a content creator make something they actually want to do instead of trying to appeal to the algorithm bro keep it up!!", "commenter_channel_name": "@ItsDesca", "likes": 75, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:52.209642", "replies_count": 0, "liked_by_creator": false}, {"comment": "I don't care if people says that Felix has changed over the years and that they liked his content way more than today's, I'm just glad that he did changed because I did it as well, just as he did, I also improve myself and grew up. I've been subscribed for almost 10 years now, and tbh if he remained the same as 2013 Pewdiepie I would definitely stop watching him after a couple years, the same content over and over again just gets boring, but not with Felix cuz he is always making actual relevant content and doing whatever he likes. \nKeep it going Felix, as long as you're having fun, I'll keep watching your content.", "commenter_channel_name": "@GonSSB", "likes": 614, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:55:52.245082", "replies_count": null, "liked_by_creator": false}, {"comment": "It's crazy how far pewdiepie has came... I remember coming home from school and just watching pewdiepie videos and all my stress would fade away. He is always happy and making us feel like we are friends even though we will never meet him.", "commenter_channel_name": "@MrJustThatGuy", "likes": 29, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:52.279163", "replies_count": 0, "liked_by_creator": false}, {"comment": "Pewds: \" You can do what ever you wanna do just by doing it. \"\nme: watches pewd's video instead of preparing exams", "commenter_channel_name": "@augustinlebayon2255", "likes": 222, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:52.312945", "replies_count": null, "liked_by_creator": false}, {"comment": "some people just forget that felix is human, people grow, change and focus on other things. he has his own life. the fact that he still makes videos is amazing. I still pop by and see a video every now and then for the nostalgia, love you pewds <3", "commenter_channel_name": "@hackit1292", "likes": 69, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:52.346894", "replies_count": 0, "liked_by_creator": false}, {"comment": "I honestly still watch Felix because he changed over the years. It felt as if I was growing up with a dear friend. If Felix still did amnesia and or happy wheels for all his videos I probably would have stopped watching. The fact that he changed and evolved with his audience and brought new audiences with it I feel is what made him so popular and loved.", "commenter_channel_name": "@yuyulliz", "likes": 60, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:55:52.382568", "replies_count": 0, "liked_by_creator": false}, {"comment": "This video is the explaination of why he's the best....", "commenter_channel_name": "@veolrodrigues9055", "likes": 626, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:52.418464", "replies_count": null, "liked_by_creator": false}, {"comment": "\"Behind every sucessful person lies a pack of Haters! I love my haters!\"\n- Gloria Tesch", "commenter_channel_name": "@PriyanshuBharadwa", "likes": 35, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:52.452294", "replies_count": 0, "liked_by_creator": false}, {"comment": "I'm fairly new to PewDiePie, I just appreciate how genuine Felix is.", "commenter_channel_name": "@MyPetFishRex", "likes": 144, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:52.488497", "replies_count": null, "liked_by_creator": false}, {"comment": "I enjoy Felix's content been here for awhile and it's just like hanging with a mate. You joke around, some serious times, and just have chill relaxed convo. All you can do is be the best you, people are going to judge no matter what, so why not put out things you enjoy.", "commenter_channel_name": "@TrulyTree", "likes": 16, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:52.522300", "replies_count": 0, "liked_by_creator": false}, {"comment": "Whenever Felix is genuinely happy making his videos they turn out so well.", "commenter_channel_name": "@crystaldrawstrash", "likes": 594, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:52.558618", "replies_count": null, "liked_by_creator": false}, {"comment": "I think the people who say they don't like you anymore are the ones who have a hard time moving forward in life. They're the people who want to be back in the \"good old days,\" instead of making the most out of today. I've followed you since the Amnesia days and, well you lost me when you went on your weird cringe phase, but you brought me back when I saw you branching out and being yourself. You got my forever subscription when you proved that you will never sell yourself out for money or fame, nor do you allow yourself to be changed by your success. You've grown and changed and I've grown and changed. The world changes and that's okay. You doing whatever you want, acknowledging when you've made a mistake, but also standing up for yourself when you know you didn't do anything wrong, your desire to inspire people to be good to themselves, it's all amazing man.", "commenter_channel_name": "@12Ajay1251", "likes": 503, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:52.594106", "replies_count": null, "liked_by_creator": false}, {"comment": "It's his energy that I like so much. Vibes,if you will. He's humorous, intelligent, NON-TOXIC, self-made, yet humble guy with healthy morals. I've been following him for years and It doesn't feel like he's a youtuber, more like a good old friend. Love you,Pewds! Don't change!\n( p.s. 8:38 good job,Sive! Looks awesome indeed)", "commenter_channel_name": "@LighthouseSun", "likes": 684, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:55:52.630748", "replies_count": null, "liked_by_creator": false}, {"comment": "As much as I feel like I’ve grown away from this channel, I still remember when I was younger and would watch these while avoiding certain, ahem, problems.  Keep making content my guy, here’s hoping other kids get to grow up with the stuff I did", "commenter_channel_name": "@velociraptorthekingofthedi6821", "likes": 7, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:52.664159", "replies_count": 0, "liked_by_creator": false}, {"comment": "5:53 pewds: damn is there a cocomelon conspiracy here ?\n19yos: hold on, this whole operation was your idea", "commenter_channel_name": "@ombhosale3949", "likes": 46, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:52.698021", "replies_count": 0, "liked_by_creator": false}, {"comment": "Felix is the exact description of transparency and taking accountability because he knows to do the right thing. Adore you Felix, keep going and never look back at those fools who try to tell you other wise ️", "commenter_channel_name": "@sofiasanchez8375", "likes": 71, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:52.733750", "replies_count": null, "liked_by_creator": false}, {"comment": "I found it interesting when Pewds was talking about people who associate him with certain types of video content. I personally have always loved Pewd’s videos regardless of the topic because of his humour and his personality", "commenter_channel_name": "@arosew7", "likes": 1000, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:52.769105", "replies_count": null, "liked_by_creator": false}, {"comment": "When I first started watching YouTube I hadn't heard of you but every other channels mentions how big you are so I went to check you out and immediately understood why you were the king of YouTube. I've continued to enjoy your variety of content and it's always fun. Keep doing what you're doing.", "commenter_channel_name": "@spasticsadcase", "likes": 6, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:52.860575", "replies_count": 0, "liked_by_creator": false}, {"comment": "\"Rumors are carried by haters, spread by fools, and accepted by idiots.\"", "commenter_channel_name": "@PriyanshuBharadwa", "likes": 67, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:52.896511", "replies_count": null, "liked_by_creator": false}, {"comment": "I'm almost 40 and a mom of 4 young children, my favorite videos you do are the philosophy ones, book reviews, and so on. Don't get me wrong, I LOVE all your videos, but I really like learning so those kinds will always be best to me. I'm eternally grateful that I started watching you.", "commenter_channel_name": "@beebarfthebard", "likes": 19, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:52.930064", "replies_count": 0, "liked_by_creator": false}, {"comment": "I don't know if this is going to make sense to the majority of the population, but.... I mainly watch youtubers for their personalities.  Their content can be whatever, but I'll still enjoy watching them because they're people like me and they're fun to spend time with.\nSo - you do you, Pewds.", "commenter_channel_name": "@kristenj8020", "likes": 859, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:52.966577", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewds, relax man. I'm mostly part of the people who don't watch your videos, I'm subbed because I immensely value who you are and everything you've done and continue doing.\n\nAlso every couple months or so I decide to watch some of your videos and just have fun seeing how your changing and evolving, but still managing to be the amazing person that I truly think you are.", "commenter_channel_name": "@Auctor42042", "likes": 5, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:53.000172", "replies_count": 0, "liked_by_creator": false}, {"comment": "The dislike removal isn't for creators, it's for corporations. They don't want people to see when someone dislikes their brand/product.", "commenter_channel_name": "@nickn271", "likes": 328, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:53.036659", "replies_count": null, "liked_by_creator": false}, {"comment": "For me who grew up watching his videos as a kid, going from Happy wheels/Horror to Batsh*t crazy and mature content felt like I grew up with Felix because I also went through those phases. I once became an edgy teenager who would shout and be giggly and hyper but now when I became an adult I genuinely Enjoy his videos that has a more mellow and calming atmosphere. I can watch his videos and it feels like catching up with an old friend who you just want to chill with and stuff.\n\nI love you Felix, be what you want to be.", "commenter_channel_name": "@MichaelYumizuri", "likes": 63, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:53.072566", "replies_count": null, "liked_by_creator": false}, {"comment": "i guess the regular 2M++ viewers here are truly here for you and your personality and i'm glad that that's enough to make you stay longer :) we love your videos pewds and I look forward to them every single day <3", "commenter_channel_name": "@jes7723", "likes": 28, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:53.106872", "replies_count": 0, "liked_by_creator": false}, {"comment": "Just gotta say. I’ve hung around with your content on and off for years and I love all of it. The vibe is tight and shall not be killed. Watching your content and character evolve has been nothing but a hilarious pleasure mighty pewds. Screw da haters, u always killin it", "commenter_channel_name": "@Chriskriller", "likes": 8, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:53.140566", "replies_count": 0, "liked_by_creator": false}, {"comment": "As someone who struggles to focus on one specific thing at a time, I appreciate the variety of content because it keeps me watching and not get bores of a series or lose focus", "commenter_channel_name": "@Tournelis", "likes": 59, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:53.176642", "replies_count": null, "liked_by_creator": false}, {"comment": "Felix: \"Can there be a way to make the sink the dishwasher?\"\nMe who's been washing my dishes in the sink forever: ", "commenter_channel_name": "@GarryKeepTheKey", "likes": 483, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:55:53.212642", "replies_count": null, "liked_by_creator": false}, {"comment": "Imagine being a hater in such a wholesome community...", "commenter_channel_name": "@kingfalkern", "likes": 893, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:55:53.248046", "replies_count": null, "liked_by_creator": false}, {"comment": "You're so humble. I've watched you for half of my life and never seen a reason for anyone to hate you. People who judge Pewds need to do some introspection.", "commenter_channel_name": "@kaleymuil", "likes": 7, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:53.281305", "replies_count": 0, "liked_by_creator": false}, {"comment": "08:40 \nDamn, after that heavenly CG, Sive needs a huge raise ASAP..", "commenter_channel_name": "@dankcroissant1462", "likes": 17, "date": "3 years ago (edited)", "fetched_date": "2025-01-19 14:55:53.315558", "replies_count": 0, "liked_by_creator": false}, {"comment": "No matter what Felix decides to do his community will always be behind him and support him 100%", "commenter_channel_name": "@emma_nutella58", "likes": 825, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:53.359176", "replies_count": null, "liked_by_creator": false}, {"comment": "I love watching pewds simply because of the way he is, chill, humble and funny", "commenter_channel_name": "@TayIllustrates", "likes": 325, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:53.395802", "replies_count": null, "liked_by_creator": false}, {"comment": "I love how you’re still consistent until now and I watch every single one of your videoooo!! I am a big fan from 2012 and will always be! Think about us!! the haters don’t matter", "commenter_channel_name": "@TamaraCoglitore", "likes": 8, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:53.429549", "replies_count": 0, "liked_by_creator": false}, {"comment": "I watch when I’m stressed, which has been the past 20 years. Life got brighter when you started content. We love you Felix!", "commenter_channel_name": "@user-lg1vo8sh3r", "likes": 111, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:53.465638", "replies_count": null, "liked_by_creator": false}, {"comment": "Agreed. Couldn't be explained better: people will always remember the first time they discovered Pewdiepie as the highest point, regardless the moment in his career.", "commenter_channel_name": "@Lamsan02", "likes": 22, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:53.499858", "replies_count": 0, "liked_by_creator": false}, {"comment": "Where are these haters, I can’t see any dislikes on this vid-", "commenter_channel_name": "@SoniasWay", "likes": 147, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:53.535554", "replies_count": null, "liked_by_creator": false}, {"comment": "The last time I watched Pewds so much (before 2021) was during the Oculus days tbh \nI religiously watched the Outlast and Amnesia series but that was the last time I was so active here. But the recent content (especially the TLC stuff lol) has gotten me back. Love you pewds ", "commenter_channel_name": "@abby__7867", "likes": 1, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:53.571936", "replies_count": null, "liked_by_creator": false}, {"comment": "I don’t think those people realise how lucky they are to even still be getting content from you at this point. Do whatever makes you feel happy, and they can find som other place that suits them.", "commenter_channel_name": "@MizMima", "likes": 84, "date": "3 years ago", "fetched_date": "2025-01-19 14:55:53.607841", "replies_count": null, "liked_by_creator": false}], "related": []}