{"code": "yxbO9K7lKbQ", "title": "A dream of mine came true today", "url": "https://www.youtube.com/watch?v=yxbO9K7lKbQ", "thumbnail_url": "https://i.ytimg.com/vi/yxbO9K7lKbQ/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLDjRftOL8d896CxCJilG7jlxiO7yQ", "views": 3000000, "likes": 279000, "duration": "", "embed_code": "https://www.youtube.com/embed/yxbO9K7lKbQ", "uploaded_date": "20 Jul 2022", "comments_count": 16363, "comments": [{"comment": "I can confirm that the footage was indeed worth it!", "commenter_channel_name": "@ESOdanny", "likes": 15000, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:29.003994", "replies_count": null, "liked_by_creator": false}, {"comment": "PewDiePie is like that gamer who completed all of the game and now is doing side quests for fun", "commenter_channel_name": "@-SimonRiley", "likes": 6000, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:29.049040", "replies_count": null, "liked_by_creator": false}, {"comment": "marzia's editing really emphasizes the vibe in those aestheticy japan places. also the frequency ur uploading the vlogs i think is perfect", "commenter_channel_name": "@ahmedanwer6899", "likes": 2000, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:29.094714", "replies_count": null, "liked_by_creator": false}, {"comment": "“Wish for Maya to become healthy”- we all wish and pray for that Felix ️", "commenter_channel_name": "@cruisematt8585", "likes": 656, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:29.140137", "replies_count": null, "liked_by_creator": false}, {"comment": "I think the reason we love these vlogs is because they actually are. There’s no fake moments to add suspense or tell a story, it’s just their lives. It’s so wholesome and we are all here for it", "commenter_channel_name": "@RealWorldReview", "likes": 1000, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:29.183095", "replies_count": null, "liked_by_creator": false}, {"comment": "Just a guy his wife and 2 dogs finding a reason to smile everyday how could you not be happy watching this. Thank you Felix", "commenter_channel_name": "@andrewsamuel4802", "likes": 1000, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:29.230398", "replies_count": null, "liked_by_creator": false}, {"comment": "My boys living the retired life.. it’s good to see him getting a break and being able to enjoy life a little more than before  I’ve watched you since I was a wee lad and it’s amazing to see how much you’ve grown mentally and as a YouTuber congratulations PewDiePie keep up the breath taking work!!", "commenter_channel_name": "@prodigybspyjohnson6114", "likes": 1000, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:29.273137", "replies_count": null, "liked_by_creator": false}, {"comment": "This is what YouTube was supposed to be. Just creators having a good time, doing what they want and being happy. Feels so wholesome and a breath of fresh air tbh", "commenter_channel_name": "@furlycee", "likes": 498, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:29.331157", "replies_count": null, "liked_by_creator": false}, {"comment": "Loving these japan vlogs, and Marzia has been killin it on the edits! ", "commenter_channel_name": "@NotPaulGG", "likes": 23000, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:29.386466", "replies_count": null, "liked_by_creator": false}, {"comment": "this is genuinely my favorite arc to follow on any content creator. i think seeing the mad grind  finally slowed down and relaxed is the vibe we all want to achieve one day. <3 well vlogs lads.", "commenter_channel_name": "@jessicanigri", "likes": 2000, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:29.437861", "replies_count": null, "liked_by_creator": false}, {"comment": "Marzia's editing is definitely missed, it so calming yet entertaining. She always hits that perfect balance. And dont get me started on her music choice, its always A1!!", "commenter_channel_name": "@sherleenminier7927", "likes": 7000, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:29.485140", "replies_count": null, "liked_by_creator": false}, {"comment": "The growth of this person is just incredible. Pewds, you've become so inspirational. Not that you just say inspiring stuff, more like the way you live, talk, what you think about things. You just get up and do the stuff you want to without finding excuses why \"not today\", which is something I struggle with a lot. At least it looks like that in the vlogs. It's awesome and I am so happy for you!", "commenter_channel_name": "@zuzpager", "likes": 809, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:29.537483", "replies_count": null, "liked_by_creator": false}, {"comment": "Seeing people living their dream life and being happy is refreshing considering how negative is youtube these past few years. I'm so happy for him and Marzia.", "commenter_channel_name": "@herclowness", "likes": 611, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:29.582266", "replies_count": null, "liked_by_creator": false}, {"comment": "I love that Marzia is editing. I get to feel like you're both in the video in a way. And keep doing whatever you want to do for videos. It's nice to be along for the journey.", "commenter_channel_name": "@hannahrannah2739", "likes": 641, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:29.627409", "replies_count": null, "liked_by_creator": false}, {"comment": "I'm really happy to see Marzia more often. You guys have such a delightful, chill energy together. I agree with others, make these vlogs because you're having fun doing it. No obligation to us. ", "commenter_channel_name": "@catbertz", "likes": 1000, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:29.672447", "replies_count": null, "liked_by_creator": false}, {"comment": "These Vlogs are so uplifting, just getting a tiny glimpse into your new lives and how happy you both are really pushes me to be my best and achieve the things in life I want. Thank you for keeping up with these.", "commenter_channel_name": "@mrdaniam7131", "likes": 577, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:29.714524", "replies_count": null, "liked_by_creator": false}, {"comment": "Of course we love Marzia's editing, it's like she is back for us, she is expressing herself too. I really enjoy this vlogs", "commenter_channel_name": "@lindafavela3287", "likes": 601, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:29.775468", "replies_count": null, "liked_by_creator": false}, {"comment": "ive been watching pewds for almost a decade and at this point it feels like the after story\nhe made it on youtube, achieved 100mil subscribers, married the woman he loves and moved to japan\nthe vlogs are so calming and genuine, they let me forget my everday stress and own problems for a bit\n\nthanks dude", "commenter_channel_name": "@DedCatVT", "likes": 233, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:29.833191", "replies_count": 0, "liked_by_creator": false}, {"comment": "I love marzia's editing. She's doing such a great job at these.", "commenter_channel_name": "@pantis_", "likes": 858, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:29.884304", "replies_count": null, "liked_by_creator": false}, {"comment": "As a Japanese, seeing foreign people visiting more rural areas rather than Tokyo, Osaka, Sapporo etc makes me happy ", "commenter_channel_name": "@WeepingRichard", "likes": 449, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:29.934844", "replies_count": null, "liked_by_creator": false}, {"comment": "These Japan vlogs are so nice to see. Rather than being forced to follow the rules of the YouTube algorithm, it is amazing to see Pewdiepie make what he feels like making instead.", "commenter_channel_name": "@youtuberstatistics", "likes": 19000, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:29.988631", "replies_count": null, "liked_by_creator": false}, {"comment": "Marzia editing style is great. I love how chill this vlogs are, takes me out of my hectic routine for a little bit, so I appreciate it. Hope you guys continue vlogging the things you like to do, but don't feel forced to go out for the sake of vlogging. We want to be along for the ride, not for the ride to be manufactured. Just have fun and so will we.", "commenter_channel_name": "@MrCristobalRojas", "likes": 535, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:30.040331", "replies_count": null, "liked_by_creator": false}, {"comment": "Marzia’s edits have such a lovely warmth to them. I love her music choices, the filters…it’s just beautiful. Watching them is relaxing", "commenter_channel_name": "@SamLyn", "likes": 323, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:30.085754", "replies_count": null, "liked_by_creator": false}, {"comment": "I got teary eyed watching this video. This is the first time in a long time that i've watched your videos. I missed the comfort of staying in bed while watching your videos :')) iloveyou both, always have, and always will!", "commenter_channel_name": "@kehayanameyn3639", "likes": 285, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:30.129776", "replies_count": null, "liked_by_creator": false}, {"comment": "Marzia has such an eye for wonderful shots that make you feel like you’re right there sightseeing with you guys. It’s awesome to see you both just adventure around and enjoy yourselves!! You’ve both worked incredibly hard to get here, you deserve to relax and have a good time on a new adventure together♡", "commenter_channel_name": "@kenziestrixxer", "likes": 517, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:16:30.173846", "replies_count": null, "liked_by_creator": false}, {"comment": "A moment to appreciate the fact that Felix & Marzia chose to invite us on their journeys, even though it would've been more convenient for them to forget about phones and recordings and live every moment of them to the fullest.\nWe appreciate you bro", "commenter_channel_name": "@nawarz2181", "likes": 437, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:30.247736", "replies_count": null, "liked_by_creator": false}, {"comment": "I love the Japan vlogs, something about them are just so relaxing. Thank you Pewds and Marzia for them ", "commenter_channel_name": "@DanSurprise", "likes": 2000, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:30.301682", "replies_count": null, "liked_by_creator": false}, {"comment": "Marzia's videos were my favorite and noticing that she's editing this vlogs makes the vlogs even better. Been loving your content, Pewds! Hope both of you  (and Maya and Edgar, ofc!) have a wonderful journey in Japan!", "commenter_channel_name": "@danielabessa1238", "likes": 68, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:30.342504", "replies_count": 0, "liked_by_creator": false}, {"comment": "idk why but watching his old videos and then coming to this it feels like pewds is finally at peace like hes not screaming anymore and hes alot more relaxed almost feels like a mini retirement love these vlogs pewds keep doing what u love", "commenter_channel_name": "@Acarillo758", "likes": 762, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:30.384829", "replies_count": null, "liked_by_creator": false}, {"comment": "These vlogs are giving me like “afterlife vibes” like he’s living in his paradise and we are getting a glimpse into it. Especially because he visited the place where he proposed", "commenter_channel_name": "@Anthonyh-06", "likes": 579, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:30.423738", "replies_count": null, "liked_by_creator": false}, {"comment": "it's sooo calming to see felix having fun it has been a long journey and seeing him having fun and living his dream actually puts a smile on my face", "commenter_channel_name": "@hitclub-F4", "likes": 433, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:30.462446", "replies_count": null, "liked_by_creator": false}, {"comment": "Every time i watch one of these i assume i'll click off in a couple of minuets but find my self watching and genuinely enjoying the whole thing. I think you've got such a healthy and magnetic mindset and a way about you where you can except some mistakes every once in a while and focus more on enjoying life rather that focusing on that one wave you missed. It's a great way to take on life and is such an admirable way of living that you honestly project to your audience. your a great individual and your growth, thought processes, as-well as lifestyle choices are plainly inspired by those you hold close as well as your own formidable mental fortitude, whatever you decide to create and put your heart into will be worth seeing and smiling at. Your doing great, the vlogs are entertaining well made and make the viewer happy. Keep doing what you want to do, for as long as you want to do it, as consistently as you feel you should know that real people down here are really happy for you and proud of the person you have and are becoming.", "commenter_channel_name": "@chaserubisch1712", "likes": 96, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:30.498046", "replies_count": 0, "liked_by_creator": false}, {"comment": "I'm enjoying the departure from the \"norm\" with these vlogs. Marzia's editing style is complemented by your simple, natural approach to the experiences you're shooting. There's no clickbaity scenes or over-the-top acting to dramatise anything. You two are just being you, and we love this. All the best to you and your good lady, and to your cute puppers.", "commenter_channel_name": "@carlbrown9082", "likes": 900, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:30.535209", "replies_count": null, "liked_by_creator": false}, {"comment": "Its like Pewds finally found his peace. A happiness I haven’t seen before from him. I’m loving it, you’re amazing Felix. We all love you️", "commenter_channel_name": "@visualalx", "likes": 631, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:16:30.573869", "replies_count": null, "liked_by_creator": false}, {"comment": "\"Don't do that. You wanna just enjoy it.\" Surfer sensei actually dropping some profound life advice. If you miss the first wave of opportunity, don't worry. You just have to be patient and wait for another to come. No to FOMO. No wonder surfers are more chill.", "commenter_channel_name": "@kennnnnethchua", "likes": 230, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:16:30.711789", "replies_count": 0, "liked_by_creator": false}, {"comment": "this video gave me the chills, japan is breathtaking. Makes me happy seeing you two and the dogs having fun! Hope maya becomes healthy soon!!!", "commenter_channel_name": "@dina-vm7ft", "likes": 47, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:30.769165", "replies_count": 0, "liked_by_creator": false}, {"comment": "The shot that ended with Pewds losing his phone was 100% worth it god damn", "commenter_channel_name": "@ConClasher3", "likes": 90, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:31.022819", "replies_count": null, "liked_by_creator": false}, {"comment": "I miss Marzia’s videos so much, it makes me so happy to know that she’s editing these vlogs. Visiting Japan has always been a dream of mine, and honestly just watching you have fun and chilling feels like I’m fulfilling my dream. Just share what you’re comfortable, it’s been amazing!", "commenter_channel_name": "@Hikaru1197", "likes": 655, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:31.064059", "replies_count": null, "liked_by_creator": false}, {"comment": "This makes me miss Marzia's channel so darn much. I'm glad she's editing these! It's like her way of saying \"Hey, don't worry, I'm still here :)\"\n\nEdit: dang autocorrect made Marzia into Maria", "commenter_channel_name": "@Murk.mp4", "likes": 1000, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:16:31.102086", "replies_count": null, "liked_by_creator": false}, {"comment": "marzia has such a keen eye for japan's aesthetic, love her editing style on the vlogs", "commenter_channel_name": "@nikaro6890", "likes": 62, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:31.138314", "replies_count": 0, "liked_by_creator": false}, {"comment": "It is actually easier to go to the comment section and like every comment thats says all about enjoying these vlogs, but they are sooo nice and enjoyable/relaxing that I want to post my own comment about it, liking a bunch of them is not enough. Very happy for you both  I totally think you should continue this series as long as you both feel comfortable with.", "commenter_channel_name": "@ceciigila", "likes": 364, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:31.176846", "replies_count": null, "liked_by_creator": false}, {"comment": "These blogs have been nostalgic for me but I haven't been able to put my finger on why. Marzia editing them makes sense. She's always been good at making content feel soothing and hopeful. Also, motivational. It's difficult to describe exactly how but it makes me feel like the things I've always wanted to do are possible. I can just save up and do one lesson to see where it goes from there.", "commenter_channel_name": "@kathleenoswald6215", "likes": 343, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:31.214682", "replies_count": null, "liked_by_creator": false}, {"comment": "I honestly love just how pewdiepie is having fun living life. It makes me also want to be happy of the little things in life. Seeing pewds just smile a lot and being excited for the little things is great.\nLove to you pewds thanks for the vlogs! ♡", "commenter_channel_name": "@nataliaperez3670", "likes": 405, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:31.252297", "replies_count": null, "liked_by_creator": false}, {"comment": "Maya and Edgar are really out here living their best lives. Chilling at the beach, going on long visually exciting walks through the streets of Japan ", "commenter_channel_name": "@sashay4330", "likes": 34, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:31.289499", "replies_count": 0, "liked_by_creator": false}, {"comment": "\"Play the clip that broke the phone... Tell me if it was worth it.\"\n\nIt was worth it, Pewds. It was absolutely worth it ", "commenter_channel_name": "@revinaque1342", "likes": 248, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:31.329988", "replies_count": null, "liked_by_creator": false}, {"comment": "Marzia's editing is impressive. These videos are so soothing and the lo-fi beats that she uses are some of the best. Would love to know the source for these. Also, thanks pewds for these 24 minutes of constant wholesomeness, now, I can start my day on a better note", "commenter_channel_name": "@simantasaha4051", "likes": 159, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:31.372266", "replies_count": 0, "liked_by_creator": false}, {"comment": "I didn't know Marzia edits these! The editing style is definetly a major reason for why these vlogs are so good and likeable, thanks Marzia!", "commenter_channel_name": "@ygjnse", "likes": 110, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:31.419386", "replies_count": null, "liked_by_creator": false}, {"comment": "Okay, running back through these vlogs and catching this little chat at the end was so warm and perfect. It also makes so. much. sense. There's so much positivity fueling these vlogs across Felix and Marzia's gratitude to enter their next stage of life, especially in a new place to explore, get lost in. But, honestly, I think a huge aspect of it really is this combined effort of Felix and Marzia, with Marzia editing the vlogs. There's such a combined positivity from both of them, united to celebrate their life in the best way. I'm just so willing to ride these vlogs every chance I get. Thank you for sharing this stage of your life with us.", "commenter_channel_name": "@winslow8779", "likes": 10, "date": "1 year ago", "fetched_date": "2025-01-19 14:16:31.591994", "replies_count": 0, "liked_by_creator": false}, {"comment": "These vlogs radiates so positive energy, ever since they moved to Japan both marzia and felix look more calm and condensed then ever .\nHave all types of happiness both of you . Prayers for maya’s health. Editing always felt so marzia , it makes perfect combinations of both of you I guess that’s why we love it so much \nMy favourite j vloggers", "commenter_channel_name": "@ayushimeshram4331", "likes": 467, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:31.697983", "replies_count": null, "liked_by_creator": false}, {"comment": "watching pewdiepie for years has really been such a journey it feels like. at age 22 i look back now and i think about when i first discovered pewds. bingeing hours of horror play throughs so much so that i’d fall asleep through first and second period of 2 years worth of middle school.. to grow up and watch felix go through his own phases with the videos has been so crazy. and NOW. watching his videos, i sit here and i tear up. because it’s almost like i’m living the felix vicariously. to see all he’s accomplished. it feels like we won because he won. seeing him smiling and feeling the genuine happiness through these japan vlogs makes my heart happy. im so exceptionally happy with where he’s at, and i’m overwhelmed watching these vlogs. we, and i love you pewdiepie.", "commenter_channel_name": "@DyluxeMD", "likes": 145, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:31.747156", "replies_count": null, "liked_by_creator": false}, {"comment": "24mn of constant smiling without even noticing. Watching pewds being genuinely happy and impressed by evrything he sees is so wholesome especially with Marzia's great and relaxing editing. really love these vlogs", "commenter_channel_name": "@idontmissher", "likes": 354, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:31.798931", "replies_count": null, "liked_by_creator": false}, {"comment": "Marzia's style has really elevated your work, she is very talented and does a fantastic job, I Truly love these dreamy vlogs", "commenter_channel_name": "@JustJosieyall", "likes": 2, "date": "6 months ago", "fetched_date": "2025-01-19 14:16:31.849171", "replies_count": 0, "liked_by_creator": false}, {"comment": "the vlogs just overflow with positivity and wholesomeness, of course that’s what you’ll attract in the comments too :)) love the surf teacher’s nudge to focus on having fun, so simple but can change your perspective on the whole experience. thank you tooo felix and mertz <3", "commenter_channel_name": "@jes7723", "likes": 530, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:31.903416", "replies_count": null, "liked_by_creator": false}, {"comment": "Honestly I was so sad when Marzia took down her channel, it’s been heart warming to see her editing again. She is so good at capturing everyday magic. So needless to say I’m loving the vlogs. :)", "commenter_channel_name": "@KatHood", "likes": 80, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:31.941396", "replies_count": 0, "liked_by_creator": false}, {"comment": "I like this chill retirement era of Pewds. It's been a long journey and everyone is just glad to still have Felix around.", "commenter_channel_name": "@yadam415", "likes": 91, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:31.978694", "replies_count": null, "liked_by_creator": false}, {"comment": "These vlogs are literally my favorite thing on youtube! Cheers to you guys, its such a cozy and indescribable feeling to see you enjoy your lives and just live in the moment. It’s really heartwarming to see you both being happy!", "commenter_channel_name": "@arixne008", "likes": 26, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:32.014961", "replies_count": 0, "liked_by_creator": false}, {"comment": "This is the most genuine YouTube content I’ve seen in the last 5 years and I love it", "commenter_channel_name": "@henrymelon8781", "likes": 481, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:32.054747", "replies_count": null, "liked_by_creator": false}, {"comment": "22:24 that \"huge thanks\" there, we felt that Felix. We felt that. So glad to just sit back and listen to your little chat, feels like you are really talking to each and everyone here. Love the vlogs!", "commenter_channel_name": "@HamyDang15", "likes": 254, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:32.094338", "replies_count": null, "liked_by_creator": false}, {"comment": "I'm loving these Japan videos they're genuinely so cozy and looking at the beautiful architecture and aesthetic of Japan is so cool. I love the pretty mountains and lights of the buildings too. Combined with Marzia's editing and the calm music is amazing. I love Marzia's editing too it's always entertaining and long enough to be cozy and slower paced but not too long to be boring dull, and not too short and fast paced. The filters on some of the shots create a great aesthetic and even the font choice of the locations and activities is great. Much love Felix and Marzia :) ", "commenter_channel_name": "@rioluvo", "likes": 273, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:32.146635", "replies_count": null, "liked_by_creator": false}, {"comment": "Japan vlogs have been so chill and relaxing to follow and I think it's good for the viewer to soak in some content that is at a slower pace every now and then to connect with that inner calm.\nKeep doing what feels natural to you :)", "commenter_channel_name": "@wavves7able", "likes": 18, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:32.184479", "replies_count": 0, "liked_by_creator": false}, {"comment": "Man, these vlogs are mystifying. Marzia is absolutely slaying the editing and soundtrack choice.", "commenter_channel_name": "@inferninx", "likes": 360, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:32.228807", "replies_count": null, "liked_by_creator": false}, {"comment": "the way felix talks about japan is so incredibly heartwarming! he seems so genuinely happy and calm that they finally made it, it makes me so emotional.", "commenter_channel_name": "@ilkabalogh9859", "likes": 258, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:32.278053", "replies_count": null, "liked_by_creator": false}, {"comment": "That clip was absolutely worth breaking a phone for", "commenter_channel_name": "@Patterrz", "likes": 386, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:32.318443", "replies_count": null, "liked_by_creator": false}, {"comment": "Felix as a long time follower i’m literally content seeing you be happy , living your day to day life, stay up my guy and stop worrying about what we want to see and have fun you’re in japan you made it dude", "commenter_channel_name": "@icyuup3383", "likes": 13, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:16:32.358627", "replies_count": 0, "liked_by_creator": false}, {"comment": "It is really cool to see how when he is alone or with Ken he is literally insane. Yet he is so calm and grounded while with Marzia ", "commenter_channel_name": "@angelamorales5816", "likes": 199, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:32.440288", "replies_count": null, "liked_by_creator": false}, {"comment": "Marzia is editing the vlogs??? I was wondering why they are so amazing! The music is so calming, always w great timing and theming. Seeing y'all happy and it being edited in such a beautiful way gives me so much serotonin thank YOU pewds for feeling comfortable sharing <3", "commenter_channel_name": "@shelboney", "likes": 136, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:32.552003", "replies_count": 0, "liked_by_creator": false}, {"comment": "The content is genuinely so endearing and authentic. There’s no gimmicks and no attention grabs, we’re all just here to see what your up to, sit back, and enjoy Japan. Hope I can see you when I return home for the first time in three years this august.", "commenter_channel_name": "@kaibrenker6056", "likes": 406, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:32.611823", "replies_count": null, "liked_by_creator": false}, {"comment": "It's amazing especially being a long time follower seeing you guys be your genuine selves and enjoying new experiences and enjoying life is soo much fun to watch I'm so excited that you're allowing us to be part of your day to day and can't help but hope that you continue to allow us the privilege :)", "commenter_channel_name": "@damnitandyyy", "likes": 31, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:32.655766", "replies_count": null, "liked_by_creator": false}, {"comment": "Seeing Maya and Edgar brings me such joy. Thinking about Maya's health brings me sadness. Then thinking about what great parents Felix and Marzia are and how dedicated they are to their dogs brings me joy again. Love you guys. Stay well.", "commenter_channel_name": "@chadphriday197", "likes": 340, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:32.698098", "replies_count": null, "liked_by_creator": false}, {"comment": "I love that Pewds is living his dream, but what I love the most is how he’s sharing this with us with such passion. Great content!", "commenter_channel_name": "@neversuperfennecwarrior9486", "likes": 390, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:32.735508", "replies_count": null, "liked_by_creator": false}, {"comment": "I really really love these. The fact that they are so genuine and your happiness is shining through really makes them special. Also love Marzias editing, missed her travel vlogs.", "commenter_channel_name": "@sandrairen1988", "likes": 187, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:32.775741", "replies_count": null, "liked_by_creator": false}, {"comment": "It's been a while since I've felt this kind of nostalgia for my hometown. I’m a Japanese person living in the States for 14 years. I hadn't come across your content until today. I just wanted to take a moment to sincerely thank you for making this video and sharing your life in Japan. It truly resonates with me and touches my heart.", "commenter_channel_name": "@%E3%82%A6%E3%82%A7%E3%83%90%E3%83%BC%E5%AE%87%E9%87%8E%E6%B2%A2%E7%94%B1%E9%A6%99%E7%90%86", "likes": 9, "date": "1 year ago", "fetched_date": "2025-01-19 14:16:32.814391", "replies_count": 0, "liked_by_creator": false}, {"comment": "As a surfer myself, I loved this so much. I know that feeling of getting that one wave, just makes you want more. Thanks pewds for the vlogs and Marzia for bringing it all together", "commenter_channel_name": "@juliettewilliams7400", "likes": 313, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:32.853873", "replies_count": null, "liked_by_creator": false}, {"comment": "Is it weird to feel happy, having watched pewds all these years, seeing him all grown and happy?", "commenter_channel_name": "@BlanketsCorner", "likes": 129, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:32.916464", "replies_count": null, "liked_by_creator": false}, {"comment": "I also wish for Maya's good health, and you guys as well . Loving the vlogs , great job Marzia on the vlogs it's aesthetically pleasing with you magic touches thank you", "commenter_channel_name": "@safinamarishka", "likes": 447, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:33.014415", "replies_count": null, "liked_by_creator": false}, {"comment": "These vlogs feel a bit like \"Lost in Translation\" - one of my favorite movies of all time. The music, the chill vibe, driving in Japan, lights, streets, calm. Really great stuff, Marzia really captures that mood very well.", "commenter_channel_name": "@jimbeam4736", "likes": 2, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:33.088756", "replies_count": 0, "liked_by_creator": false}, {"comment": "As someone who grew watching pewds back in 2012. This is so comfortable and cozy to watch. We are now entering the busy man/parent stage of our lives.", "commenter_channel_name": "@sidiper", "likes": 145, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:33.149416", "replies_count": null, "liked_by_creator": false}, {"comment": "So cool seeing Felix and Marzia in Japan, they're literally living the dream cause they've taken the time to plan and find a place they want to be, and now they're just slowing down a bit and enjoying life, it's so aesthetician and calming and you can really see them both being less stressed and just happy. It's so wholesome, I love it! ", "commenter_channel_name": "@janegray543", "likes": 253, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:33.195877", "replies_count": 0, "liked_by_creator": false}, {"comment": "The wish for Maya was so cute and sad at the same time. I hope she'll feel better\nThe vlogs are really enjoyable: we get to follow some of your adventures and experiences and Marzia's editing style makes them so relaxing", "commenter_channel_name": "@martinacampagnaro8673", "likes": 184, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:33.244942", "replies_count": null, "liked_by_creator": false}, {"comment": "I love the love that you have in your life with marzia, edgar, and maya :') you genuinely look so happy and peaceful, i love that for you!", "commenter_channel_name": "@cathwenify", "likes": 13, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:33.293025", "replies_count": 0, "liked_by_creator": false}, {"comment": "im so jealous, jealous that i have to spend my life in a hospital most of the time, while people get to just live their. these videos bring me a bit of sadness, but also comfort. im silently rooting and crying for pewds, but man am i jealous of what hes able to do... keep it up pewds, live the life i so want.", "commenter_channel_name": "@mugenfan123", "likes": 97, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:33.337586", "replies_count": null, "liked_by_creator": false}, {"comment": "I’ve been watching Felix for 10 years now and I’ve never been happier for him! It makes me feel good seeing him being happy! Thanks for giving me a good time all these years", "commenter_channel_name": "@Moussletje", "likes": 356, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:16:33.384957", "replies_count": 0, "liked_by_creator": false}, {"comment": "Theres something so happy about watching a couple live their best life, especially when you've been following them online for years. So happy for these two", "commenter_channel_name": "@GarfieldsNeighborNermal", "likes": 76, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:33.433798", "replies_count": null, "liked_by_creator": false}, {"comment": "watching a slice of life anime with a swedish protagonist, italian waifu with a cute dog, and edgar the antagonist", "commenter_channel_name": "@ellstahrz", "likes": 2, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:16:33.476889", "replies_count": 0, "liked_by_creator": false}, {"comment": "I have been kind of sad lately and I stopped watching Youtube for a week or so and I realized that watching Pewdiepie makes me happy. I love seeing him and Marzia succeed in life and that makes me smile and laugh. It makes some of the pain go away each time I watch a video of his. Thanks for the many years of videos Pewds. You've gotten me through a ton of rough times.", "commenter_channel_name": "@superpro5741", "likes": 308, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:33.523549", "replies_count": null, "liked_by_creator": false}, {"comment": "Never thought I'd see Felix's comment sections so friendly and wholesome, shows how happy we all are for him after growing up watching him.", "commenter_channel_name": "@JS-td8yp", "likes": 62, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:33.572357", "replies_count": 0, "liked_by_creator": false}, {"comment": "The older I get, the more I've been enjoying pewdiepie's content. He's amaazing. Love the vlogs", "commenter_channel_name": "@leinadliu5337", "likes": 201, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:33.629220", "replies_count": null, "liked_by_creator": false}, {"comment": "I just realized at 23, that I grew up with Felix. I’m from a French Caribbean island and you teached me a lot (kindness & humility) and I can’t forget the most important thing !! If my English is on point it’s because of you !! Thanks you for everything ️", "commenter_channel_name": "@lpf971", "likes": 2, "date": "2 years ago (edited)", "fetched_date": "2025-01-19 14:16:33.671774", "replies_count": 0, "liked_by_creator": false}, {"comment": "don’t force the vlogs if they start to feel draining! film whatever makes you happy we love you always no matter what pewds <3", "commenter_channel_name": "@madmax2k285", "likes": 155, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:33.722116", "replies_count": null, "liked_by_creator": false}, {"comment": "Marzia has a real talent for bringing these videos together! So well edited and aesthetically pleasing.", "commenter_channel_name": "@AgitpropPsyop", "likes": 162, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:33.772958", "replies_count": null, "liked_by_creator": false}, {"comment": "these are genuinely therapeutic for me personally. wishing you both and the cute doggos happy health.", "commenter_channel_name": "@kitanurag3672", "likes": 63, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:33.821494", "replies_count": null, "liked_by_creator": false}, {"comment": "I did notice her style and I feel like really close to she now (I used to love her Channel)!! I’m so thrilled, I love these vlogs, love to see you guys so happy and fulfilled 🫶", "commenter_channel_name": "@karencontreras9053", "likes": 2, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:33.867152", "replies_count": 0, "liked_by_creator": false}, {"comment": "The happiness overwhelms me Everytime i see felix enjoying in such a mesmerizing place... The rainy season is making the greenery there even more beautiful, with the breathtaking view of the clouds on the mountains and the night shots of Asakusa were very very aesthetic felix!! I can't stop smiling watching these extremely gorgeous places in japan!!!", "commenter_channel_name": "@saadsrequiemforsasuke7041", "likes": 335, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:33.959583", "replies_count": null, "liked_by_creator": false}, {"comment": "The vlogs definitely bring me back to chill vibes hanging with you guys in earlier vlogs. Love Marzia editing:)\nBeen watching you since 2012 and these videos give me a sense of nostalgia, so happy for you guys!", "commenter_channel_name": "@Jibboi997", "likes": 226, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:34.004132", "replies_count": 0, "liked_by_creator": false}, {"comment": "Honestly when I watch these, it’s not really just a vlog of you two, but an open-ended love letter to Japan.  Thank you for sharing what you two enjoy about your new home and I hope you two are safe and happy.  \n\nAlso, your canine children are precious!", "commenter_channel_name": "@jgarcia0264", "likes": 67, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:34.051557", "replies_count": 0, "liked_by_creator": false}, {"comment": "looking at pews nowadays just inspires me to be a better human man, it's crazy", "commenter_channel_name": "@kmvr6046", "likes": 1, "date": "1 year ago", "fetched_date": "2025-01-19 14:16:34.100553", "replies_count": 0, "liked_by_creator": false}, {"comment": "That new life in Japan vlogs feels like the first videos of Minecraft. \nWaiting for the next episode, mix of emotions,  so exciting!", "commenter_channel_name": "@SrGotasDeChuva", "likes": 157, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:34.149093", "replies_count": 0, "liked_by_creator": false}, {"comment": "I always am pulled right into these vlogs, they're so enticing and relaxing, that I seem to lose track of reality for a while. Towards the end I realized I was grinning the entire time. It feels like seeing a friend finally finding their peace, and that in turn makes my heart feel whole. Theres so many people that support and love you that you will never know Felix, but I think they're all okay with that.", "commenter_channel_name": "@Firebomb571", "likes": 232, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:34.197413", "replies_count": null, "liked_by_creator": false}, {"comment": "Watching these vlogs is like watching an OVA of an anime with a really satisfying conclusion, and now you just get to see your favourite characters chill out and live their happy ever after.", "commenter_channel_name": "@Ishyona", "likes": 85, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:34.249324", "replies_count": null, "liked_by_creator": false}, {"comment": "These vlogs are soo good. Totally nailing it in hitting those aesthetic japan vibes! Also the fact that Marzia edited this vlog blew my mind ", "commenter_channel_name": "@ShripatiDev2", "likes": 6, "date": "2 years ago", "fetched_date": "2025-01-19 14:16:34.297826", "replies_count": 0, "liked_by_creator": false}], "related": []}