{"code": "ZFAuSU_XaZI", "title": "The worst Hoarder on the Planet.", "url": "https://www.youtube.com/watch?v=ZFAuSU_XaZI", "thumbnail_url": "https://i.ytimg.com/vi/ZFAuSU_XaZI/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLCWterxOByBCkiAJdMtNg3wtA9zZQ", "views": 1000000, "likes": 93000, "duration": "", "embed_code": "https://www.youtube.com/embed/ZFAuSU_XaZI", "uploaded_date": "30 Sept 2023", "comments_count": 2774, "comments": [{"comment": "10 years studying to never do the exam (or fail it and abandon the idea) and this house, it all paints a picture of anxiety, distress and depression", "commenter_channel_name": "@mattbas-vi7750", "likes": 1000, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:55.755533", "replies_count": null, "liked_by_creator": false}, {"comment": "Your baby is so cuuuute, you're one of the few youtubers I've watched from childhood that hasn't either quit or had some terrible secret revealed about their past. So glad I still watch you. Hope all continues going well for you!", "commenter_channel_name": "@AlexStormDrake", "likes": 2000, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:55.793928", "replies_count": null, "liked_by_creator": false}, {"comment": "I had to clean a hoarder house before. Every time we cleaned it, we would come back, and it would look worse than last time. Idk how they managed to make it worse than it was before, but they did.", "commenter_channel_name": "@baileyg.4481", "likes": 6000, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:55.838130", "replies_count": null, "liked_by_creator": false}, {"comment": "So cool to see father and son on screen together. Ken is a great dad to Felix", "commenter_channel_name": "@D0S81", "likes": 565, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:55.876975", "replies_count": null, "liked_by_creator": false}, {"comment": "Just want to say that a horror game about guys trying to clean out a haunted house full of hoarded objects would be amazing on so many levels. Just the hoarding itself is enough to creep many people out. Throw some monsters or ghosts in there, make the story some kind of investigation into the hoarder's mysterious disappearance, add some creepy psychological elements, and you've got a full experience.", "commenter_channel_name": "@kpbr1", "likes": 433, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:55.914914", "replies_count": null, "liked_by_creator": false}, {"comment": "I want to cry for this woman. She seems so sweet, and it's so sad she was living like this. I hope she got the help she needs and is living better now. <3", "commenter_channel_name": "@strawberryboba376", "likes": 2000, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:55.952223", "replies_count": null, "liked_by_creator": false}, {"comment": "As a former hoarder (still struggling ) i will say that depression is the main culprit here. when you lose the will to live, the will to socialize and get depended on retail therapy (buying stuff online) this happens. I believe I needed non-judgmental friends that time the most. Hoarders are extremely sensitive and they have a feeling of being left out. Been there, felt that.", "commenter_channel_name": "@Hikaree13", "likes": 693, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:55.989705", "replies_count": null, "liked_by_creator": false}, {"comment": "Björn's already getting sponsorships at less than a year old. He's already looking to be a great successor.", "commenter_channel_name": "@isaacmurillo1811", "likes": 2000, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:56.027518", "replies_count": null, "liked_by_creator": false}, {"comment": "2:48\n\"Bjorn distract them with your cuteness!\"\nBjorn: ", "commenter_channel_name": "@TheSabaton1", "likes": 93, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:56.066639", "replies_count": null, "liked_by_creator": false}, {"comment": "This was actually really sad you can tell she’s not well :(", "commenter_channel_name": "@haileywilson7", "likes": 216, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:56.103697", "replies_count": null, "liked_by_creator": false}, {"comment": "Felix and Ken are so entertaining together. They truly bring out the best in each other", "commenter_channel_name": "@LucindaPug", "likes": 2000, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:56.143570", "replies_count": null, "liked_by_creator": false}, {"comment": "She seems so sweet. Hope she gets help and be better.", "commenter_channel_name": "@mike90317", "likes": 66, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:56.296956", "replies_count": 0, "liked_by_creator": false}, {"comment": "2:54 the way bjorn's eyes widened as soon as felix says \"boom\" now that's an epic entertainer in the making", "commenter_channel_name": "@cesztoo", "likes": 42, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:56.336077", "replies_count": null, "liked_by_creator": false}, {"comment": "Hording can be caused by many things. I had a great aunt that was very clean. But living during the depression then the wars where everyone gave for the war effort. Her garage was packed with extra stuff. Myself having lost everything twice in  my life has made it difficult to voluntarily get rid if items when downsizing. And that doesn't include many other ways people can become a horder.  I remember watching one of the horder episodes where a school teacher completly hid she was a horder. If you never seen inside her house you would never guess she lived like she did from her appearance in her public.  There are many different people you would never imagine that live like this.", "commenter_channel_name": "@MarkLindgren69", "likes": 48, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:56.386741", "replies_count": 0, "liked_by_creator": false}, {"comment": "my heart aches for her. i hope so so badly that she got the help that she needs and got to bake and cook for her family like she wanted to. god bless her. ️", "commenter_channel_name": "@angelina.0628", "likes": 57, "date": "1 year ago (edited)", "fetched_date": "2025-01-19 13:36:56.425214", "replies_count": 0, "liked_by_creator": false}, {"comment": "Embarrassed to admit that the Bjorn bait worked miraculously, watched the entire sponsor up until he was put away", "commenter_channel_name": "@Bruhmeister0", "likes": 5000, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:56.462273", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewds holding his baby to tempt us into watching the ad is definitely working", "commenter_channel_name": "@bom1310", "likes": 11000, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:56.500209", "replies_count": null, "liked_by_creator": false}, {"comment": "I feel a panic attack coming on thinking about having to clean a house like that. I feel very sorry for people who suffer from hoarding even though they can be really frustrating.", "commenter_channel_name": "@cruisematt8585", "likes": 207, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:56.549433", "replies_count": 0, "liked_by_creator": false}, {"comment": "I hoard stuff due to ocd and trauma and tbh I see myself in these people and it makes me so sad, I’m on a much smaller scale because I’m lucky enough to have people in my life and opportunities to help get me out of my habits, but on any scale it’s so hard to deal with. I truly feel horrible for these people and what they must be going through to get this bad, I hope they find peace and happiness and are able to get help.", "commenter_channel_name": "@absulte0", "likes": 8, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:56.586997", "replies_count": 0, "liked_by_creator": false}, {"comment": "Normally these hoarders episodes are my favorite to watch ever, but this one hits wrong. The woman is clearly delusional and I hope she got help.", "commenter_channel_name": "@Krystal907", "likes": 57, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:56.622398", "replies_count": 0, "liked_by_creator": false}, {"comment": "Wow, what a nice video ", "commenter_channel_name": "@CinnamonToastKen", "likes": 3000, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:56.661737", "replies_count": null, "liked_by_creator": false}, {"comment": "This happened to me too. I've lost almost ten years to studying. Once you've put in so much effort it's really hard to quit, even when you know you can't do it. It's hard to admit to other people as well, because you might be judged. You can never be honest to other people again, and be yourself around them.", "commenter_channel_name": "@seasong7655", "likes": 42, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:56.699180", "replies_count": 0, "liked_by_creator": false}, {"comment": "One of my father’s coworkers is a horder. He had a heart attack a few years ago, so my father and some other coworkers got together to clean his house and property. The bathroom was the worst, the toilet was filled to the brim with piss and shid, so my father was in the basement trying to fix the water lines and while he was doing that he turn the water on to check if he fixed it, almost immediately he hears his coworkers screaming for him to turn it off so he did and ran upstairs. The water pressure was so strong that it blew all of the contents of the toilet all over the bathroom and his coworkers, everyone was gagging and running outside", "commenter_channel_name": "@xraylegacy", "likes": 453, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:56.741325", "replies_count": null, "liked_by_creator": false}, {"comment": "I remember hearing a story about two brothers living in New York being hoarders for phone books, one of them died, when a pile of them fell on him, he was recovered many years later, when the other brother died and the apartment was torn down. I sometimes feel like when I have 2-3 pizza boxes I just haven't found the will to clean up, that it gets a little to much and throw it in the trash the morning after on my way to work. This is just wow, how do you even get to that point?", "commenter_channel_name": "@DuckAllMighty", "likes": 5, "date": "1 year ago (edited)", "fetched_date": "2025-01-19 13:36:56.779527", "replies_count": 0, "liked_by_creator": false}, {"comment": "both of my parents are hoarders so i know from experience what hoarding behaviour looks like. but this is a whole new level. you need an entirely separate diagnosis for this.", "commenter_channel_name": "@RubitheRacoon", "likes": 11, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:56.817367", "replies_count": 0, "liked_by_creator": false}, {"comment": "Hoarders make me sad because my mom has tendencies but isn't a full on hoarder. Lots of immigrants did not have a lot growing up, so letting go of stuff as an adult is hard, even if they don't hold any value. Gotta come from a place of empathy", "commenter_channel_name": "@emily_kim", "likes": 532, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:56.854265", "replies_count": null, "liked_by_creator": false}, {"comment": "Hoarding is a form of OCD that runs in my family. Objects become directly related to you as a person so the more stuff you have, the more you are as a person. That's why throwing stuff away can be so traumatizing for people in this extreme condition. You're not throwing away objects - your throwing away \"me.\"", "commenter_channel_name": "@Evelyn_Okay", "likes": 161, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:56.893035", "replies_count": null, "liked_by_creator": false}, {"comment": "This is just super sad. She has obviously been through trauma or something else for her to end up like this. It must be some sort of psychological coping mechanism. I can't imagine anyone living like this and being happy or healthy", "commenter_channel_name": "@tsuriranpu", "likes": 785, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:56.931012", "replies_count": null, "liked_by_creator": false}, {"comment": "Watching TLC with ken and pewds is like entertainment at its peak. \nKeep this videos coming man TLC has alot of content", "commenter_channel_name": "@aniket8350", "likes": 1, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:56.965958", "replies_count": 0, "liked_by_creator": false}, {"comment": "As a person who LOVES to throw away things, this is just mindblowing.", "commenter_channel_name": "@Bomberdumb", "likes": 16, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:57.003250", "replies_count": 0, "liked_by_creator": false}, {"comment": "This is really sad and I do wonder what happened in her life for her to lose control like this. Maybe it's also the reason why she never finished her law degree? Something traumatic could have happened around that time. If your surroundings are this disorderly, they usually reflect what is going on on the inside of you.\n\nI wish her all the best", "commenter_channel_name": "@FrogAtPond", "likes": 243, "date": "1 year ago (edited)", "fetched_date": "2025-01-19 13:36:57.042368", "replies_count": null, "liked_by_creator": false}, {"comment": "I love the idea of the cameraman not even wearing a safety suit or anything. Just tanking the germs, smells and rat butt bites.", "commenter_channel_name": "@lockerbuddy2039", "likes": 129, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:57.080460", "replies_count": 0, "liked_by_creator": false}, {"comment": "2:42 not ashamed to admit that having bjorn there worked and i watched the whole ad sponsor ", "commenter_channel_name": "@joannah4587", "likes": 23, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:57.119427", "replies_count": 0, "liked_by_creator": false}, {"comment": "She doesn’t come across as a hoarder type, funnily enough. She’s so positive and bubbly and doesn’t look tired, depressed and slow-moving like the people on the hoarders shows usually do.", "commenter_channel_name": "@MightyMoon1", "likes": 8, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:57.183370", "replies_count": null, "liked_by_creator": false}, {"comment": "It’s sad seeing people live like this, it’s clear their not well I hope she gets the help she needs", "commenter_channel_name": "@emma_nutella58", "likes": 219, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:57.222646", "replies_count": null, "liked_by_creator": false}, {"comment": "Pewds holding his baby in order to tempt us into watching the ad might probably be by far the smartest move he has ever made.", "commenter_channel_name": "@dwerical", "likes": 1000, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:57.260955", "replies_count": null, "liked_by_creator": false}, {"comment": "It’s so heart breaking hearing her voice as she describes the kitchen as being her favorite…", "commenter_channel_name": "@gabrielsalahi3656", "likes": 124, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:57.299309", "replies_count": null, "liked_by_creator": false}, {"comment": "Hoarding is a very serious mental illness and people seem to think it's so funny until they are get involved or are related to someone suffering. It isn't something that can be entirely fixed with cleaning", "commenter_channel_name": "@flanthief", "likes": 7, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:57.335179", "replies_count": 0, "liked_by_creator": false}, {"comment": "I just spent all day cleaning a hoarders house, and it’s so frustrating trying to help them because they want help, but when the process starts it’s like a brick wall is instantly up and it’s an uphill battle", "commenter_channel_name": "@jordgasbord", "likes": 3, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:57.369766", "replies_count": 0, "liked_by_creator": false}, {"comment": "Seeing Felix become a dad is like seeing your best friend since childhood becoming a parent. I've been subscribed since the Amnesia days, I always looked forward to his videos coming home from school, because it was the best part of the day. It's so great seeing him so happy :) And I love the name he picked for his son, true viking name!", "commenter_channel_name": "@thewildhealer541", "likes": 28, "date": "1 year ago (edited)", "fetched_date": "2025-01-19 13:36:57.408892", "replies_count": 0, "liked_by_creator": false}, {"comment": "Felix just face palming like a disappointed dad sums up this entire house situation.", "commenter_channel_name": "@vegeta4836", "likes": 860, "date": "1 year ago (edited)", "fetched_date": "2025-01-19 13:36:57.447219", "replies_count": null, "liked_by_creator": false}, {"comment": "11:56 omg the \"bless our home\" sign was a sucker punch. I hate that this sweet woman is living this way. It's heartbreaking! I'm glad to hear she got help; I hope things turned around for her, and she's living well now. But seriously can someone make a hoarder horror game because that concept is so good", "commenter_channel_name": "@_elle", "likes": 252, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:57.487705", "replies_count": null, "liked_by_creator": false}, {"comment": "pewdiepie and ken are one of the best duos on youtube lol pewds always brings the funniest moments out of ken", "commenter_channel_name": "@mosthiphopp", "likes": 1, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:57.524041", "replies_count": 0, "liked_by_creator": false}, {"comment": "i grew up in a hoarder home and now that i moved out i now know what a clean house is like and im also a minimalist, i dont like anything on my floors besides a rug and i just wanna keep my space clean and not end up like my dads house\n\nedit: btw if a house gets that bad it needs to be condemned where it has to be demolished, im surprised it even got bought", "commenter_channel_name": "@Vaidiss", "likes": 63, "date": "1 year ago (edited)", "fetched_date": "2025-01-19 13:36:57.594549", "replies_count": null, "liked_by_creator": false}, {"comment": "I have been so used to seeing the pups being cradled in Felix’s arms during ad reads for years and years that seeing Björn and his little baby face threw me in such a loop  gonna be wondering now who it’s gonna be every time he pauses for ad reads", "commenter_channel_name": "@aaahhhhmyleg", "likes": 75, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:57.631626", "replies_count": 0, "liked_by_creator": false}, {"comment": "Just worked a job where we were cleaning out a hoarder house that had partially burned down, spending time shoveling garbage, hoarder items, asbestos/other flame retardant materials, and ash soot etc was one of the most hazardous things I've ever done. Switched my mask like 4 times during the job, they were black but not too bad, then I realized the slight opening at the top was pitch black, prob took a year off my life for 24$/hr", "commenter_channel_name": "@nchan602", "likes": 59, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:57.672572", "replies_count": null, "liked_by_creator": false}, {"comment": "Lol I love that you’re choosing to involve your son in your content Felix. Hope this channel never dies ", "commenter_channel_name": "@austinrock7636", "likes": 3, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:57.709036", "replies_count": 0, "liked_by_creator": false}, {"comment": "9:44 When your house smells so bad that even a gas mask is ineffective.", "commenter_channel_name": "@NaudVanDalen", "likes": 4, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:57.747146", "replies_count": 0, "liked_by_creator": false}, {"comment": "9:54 idk why I find this shot of two guys in hazmat suits peering over a literall mountain of trash, heads almost touching the ceiling, and just sorta staring off depressedly into the distance so funny XDD", "commenter_channel_name": "@ragey_8000", "likes": 6, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:57.783897", "replies_count": 0, "liked_by_creator": false}, {"comment": "Damn I actually feel so bad for this lady, feels like she went thru a series of unfortunate events which broke her.", "commenter_channel_name": "@zCopyCatz", "likes": 710, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:57.824129", "replies_count": null, "liked_by_creator": false}, {"comment": "Felix and Ken are such a fine combination.\n\nI can't get enough of you two bouncing off each other.", "commenter_channel_name": "@Cryptid_Renfri", "likes": 26, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:57.860851", "replies_count": 0, "liked_by_creator": false}, {"comment": "1:35 That's impossible 300k tiny skittles would nearly fill up half a room. Are they counting the molecules of dust in your room or something?", "commenter_channel_name": "@Mochi-lf5rz", "likes": 3, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:57.898906", "replies_count": 0, "liked_by_creator": false}, {"comment": "The smell alone is enough to make me not understand how someone can live like that. I wait a day or two to bring out the trash after throwing leftovers away and I'm almost at the limit. I would die from the smell alone. Jesus.", "commenter_channel_name": "@TheJanstyler", "likes": 18, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:57.962331", "replies_count": 0, "liked_by_creator": false}, {"comment": "This just makes me wanna clean my house 3x as much.", "commenter_channel_name": "@pinkeye459", "likes": 162, "date": "1 year ago (edited)", "fetched_date": "2025-01-19 13:36:58.003818", "replies_count": null, "liked_by_creator": false}, {"comment": "Great to see Ken help small Youtubers like Felix.", "commenter_channel_name": "@stingfiretube", "likes": 11, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:58.040943", "replies_count": 0, "liked_by_creator": false}, {"comment": "Coming back to watch this one again for continuity with his (Ken’s) most recent video of the same house", "commenter_channel_name": "@yikes8322", "likes": 2, "date": "2 months ago (edited)", "fetched_date": "2025-01-19 13:36:58.079477", "replies_count": 0, "liked_by_creator": false}, {"comment": "The \"wizard sticks\" are to stab the trash before they step on it, so they know their foot won't sink in, and avoid the rats crawling up their leg.", "commenter_channel_name": "@TimPortantno", "likes": 28, "date": "1 year ago (edited)", "fetched_date": "2025-01-19 13:36:58.143656", "replies_count": 0, "liked_by_creator": false}, {"comment": "I've struggled to clean my whole life. The hoarding on this level just baffles the mind.", "commenter_channel_name": "@crazyjoeshorts5256", "likes": 15, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:58.179226", "replies_count": 0, "liked_by_creator": false}, {"comment": "Honestly, Felix is showing the baby way more than I expected him to. Cute baby, wonder how long we'll have him around the camera.", "commenter_channel_name": "@cochibi2501", "likes": 17, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:58.217976", "replies_count": 0, "liked_by_creator": false}, {"comment": "I have family members who hoard... and it's something I battle myself daily... It's hard to explain, you just end up emotionally attached to things, or try to convince yourself that you may need them someday. I'll never be neat and tidy, much less an epic minimalist, but at least where I live will never become the sort of spectacle you see on these shows. I really need to let go of old clothes and books, though. Those are the hardest for me.", "commenter_channel_name": "@lautreamontg", "likes": 4, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:58.253876", "replies_count": 0, "liked_by_creator": false}, {"comment": "i love these videos with ken and having bjorne there while you’re doing the sponsor is working", "commenter_channel_name": "@hannahpaulk8499", "likes": 1, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:58.292173", "replies_count": 0, "liked_by_creator": false}, {"comment": "I was enjoying the video so much didn't realize 14mins was so short thankyou as always for the fun video pewds and ken!", "commenter_channel_name": "@fatimahsufian7495", "likes": 37, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:58.329589", "replies_count": 0, "liked_by_creator": false}, {"comment": "I know she tidied up as much as possible before she allowed cameras in, too. This is the best it's probably looked in years", "commenter_channel_name": "@RoshDroz", "likes": 92, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:58.367541", "replies_count": null, "liked_by_creator": false}, {"comment": "0:03 what my parents say the kitchen looks like, because there is a single cup left on the counter.", "commenter_channel_name": "@yellowishgreendragon.-.", "likes": 8, "date": "1 year ago (edited)", "fetched_date": "2025-01-19 13:36:58.406551", "replies_count": 0, "liked_by_creator": false}, {"comment": "I love watching hoarder TV shows!! I never thought to recommend hoarder video to pewds as he is an epic minimalist.", "commenter_channel_name": "@SandyHolmes0001", "likes": 1, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:58.443326", "replies_count": 0, "liked_by_creator": false}, {"comment": "Im so happy but sad at the same time, how much he has grown and accomplished. So happy for them both <3, will continue to follow their  paths !", "commenter_channel_name": "@quillanaa2737", "likes": 21, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:58.507863", "replies_count": null, "liked_by_creator": false}, {"comment": "I've always wanted to clean hoarder houses. Not as the person talking to the hoarder, but one of the people in the background with the shovel and a hazmat suit.", "commenter_channel_name": "@wendygreene", "likes": 18, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:58.548739", "replies_count": 0, "liked_by_creator": false}, {"comment": "yall together with some TLC will always be my favorite thing", "commenter_channel_name": "@Mickey_R", "likes": 5, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:58.584452", "replies_count": 0, "liked_by_creator": false}, {"comment": "I just had to watch you guys during my lunch break. My lunch is officially ruined  Thanks!!", "commenter_channel_name": "@friendnamedjane8686", "likes": 4, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:58.648428", "replies_count": 0, "liked_by_creator": false}, {"comment": "Honestly I could watch Felix and Ken watch this type of content all day", "commenter_channel_name": "@TAYI0R1", "likes": 13, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:58.685487", "replies_count": 0, "liked_by_creator": false}, {"comment": "that rat at 6:55 is 100% a domesticated rat not denying the house has rats but that is one they placed there for filming.", "commenter_channel_name": "@devon12346", "likes": 5, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:58.721992", "replies_count": 0, "liked_by_creator": false}, {"comment": "Although he doesn't do it as often. I always get so excited when Felix uploads. Thanks for making my day.", "commenter_channel_name": "@MuhammedKhabbab", "likes": 50, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:58.760801", "replies_count": null, "liked_by_creator": false}, {"comment": "10:06\nThe creepy hand reaches up, possibly to grab you! Until you see its holding, hand sanitizer wipes.", "commenter_channel_name": "@alissa2733", "likes": 4, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:58.851191", "replies_count": 0, "liked_by_creator": false}, {"comment": "She basically has a whole ecosystem of mold and rodents in her own house", "commenter_channel_name": "@wilfredomanuel3470", "likes": 426, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:58.890407", "replies_count": null, "liked_by_creator": false}, {"comment": "I can't imagine watching the whole documentary. You guys made it bearable to watch", "commenter_channel_name": "@rodeanalfanteforcadela7645", "likes": 5, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:58.926039", "replies_count": 0, "liked_by_creator": false}, {"comment": "I love watching hoard clean ups, so that she even has power in that house is impressive", "commenter_channel_name": "@SandroilaKook", "likes": 6, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:59.014706", "replies_count": 0, "liked_by_creator": false}, {"comment": "Haven't watched in years, but you on cdawgs crane game reminded me how genuinely entertaining you are", "commenter_channel_name": "@vinnyvanhoe5614", "likes": 7, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:59.051514", "replies_count": 0, "liked_by_creator": false}, {"comment": "We truly appreciate you Felix.", "commenter_channel_name": "@Thomas_Angelo", "likes": 88, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:59.088817", "replies_count": 0, "liked_by_creator": false}, {"comment": "If it was indeed a horror game like Felix said, I wouldn’t even want to think about how filled the basement would be if this house even had one", "commenter_channel_name": "@rieJW", "likes": 5, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:59.123513", "replies_count": 0, "liked_by_creator": false}, {"comment": "I feel so sad watching this. She seems to be clinging to the past through the items she keeps :(", "commenter_channel_name": "@N.O-t9v", "likes": 5, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:59.160798", "replies_count": 0, "liked_by_creator": false}, {"comment": "Bjorn’s first words are going to be, “but first, word from our sponsor”", "commenter_channel_name": "@roberto05132", "likes": 13, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:59.198678", "replies_count": 0, "liked_by_creator": false}, {"comment": "Please collaborate more with Ken. You two together always make me cry, laughing.", "commenter_channel_name": "@babybluecheeks", "likes": 7, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:59.233929", "replies_count": 0, "liked_by_creator": false}, {"comment": "hope she gets help with her issues and depression", "commenter_channel_name": "@KrackDaddy", "likes": 82, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:59.274117", "replies_count": null, "liked_by_creator": false}, {"comment": "Haven't laughed this much in a while, thanks Pewds and Ken", "commenter_channel_name": "@ghostrider919", "likes": 2, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:59.335487", "replies_count": 0, "liked_by_creator": false}, {"comment": "3:07 will be Bjorns first words.", "commenter_channel_name": "@MoorganHart", "likes": 8, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:59.372098", "replies_count": 0, "liked_by_creator": false}, {"comment": "This house genuinely looks like the setting for some of the most disturbing nightmares I've had.", "commenter_channel_name": "@aford328", "likes": 4, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:59.409775", "replies_count": 0, "liked_by_creator": false}, {"comment": "Hoarding is so sad. Imagine letting it get to that stage. I feel itchy and anxious just watching it", "commenter_channel_name": "@jj-if6it", "likes": 1, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:59.444725", "replies_count": 0, "liked_by_creator": false}, {"comment": "Feel so sad for this person who has obviously had childhood trauma. Shame on you both for laughing and making fun of her distress. She has CPTSD. Why don't you help this person? May god teach you compassion. And teach you a lesson as well. And so it is.  Karma.", "commenter_channel_name": "@JJ_FLA", "likes": 1, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:59.482776", "replies_count": 0, "liked_by_creator": false}, {"comment": "I've been watching the ad read 5x just to see bjorn cluelessly watching his father screams", "commenter_channel_name": "@GnomNom", "likes": 11, "date": "1 year ago", "fetched_date": "2025-01-19 13:36:59.518184", "replies_count": 0, "liked_by_creator": false}], "related": []}